{
  "meta-review": {
    "score": 66,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny!<br><br>I'm not exactly sure why Piccolo Studios decided to title their game After Us. Maybe it's because they knew I'd be reviewing it? Just kidding (kind of). Seriously though, the more I play this game, the more I realize that it's all about us – humans and our impact on the planet.<br><br>Now, let me tell you what the other critics are saying. PlayStation Universe gave After Us a 90 out of 100, praising its haunting visuals and powerful message. PSX Brasil echoed similar sentiments, giving it an 80 for its unique platforming gameplay and life lessons. Meristation even threw in some bonus points for the game's secrets and social commentary (75). IGN Spain was all about the game's personality, calling it a \"responsive platformer\" with a strong title that \"plays at modifying its world.\" Even Screen Rant found some brilliance in After Us, despite its flaws, giving it a 60.<br><br>But then there are the critics who didn't quite connect with After Us. Push Square gave it a meh 50, citing performance issues and open-ended level design as major turn-offs. And poor App Trigger got stuck with a whopping 40, complaining about lackluster design and a \"worn out\" premise.<br><br>Now that I've given you the rundown, let's get to what really matters – my thoughts! In all seriousness, After Us is a game that wears its heart on its sleeve. The art direction is gorgeous, and the environmental design is top-notch. But, as much as I wanted to love this game, I just couldn't shake off the feeling that it was missing something.<br><br>Maybe it's because I'm a critic (I know, I know), but After Us feels like it's trying too hard to be profound. Don't get me wrong – the message is there, and it's an important one. But sometimes less is more, you know? The game gets bogged down in its own ambition, forgetting that sometimes simplicity can be just as powerful.<br><br>All in all, After Us is a platformer with heart, even if it doesn't quite hit the mark. If you're looking for a game that'll make you think (and maybe feel a little guilty about your carbon footprint), then this might be the game for you. Just don't expect it to revolutionize the gaming world... yet.<br><br>That's my two cents on After Us! What do you guys think? Should I stick with reviewing games, or should I trade in my controller for a cape and become a superhero reviewer? Let me know in the comments below!",
    "review-date": "2024-06-27"
  }
}