{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny!<br><br>Alright, let's get this groovy review party started! I'm here to give you the lowdown on Astor: Blade of the Monolith, a game that's all about wielding ancient magic and slicing up baddies. Now, before we dive in, I want to warn you that my review might be a tad biased – after all, who doesn't love a good ol' hack-and-slash adventure?<br><br>So, what's the verdict? Well, let me tell you, Astor: Blade of the Monolith is like a groovy little brother – it's got its quirks and flaws, but deep down, it's still a lovable scamp. Critics like SpazioGames and The Games Machine are all about that old-school action RPG vibe, praising the combat system and the game's ability to evoke a sense of nostalgia.<br><br>Now, I'm not one for repeating what others have said (boring!), so let me give you my two cents. In a nutshell, Astor: Blade of the Monolith is an enjoyable romp that's all about experimentation. You get to hack and slash your way through hordes of monsters, unlock new abilities, and – if you're feeling extra adventurous – try out some sweet finishing moves.<br><br>Of course, no game is perfect (except maybe Portal), and Astor: Blade of the Monolith has its fair share of drawbacks. Some critics, like RPGamer, have called it a game that's still in development hell, citing bugs and underdeveloped mechanics. Ouch!<br><br>On the other hand, I think GameSkinny and IGN France got it just right when they said Astor is an honest and enjoyable title – flaws and all! It's not going to set any records for innovation or originality, but hey, sometimes a good ol' fashioned hack-and-slash romp is just what you need.<br><br>So, there you have it – my hippo-approved review of Astor: Blade of the Monolith. Whether you're a fan of old-school action RPGs or just looking for something new to sink your teeth into (pun intended), this game's got its charm. Give it a try and see what you think!",
    "review-date": "2024-06-10"
  }
}