{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - <br><br>Alright, folks! It's time to dive into the world of Astor: Blade of the Monolith, a game that's all about hacking and slashing your way through a rich fantasy realm. And let me tell you, it's got its fair share of charm and excitement.<br><br>Now, I know what you're thinking - \"What does this reviewer think?\" Well, let me tell you, I've read my fair share of reviews from the likes of SpazioGames, God is a Geek, The Games Machine, Shacknews, and RPGamer. And while they all had their own take on Astor: Blade of the Monolith, one thing's for sure - this game is all about the combat.<br><br>But before we get into that, let me ask you - have you ever felt like you're stuck in a rut? You know, where the same old things just aren't cutting it anymore. Well, Astor: Blade of the Monolith is like a breath of fresh air. It's a game that takes all the familiar elements of an action RPG and turns them on their head.<br><br>And then there's the world itself - oh boy, is it ever beautiful! From the lush forests to the snow-capped mountains, this game's got some serious visuals going for it. And let me tell you, it's not just about looking pretty - the environments are actually functional too, with all sorts of hidden secrets and secrets waiting to be uncovered.<br><br>But what really sets Astor: Blade of the Monolith apart is its combat. Now, I know some critics were saying that it got a bit repetitive towards the end, but I say, \"Phooey!\" That's just part of the fun! And trust me, when you're slicing through hordes of goblins and orcs like they're nothing more than so much butter on a hot knife - well, let's just say it's a rush!<br><br>So, there you have it - my take on Astor: Blade of the Monolith. It may not be perfect, but what game is? At least this one's got some serious charm and excitement going for it. So if you're looking for something new to play, why don't you give this one a try? You won't regret it!<br><br>And remember - always keep your sword sharp and your wits about you!",
    "review-date": "2024-05-31"
  }
}