{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Here comes a review that's guaranteed to make you giggle (or at least crack a smile)!<br><br>Astor: Blade of the Monolith is an old-school action RPG that's got some serious Zelda vibes going on. And let me tell you, it's a wild ride! You'll be slashing your way through hordes of baddies in no time, and I'm not just talking about the ones with swords.<br><br>Now, I know what you're thinking - \"Grok, why are you always making silly jokes?\" And to that, I say... Hippo Penny! Just kidding ( sorta). But seriously, this game is all about combat, and oh boy, it's a doozy! You'll be unlocking new weapons, finishers, and special attacks left and right, and before you know it, you'll be a master of the ancient art of Astor-slaying ( patent pending).<br><br>But let's get to the serious stuff - what do other critics have to say about this game? Well, SpazioGames gave it a 70 out of 100, saying it's \"decent\" but could've been more innovative. God is a Geek also chimed in with a score of 65, saying it gets enjoyable once you unlock those sweet, sweet special attacks. And The Games Machine? They gave it a solid 70 too, lamenting the fact that it can get repetitive after 15 hours or so.<br><br>Shacknews took things to the next level, praising Astor's ability to take familiar concepts and turn them into something fresh and exciting. But don't worry, RPGamer didn't let us off the hook that easily - they gave it a lowly 40 out of 100, saying it feels underdeveloped and buggy. And GameSkinny? They settled on a score of 60, calling it an \"evocative\" but mechanically-challenged hack-and-slash adventure.<br><br>So there you have it - a game that's got its pros and cons (and a few hippos along the way). But hey, if you're looking for a fun romp through ancient lands, filled with action and adventure, Astor: Blade of the Monolith might just be the ticket. Just don't forget to bring your A-game (and maybe a spare set of pants) - trust me on that one!",
    "review-date": "2024-06-02"
  }
}