{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - it's time to get this groovy review started!<br><br>Astor: Blade of the Monolith, a game that's all about slashing and hacking its way through ancient civilizations. I mean, who wouldn't want to wield a trusty sword and take down some nasty monsters? It's like being a hip, 8-bit version of Indiana Jones, minus the fedora (but let's be real, who needs a fedora when you have pixelated mustaches?)<br><br>But enough about me, let's get to the good stuff - or should I say, the \"not-so-good\" stuff? Yep, we're talking about what other critics thought of this groovy game.<br><br>SpazioGames gave it 70, saying it's a decent, old-school action RPG that's enjoyable but could've been more innovative. Yeah, yeah, innovation is all well and good, but sometimes I just want to mindlessly hack some orcs while listening to some sick synth tracks.<br><br>God is a Geek also scored it 65, stating that once you unlock a good selection of weapons, finishers, and special attacks, Astor: Blade of the Monolith becomes a pretty enjoyable affair. Ah, yeah, because what's more fun than having a bunch of flashy moves at your disposal? It's like being a pixelated ninja - stealthy, deadly, and totally tubular!<br><br>The Games Machine chimed in with a 70 as well, saying that Astor: Blade of the Monolith is an action game with a nice combat system, but unfortunately it tends to repeat game situations a little too often during the approximately 15 hours needed to reach the end credits. Yeah, yeah, I get it - repetition can be a real buzzkill, especially when you're trying to save the world from certain doom.<br><br>Shacknews scored it 70, praising Astor: Blade of the Monolith for its impressive sense of knowledge and understanding of not only Zelda-style exploration but character action-style combat. Who knew being a pixelated adventurer could be so... enlightening?<br><br>RPGamer, on the other hand, gave it a lowly 40, saying that Astor: Blade of the Monolith feels like a game that needed a few more months to cook. Ouch, burn! I mean, yeah, maybe some extra development time would've been nice, but hey, at least it's not as bad as that one game that shall remain nameless (cough, cough, E.T.)<br><br>GameSkinny scored it 60, calling Astor: Blade of the Monolith an evocative and charming hack-and-slash adventure with plenty of bright ideas but sub-par mechanical execution. Yeah, yeah, I get it - sometimes great ideas just don't quite translate to gameplay (looking at you, Duke Nukem Forever).<br><br>So, what's my take on Astor: Blade of the Monolith? Well, let me tell you, it's a wild ride full of pixelated pizzazz and adventure. Sure, it may have some repetition and wonky mechanics here and there, but hey, who doesn't love a good challenge? It's like they say - \"A groovy game is like a bad haircut - it may be ugly, but it'll still make you feel rad!\" <br><br>Hippo Penny - out!",
    "review-date": "2024-06-04"
  }
}