{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! I'm thrilled to dive into this delightful game, Astor: Blade of the Monolith. With its old-school action RPG vibes, I'm hoping for a nostalgic blast that'll transport me back to the good ol' days of gaming.<br><br>Now, let's see what our fellow critics have to say. SpazioGames thinks it's \"decent\" and \"enjoyable but could've been more innovative.\" Huh, that's not exactly glowing praise, but I suppose it's better than saying it's terrible! God is a Geek seems to be on the same wavelength, calling it \"enjoyable once you've unlocked some goodies.\" Yeah, no kidding – who doesn't love unlocking new toys in a game?<br><br>The Games Machine is a bit more critical, stating that Astor: Blade of the Monolith has a nice combat system but gets repetitive after 15 hours. That's a pretty big chunk of time to be stuck in a rut! And then there's Shacknews, which praises the game for its \"deep history of iteration\" and impressive understanding of character action-style combat. I mean, who doesn't love a good nod to Zelda and action games?<br><br>But wait, what's this? RPGamer thinks Astor: Blade of the Monolith is a total mess! They call it underdeveloped, buggy, and needing more work. Ouch, that's some harsh criticism! GameSkinny is even more scathing, saying the game has plenty of bright ideas but sub-par execution. Yikes, sounds like they didn't have too many nice things to say!<br><br>Okay, now that we've got all those opinions out of the way, let's get to the good stuff – my own thoughts on Astor: Blade of the Monolith! In a nutshell, I think this game is a blast (pun intended). The combat system is tight, and the exploration is reminiscent of the good ol' days. Sure, it might not be perfect, but who doesn't love a good challenge?<br><br>All in all, I think Astor: Blade of the Monolith is a hidden gem that's worth checking out – especially if you're a fan of old-school action RPGs. So go ahead, grab your sword, and get ready to swing into some seriously satisfying combat!",
    "review-date": "2024-06-05"
  }
}