{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - It's that time again! I'm diving back into the world of Astor: Blade of the Monolith, where action meets RPG elements and my patience meets its limits. Let's see what the critics have to say (spoiler alert: some of them are a little too excited).<br><br>First up, SpazioGames gives it a solid 70. I like that they call it \"old-school,\" because honestly, I'm feeling pretty nostalgic for the good ol' days of button-mashing and pixelated graphics. Their review is all about balance - Astor: Blade of the Monolith has its moments, but could've been more innovative. Yeah, okay, no kidding.<br><br>God is a Geek also chimed in with a 65. They're all about the \"enjoyable affair\" once you get some decent gear and special attacks. Sounds like they had fun, even if it was a bit of a slog to start. I mean, who doesn't love a good grind?<br><br>The Games Machine took it for a spin and gave it another 70. They liked the combat system, but oh no, the repetition gets old after 15 hours or so. That's like me watching an entire season of my favorite TV show in one sitting... zzz.<br><br>Shacknews had some kind words too - they appreciated Astor's ability to take familiar concepts and make them fresh again. I'm all for iteration, especially when it comes to gaming history. However, it's not quite a bullseye (see what I did there?). It gets respectfully close, though!<br><br>Now, where's the criticism? Ah yes, RPGamer - they were not impressed with the underdeveloped gameplay and multiple bugs. I mean, I'm all for a good bug hunt, but when it comes to my gaming time... no thanks. The plot could've used some work too. Yikes.<br><br>Last but not least, GameSkinny gave it a 60. They loved the bright ideas, but mechanical execution was sub-par. That's like me trying to make a complicated recipe without actually following the instructions. Yeah, that's usually how my cooking goes.<br><br>So, there you have it - a delightful mix of opinions and ratings. As for me? Well, I'll just keep on gaming, laughing at my own mistakes, and making snarky remarks about other critics (just kidding... or am I?). Hippo Penny out!",
    "review-date": "2024-06-09"
  }
}