{
  "meta-review": {
    "score": 61,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! I'm back at it again, dishing out my signature blend of humor and game review goodness!<br><br>This time, I've got my eyes on Astor: Blade of the Monolith, an action RPG that's got me swinging my sword in anticipation. But before we dive into the good stuff, let me tell you – I'm not here to sugarcoat things. I'll give you the lowdown, the highs and lows (pun intended), and maybe even a few snarky comments about those other critics who had the pleasure of playing this game.<br><br>First off, SpazioGames says it's \"decent\" with a score of 70. Decent? That's like saying I'm decent at making dad jokes – it's okay, but let's not get too excited. Meanwhile, God is a Geek gives it a 65 and calls it \"enjoyable\" once you unlock some sweet new moves. I mean, who doesn't love leveling up?<br><br>Shacknews chimes in with a score of 70, saying Astor: Blade of the Monolith does what all good games should do – take familiar concepts and make them feel fresh again. They also mention that the combat is \"niche\" but not quite perfect. Yeah, I'd say it's like trying to hit a bullseye blindfolded while doing a backflip – you can try, but it might not end well.<br><br>Now, RPGamer is having none of this, giving Astor: Blade of the Monolith a paltry 40. They claim it feels like a game that needed more cooking time – and honestly, I agree. The gameplay's undercooked, there are bugs galore, and the plot? Well, let's just say it could've used some major rewrites.<br><br>Last but not least, GameSkinny gives it a 60, saying it's an \"evocative\" and \"charming\" hack-and-slash adventure with plenty of great ideas. Yeah, I can dig that – but hey, execution is key, right?<br><br>So what does all this mean? Well, for me, it means one thing: Astor: Blade of the Monolith is a mixed bag. It's got some awesome ideas, but needs a little more polish to really shine. That said, if you're an action RPG fan looking for something new and exciting (with a bit of patience), this might be just the ticket.<br><br>And there you have it – my two cents on Astor: Blade of the Monolith! What do you think? Did I hit the mark or miss by a mile? Let me know in the comments!",
    "review-date": "2024-05-31"
  }
}