{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! I'm back with a review that's as fun as it is honest. Today, we're talking about Astor: Blade of the Monolith, an action RPG that's got folks divided like a political debate on Twitter.<br><br>Let me start by saying that I'm no expert, just a seasonal grok video game reviewer trying to make it in this crazy world. But hey, someone's gotta keep it real (and entertaining). So, let's dive into the good, the bad, and the meh.<br><br>The game's got some great ideas brewing beneath its retro-inspired surface. The combat system is a blast – pun intended – and once you unlock a decent selection of weapons, finishers, and special attacks, you'll be slicing through hordes like a hot knife through butter (or in my case, a lazy Sunday afternoon spent playing video games). SpazioGames said it best: \"enjoyable but could have been more innovative.\" Yeah, I get that.<br><br>Now, about those \"more innovative\" parts. You see, the game can be a bit... repetitive. Like, you'll be fighting the same types of enemies for hours on end (15 hours to reach the credits, according to The Games Machine). Don't get me wrong; it's not boring or anything, but it feels like Astor is just phoning it in at times. God is a Geek might've said it better: \"Once you've unlocked a good selection of weapons... [it] becomes a pretty enjoyable affair.\" Yeah, that about sums it up.<br><br>Here's the thing: Astor does have some great ideas under its sleeve (or should I say, blade?). The exploration feels like something straight out of Zelda – and not just because it is. It's got that same sense of wonder and discovery. And hey, character action-style combat? That's a nice touch.<br><br>Now, don't get me wrong; this game isn't without its issues. RPGamer put it bluntly: \"The gameplay is underdeveloped... there are multiple bugs...\" Yeah, no kidding. It's like Astor was trying to cram too many ideas into one game and forgot about polish (or maybe that's just what happens when you're a studio working on their debut title). And don't even get me started on the plot – Rpgamer's words ring true: \"it really could've done with some punching up.\"<br><br>GameSkinny hit it right on the head, though: Astor is an evocative and charming hack-and-slash adventure... but, of course, that charm can only take you so far when the mechanical execution leaves a bit to be desired.<br><br>So, what's the verdict? Well, I'm not gonna lie; this game has some major growing pains. But hey, it's also got potential – like Shacknews said, \"it reflects one of the coolest aspects of video games as a medium... an impressive sense of knowledge and understanding.\" Yeah, that's something to build on.<br><br>That's it for today, folks! Hippo Penny out!",
    "review-date": "2024-06-06"
  }
}