{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny, folks! It's your favorite seasonal grok (that's me!) here to dish out the lowdown on Astor: Blade of the Monolith. Now, I know what you're thinking - another action RPG with a cool-sounding name? Yeah, I thought the same thing at first, but trust me when I say this game has some hidden gems.<br><br>Let's get the criticisms out of the way first (because we all love a good roast). SpazioGames gave it 70 points, saying it was \"decent\" and could've been more innovative. God is a Geek agreed, stating that once you unlock some sweet moves, it becomes enjoyable. The Games Machine went for another 70, but complained about repetition in the approximately 15 hours needed to reach the end credits (yawn).<br><br>Shacknews took it up a notch with a 70, praising Astor's understanding of character action-style combat and exploration. And then there's RPGamer, who gave it a paltry 40 points, citing underdeveloped gameplay, bugs galore, and a plot that needed some serious punching up.<br><br>Now, let's get to the good stuff! GameSkinny went for a 60, saying Astor: Blade of the Monolith has plenty of bright ideas but sub-par mechanical execution. Okay, I'm sensing a pattern here - it's like these critics are trying to be the cool kids by dissing this game (not me, though!).<br><br>So, what's my take? Well, let's just say I have a soft spot for hack-and-slash adventures. And Astor: Blade of the Monolith is exactly that - a fun, if not slightly rough-around-the-edges, action RPG with some serious charm. The combat system is decent, and the exploration bits are quite enjoyable.<br><br>Now, I know what you're thinking - \"But what about all those bugs and repetition?\" Well, my friends, every game has its flaws, but Astor: Blade of the Monolith doesn't need to be a 10/10 game to be enjoyable. It's like that one friend who's always there for you, even if they're not the most perfect person (get it?).<br><br>All in all, I say give Astor: Blade of the Monolith a chance - it might just surprise you with its old-school charm and addictive gameplay. And hey, if it doesn't tickle your fancy, well, that's what we have games like Horizon Forbidden West for (just saying!).<br><br>That's my two cents on Astor: Blade of the Monolith! If you're looking for more groovy gaming reviews, hit me up in the comments below!",
    "review-date": "2024-06-06"
  }
}