{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny -<br><br>Get ready to swing your sword, conjure some magic, and save the world (or at least, the kingdom) in Astor: Blade of the Monolith! As a seasoned grok video game reviewer, I'm here to give you the lowdown on this action RPG. So grab a bag of popcorn, sit back, and let's dive into the review!<br><br>First off, let me say that SpazioGames' assessment of the game being \"decent\" but not too innovative is spot on. It's an old-school action RPG with a dash of exploration and combat – think Diablo meets Zelda. While it may not break new ground, it's still a lot of fun to play.<br><br>God is a Geek agrees that once you get into the groove, Astor: Blade of the Monolith becomes a blast. Unlock some sweet moves, special attacks, and weapons, and you'll be slicing up monsters left and right. The games machine also gives it props for its combat system, which is indeed quite satisfying.<br><br>Shacknews, on the other hand, goes deep into the game's history and iteration, praising Astor for taking familiar concepts and adding new context to create something fresh. I'm curious about this studio's future projects after playing this one!<br><br>RPGamer, however, has a different tale to tell. They're not impressed with the underdeveloped gameplay, bugs galore, and a plot that could use some serious beefing up. Yeah, it's tough to recommend this adventure in its current state.<br><br>GameSkinny agrees that Astor: Blade of the Monolith has some bright ideas but falls short on mechanical execution. It's like they took all the right ingredients for a hack-and-slash game and mixed them together with a spoon instead of a blender – it just doesn't quite come together.<br><br>In conclusion, Astor: Blade of the Monolith is an enjoyable old-school action RPG that's worth checking out if you're a fan of the genre. It may not revolutionize anything, but it does have its charm. So, grab your sword, put on your favorite battle armor, and get ready to swing into some serious fun!",
    "review-date": "2024-06-07"
  }
}