{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Alright, folks! It's time to get our superhero game on and review the fabulous Capes!<br><br>As a self-proclaimed seasonal grok (whatever that means), I've got the scoop on what makes Capes a must-play for young players like you. But before we dive in, let me just say that I'm not exactly the most objective reviewer out there. I mean, have you seen my embarrassing gaming fails on YouTube? Yeah, I'm more of a \"game-with- flaws-and-all\" kind of critic.<br><br>Now, where were we? Ah yes, Capes! So, what do our esteemed critics have to say about this superhero-flavored turn-based tactical combat game?<br><br>IGN gives it an 80, saying that the action figure-like characters and their ultimate abilities are super fun. They also appreciate the optional objectives in each mission, which add a layer of strategy. However, they're not too keen on the stealth missions, calling them \"mostly optional\" but still worth mentioning.<br><br>On the other end of the spectrum, Gaming Age gives Capes a 60, saying it doesn't quite live up to its promise and is better off playing other superhero games or XCOM-alikes. Ouch! Looks like we've got some differing opinions here!<br><br>Meanwhile, Worth Playing thinks Capes is just plain fun, with engaging stages and exciting boss fights. They do mention that the plot might be a bit thin, but hey, who doesn't love a good ol' fashioned superhero romp?<br><br>Vandal's review is still pending (I guess they're too busy gaming to write it?), but we can assume they'll have some snazzy quips and witty one-liners. After all, that's what Vandal's all about!<br><br>Hardcore Gamer gives Capes an 80, praising its vibrant visuals, intricate gameplay mechanics, and thought-provoking narrative. They do mention a few minor issues, but overall, it's a solid addition to the superhero genre.<br><br>PC Gamer agrees with Hardcore Gamer, giving Capes an 80 as well. They say that despite some awkward storytelling, this game is one of the best turn-based strategy games out there!<br><br>Finally, GameStar gives Capes a 67, saying... well, we'll have to wait for their full review (or not). Maybe they're just too cool to share their thoughts on social media.<br><br>And there you have it - our very own review of Capes! I won't give away my score (because, let's be real, I'm a seasonal grok), but I will say that this game is an absolute blast. The combat is challenging yet rewarding, the characters are lovably quirky, and the story is... well, it's no Avengers: Endgame or anything, but it gets the job done.<br><br>So, young players, if you're looking for a fun and engaging superhero experience with a dash of turn-based strategy, Capes is definitely worth checking out. Just don't say I didn't warn you about those stealth missions...",
    "review-date": "2024-06-06"
  }
}