{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Let's get this review party started!<br><br>I'm diving into the world of Capes, a turn-based tactical combat game that promises to save the day with its superhero squad. After playing through the campaign and exploring the game's mechanics, I'll share my thoughts on whether it lives up to its promise or falls short like those pesky supervillains.<br><br>First off, let me just say that I'm no gaming guru; in fact, I'm more of a \"gaming enthusiast with questionable life choices.\" But hey, that's what makes this review so special - it's written by someone who knows that games are meant to be fun and doesn't take themselves too seriously.<br><br>Now, back to Capes. IGN praised the game for its clever combat mechanics and engaging story. I agree; watching your characters combine powers and unleash ultimate abilities is a thrill. The campaign has plenty of variety, with optional objectives to chase down and a range of enemy types to counter. Stealth missions might not be as strong, but they're mostly optional, so you can focus on the action.<br><br>On the other hand, Gaming Age wasn't impressed, saying that Capes doesn't live up to its promise. I think that's unfair; while it may not revolutionize the genre, it's still a fun game with plenty of hours of gameplay to be had. Worth Playing agrees, calling it \"just fun\" and a great example of how the XCOM formula can still work well.<br><br>Now, let me address my fellow critics - don't get too worked up, folks! Capes is a solid addition to the superhero genre, even if it doesn't break new ground. Hardcore Gamer praises its visuals, gameplay mechanics, and thought-provoking narrative, while PC Gamer simply states that it's one of the best turn-based strategy games out there.<br><br>So, what about you? Will you join me on this thrilling adventure through the world of Capes? Grab your cape (or not - we won't judge), and let's save the day!",
    "review-date": "2024-06-08"
  }
}