{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's that time of the year again when I get to don my cape and save the world from mediocre reviews. This time, I'm tackling Capes, a superhero-flavored turn-based tactical combat game that promises to be a real showstopper.<br><br>First off, let me just say that IGN is totally on board with this game. They gave it an 80 out of 100, praising its clever and challenging take on superhero-themed combat. And who can blame them? The game's visuals are vibrant, the gameplay mechanics are intricate, and the narrative is both entertaining and thought-provoking.<br><br>But don't just take IGN's word for it (although, let's be real, they're a pretty reputable source). Worth Playing agrees that Capes is just plain fun. They like how it takes the XCOM formula and gives it a superhero twist, making it a great alternative for fans of the genre. And honestly, who wouldn't want to play as a team of superheroes with flashy powers?<br><br>Now, I know what you're thinking - \"But what about the critics who didn't love Capes so much?\" Ah, yes, well, Gaming Age was not exactly thrilled with this game. They gave it a paltry 60 out of 100 and said that it doesn't quite live up to its promise. And I get it - maybe it's because they're used to playing other superhero games or XCOM-alikes that Capes just can't compete with.<br><br>GameStar, on the other hand, seemed a bit more lukewarm about this game, giving it a 67 out of 100 and not providing any additional context. Sorry, GameStar - I know you're trying to be tough and all, but sometimes a girl just wants to see some numbers and quotes, ya know?<br><br>Finally, Hardcore Gamer and PC Gamer both gave Capes an 80 out of 100, praising its engaging gameplay, narrative, and overall experience. And let's not forget Vandal, who... wait for it... didn't provide any additional context at all! I mean, come on, Vandal - you're a critic, for crying out loud! Do your job!<br><br>In conclusion, Capes is definitely a game worth checking out if you like superhero-themed games or turn-based strategy games. It's not perfect, of course (I mean, what game is?), but it's got heart and plenty of action to keep you entertained. So grab your cape and get ready to save the world - or at least, that's the idea!",
    "review-date": "2024-06-07"
  }
}