{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - It's time to get this review party started!<br><br>I'm thrilled to dive into the world of Capes, a turn-based tactical combat game that's got everyone talking. As I put on my critical thinking cap (or should I say, cape?), I'll give you the lowdown on why this game is an absolute blast.<br><br>Let's start with what IGN had to say: \"Capes' clever and challenging take on superhero-flavored turn-based tactical combat gives you all of the information you need to turn the tables on its villains.\" Ah, yes! Information is power, folks! And in Capes, you get to harness that power to save the world (or at least, your teammates). Watching those action figure-like characters combine their powers and supercharge their ultimate abilities is pure awesomeness!<br><br>But don't just take IGN's word for it - Worth Playing agrees, saying, \"Overall, Capes is just fun. If you like XCOM but wanted your heroes to have more power from the get-go, Capes scratches that itch incredibly well.\" And who can argue with that? I mean, who doesn't love a good ol' fashioned superhero showdown?<br><br>Now, I know what you're thinking - what about the haters, Hippo Penny? Fear not, young gamers! Even Gaming Age, who gave it a relatively low score of 60, still acknowledged the game's great idea. It just didn't quite live up to its promise... yet!<br><br>So, is Capes perfect? Nope! As Vandal so wisely quipped (or didn't), \"Quotation forthcoming.\" Yeah, there might be some minor audio-visual sync issues and balance quirks in the combat system. But honestly, who doesn't love a good challenge?<br><br>In conclusion, Capes is an absolute must-play for anyone looking to save the world with style! With its vibrant visuals, intricate gameplay mechanics, and thought-provoking narrative, this game sets itself up as a memorable addition to the superhero genre. And that's no small feat!<br><br>So go ahead, don your cape (if you haven't already), and join me in celebrating this fantastic turn-based strategy game. Let's see what other wonders the world of Capes has in store for us!",
    "review-date": "2024-06-07"
  }
}