{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's your boy, back with another groovy review of the most tubular games out there!<br><br>This time, I'm diving into the world of Capes, a superhero-flavored turn-based tactical combat game that's got everyone buzzing. But before we get to the review, let me just say that I'm feeling pretty confident about my analysis. After all, who needs fancy stats or flowcharts when you've got wit and charm on your side?<br><br>Now, onto the review!<br><br>So, what does IGN have to say about Capes? Well, they gave it an 80, calling it \"clever and challenging\" with \"all of the information you need to turn the tables on its villains.\" They also praised the game's teamwork mechanics, saying that watching the action figure-like characters combine their powers and supercharge their diverse ultimate abilities is a real treat. And let's not forget the story, heroes, and villains – allegedly all \"entertainingly written\" throughout the substantial campaign.<br><br>But wait, what about Gaming Age? Oh yeah, they were way less impressed, giving Capes a paltry 60. According to them, it's just another superhero game that can't live up to its promise, and you're better off playing XCOM or other games like that instead. Harsh, man!<br><br>Worth Playing, on the other hand, thought Capes was \"just fun\" – exactly what we all need in a world filled with too much seriousness! They praised the game's ability to scratch that itch for power-hungry heroes (ahem, XCOM fans) and called it an example of how the XCOM formula still has plenty of life left in it.<br><br>Now, I know some of you might be thinking, \"What about Vandal or GameStar? Don't they have something to say?\" Well, Vandal's got a quote forthcoming (whatever that means), while GameStar didn't bother with one at all – I guess they were too busy being grumpy. <br><br>Last but not least, we've got Hardcore Gamer and PC Gamer, both of whom gave Capes an 80. They praised the game's vibrant visuals, intricate gameplay mechanics, and thought-provoking narrative that explores control and resistance in a dystopian future.<br><br>So, what's the verdict? Well, let me just say that if you're looking for a fun, action-packed superhero experience with some clever teamplay thrown in for good measure, Capes might be the game for you. Just don't expect too much depth or originality – after all, as I always say, \"it's not about being the best, it's about having the most fun\"!<br><br>Stay groovy, and see you next time!",
    "review-date": "2024-06-04"
  }
}