{
  "meta-review": {
    "score": 75,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! Let's dive into this review of Capes, the turn-based tactical combat game that's got everyone flying high (pun intended).<br><br>As I played through Capes, I couldn't help but think about how much IGN loved it. And who can blame them? Watching those action figure-like characters combine their powers and supercharge their ultimate abilities is pure awesomeness. It's like having a party in your pocket! But what really sets Capes apart is its challenging gameplay that makes you think on your feet (or should I say, cape?). Stealth missions might not be the strongest aspect of the game, but who doesn't love a good challenge?<br><br>Vandal, on the other hand, seems to have been a bit more...vandal-ish in their review. Sorry, had to! But seriously, their score of 70 does seem a tad low considering all the praise from other critics.<br><br>Now, Hardcore Gamer and PC Gamer both gave Capes an impressive 80 scores, and I'm not surprised. The game's vibrant visuals and intricate gameplay mechanics make it a must-play for fans of turn-based strategy games. Plus, that commentary on control and resistance in a dystopian future is some deep stuff.<br><br>GameStar seems to have had mixed feelings about the game, giving it a 67 score. Maybe they were looking for something more...well, superhuman? But honestly, who wouldn't want to play as a group of caped crusaders?<br><br>The Games Machine took it up a notch with an impressive 83 score. I think they really got what Capes is all about: fun, complex, and colorful gameplay that'll keep you coming back for more.<br><br>Lastly, CGMagazine gave Capes a solid 70, but seemed to think it was just...good enough. Not bad, not great, just good old-fashioned gaming fun.<br><br>In conclusion, Hippo Penny thinks Capes is a game worth flying high about! With its challenging gameplay, colorful visuals, and memorable campaign, it's definitely a superhero of a game. So grab your cape, assemble your team, and get ready to save the world (or at least have a blast trying)!",
    "review-date": "2024-05-31"
  }
}