{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's your friendly neighborhood game reviewer here to give you the lowdown on Capes, the turn-based tactical combat game that's got everyone talking. Or should I say, every critic reviewing it?<br><br>I've been playing Capes nonstop (okay, maybe not nonstop, but you get the idea), and let me tell you, it's a real treat. The gameplay is top-notch, with clever combos and satisfying strategies to execute. The characters are adorable little action figures come to life, with powers that make them feel like a well-oiled machine (or a well- oiled cape, ha!).<br><br>Now, I know what you're thinking: \"What about the story?\" Well, let's just say it's...capable. I mean, it's no Oscar-winning drama, but it gets the job done. The heroes are charming, the villains are, well, villainous, and the plot is serviceable. It's not going to win any awards for originality or depth, but hey, who doesn't love a good superhero yarn?<br><br>Now, I know some of my fellow critics (ahem, Gaming Age) might say that Capes is just another me-too game in the XCOM franchise, and that it doesn't bring anything new to the table. But let's be real, folks: when it comes to turn-based combat, you can never have too many options!<br><br>IGN agrees, calling Capes \"clever and challenging\" with a nod to its well-designed mission objectives. Worth Playing says it's just plain fun, which is exactly what I was hoping for after spending hours in the trenches (or rather, on the battlefield).<br><br>And don't even get me started on Vandal – they're too busy leaving their review date blank, no doubt due to the sheer amount of cape-related puns they came up with. Hardcore Gamer and PC Gamer both gave Capes high marks for its visuals, gameplay, and narrative (though PC Gamer was a bit more stingy with its praise).<br><br>GameStar, on the other hand, seems to be still trying to get their review together – maybe they got stuck on the game's title screen forever?<br><br>All in all, Capes is a real winner. If you're a fan of XCOM or just looking for some good ol' fashioned turn-based strategy action, then this game is definitely worth your time. And remember: if life gives you lemons, make lemonade – but if life gives you a cape, make a superhero!",
    "review-date": "2024-06-05"
  }
}