{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - it's your boy here, ready to dive into the world of Capes, a turn-based tactical combat game that's got everyone talking! Well, almost everyone. Let's just say some critics are still trying to figure out their cape... I mean, strategy.<br><br>First off, let me say that Capes has got that XCOM magic going for it - you know, the kind of gameplay where you're constantly adapting to new situations and powers. But instead of being all sci-fi-y, we're in a world of superheroes! Who doesn't love watching their favorite caped crusader combo-punch some bad guys?<br><br>Now, I'm not going to sugarcoat things - some critics are saying Capes is just fun. And you know what? That's okay! Fun is exactly what we want from our games! IGN is all about that clever and challenging combat, and Worth Playing agrees that it's a great example of how the XCOM formula still has plenty of life in it.<br><br>But don't worry, I'm not just here to repeat what others have said. Oh no, I've got my own cape... I mean, take on things! So, what do I think? Well, let me tell you - Capes is a wild ride from start to finish. The action figures (yes, they're literally like action figures) come to life in the most delightful way, and those ultimate abilities? Forget about it! You'll be grinning from ear to ear as your heroes save the day.<br><br>Of course, not everyone's on board with this superhero strategy game. Vandal's being a bit mum on their thoughts (maybe they're just trying to figure out how to use their cape...), and GameStar seems to have had some balance issues in the combat system (no pun intended). But hey, even those minor quibbles can't bring down the overall awesomeness of Capes!<br><br>So there you have it - my two cents on Capes. If you're looking for a game that's all about fun and strategy, with a side of superheroes, then this is the one for you! Just remember to keep those capes flying high (see what I did there?)...",
    "review-date": "2024-06-03"
  }
}