{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny!<br><br>I'm back with another groovy review that's sure to make you wanna rock around the clock! This time, I've got my eyes on \"Capes\" - a superhero-flavored turn-based tactical combat game that's been getting all sorts of rave reviews. So, let's dive in and see if this caped crusader is worth your gaming time!<br><br>First off, IGN says Capes is \"clever and challenging,\" which is music to my ears. I mean, who doesn't love a good challenge? And it seems like the game delivers on that front, with plenty of opportunities to get creative with your team's powers and ultimate abilities. Stealth missions might be a bit hit-or-miss, but hey, even the best heroes have off days, right?<br><br>Worth Playing chimes in, saying Capes is just plain fun - and I'm inclined to agree! If you're an XCOM fan looking for more of that same strategic goodness, with maybe a few more powers at your disposal, Capes has got you covered. And even though the plot might be a bit by-the-numbers and the characters somewhat thin, it's hard not to get invested in the next exciting stage or boss fight.<br><br>Vandal, on the other hand, seems a bit more...well, let's just say they're keeping their cards close to their chest . Maybe they're just trying to keep the good stuff for themselves - we'll have to wait and see what they have to say!<br><br>Meanwhile, Hardcore Gamer is all about the positives. They rave about Capes' vibrant visuals, intricate gameplay mechanics, and thought-provoking narrative - which has me intrigued! I mean, who doesn't love a good story that makes you think? And even with some minor audio-visual sync issues and balance quirks in the combat system, they say the overall experience is still overwhelmingly positive.<br><br>PC Gamer agrees, saying Capes is one of the best turn-based strategy games out there. An awkward story might not be its strongest suit, but hey, that's just a small blemish on an otherwise fantastic game.<br><br>GameStar, however, seems to have had a slightly more...mixed experience . Maybe they're just trying to keep us all in suspense - we'll have to see what they have to say!<br><br>Finally, The Games Machine gives Capes a solid thumbs-up, saying it's the perfect game for fans of XCOM. They praise its complexity, colorfulness, and ability to challenge even the most seasoned gamers.<br><br>So, there you have it - my take on Capes! If you're looking for a fun, challenging, and thought-provoking gaming experience with plenty of opportunities to get creative, then this caped crusader is definitely worth checking out. Now, if you'll excuse me, I've got some superhero-ing to attend to...",
    "review-date": "2024-05-31"
  }
}