{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - It's that time again! I'm back to give you the lowdown on the latest game in town, and today it's all about Capes. Now, I know what you're thinking, \"What's so special about a superhero-themed turn-based strategy game?\" Well, let me tell you, it's not just about saving the world from evil; it's about teamwork, stealth, and ultimately, winning.<br><br>Now, I'm sure some of my fellow critics are salivating at the thought of diving into Capes' campaign. IGN, for one, seems to have a thing for superheroes, giving it an 80 out of 100. They praise its clever and challenging combat, saying that watching characters combine their powers is \"entertainingly written.\" I'm not sure about you, but I find myself getting lost in the world of Capes, much like IGN did.<br><br>Worth Playing also gave it a glowing review, stating that if you love XCOM but wanted your heroes to have more power from the get-go, then Capes is the answer. They found the game engaging and fun, with plenty of life left in the XCOM formula. I'm inclined to agree, as I found myself sucked into the world of Capes, eager to see what new challenges awaited me.<br><br>Now, it's not all sunshine and rainbows, folks. Vandal, for instance, seems a bit more skeptical, leaving their review blank... again. And GameStar? Well, they're still working on their quote, but I'm sure it'll be a doozy when it's done.<br><br>The rest of the critics have given Capes an 80 out of 100, praising its vibrant visuals, intricate gameplay mechanics, and thought-provoking narrative. PC Gamer, in particular, loved how the game promises hours of engaging gameplay and delivers on that promise. The only minor complaints were some audio-visual sync issues and balance quirks in the combat system.<br><br>Lastly, we have The Games Machine, which praised Capes' complexity, colourfulness, and challenge. They said it's the perfect game for those looking for a level of challenge similar to XCOM, requiring attention and strategy from the player.<br><br>In conclusion, Capes is a superhero-themed turn-based strategy game that's all about teamwork, stealth, and winning. With its vibrant visuals, intricate gameplay mechanics, and thought-provoking narrative, it promises hours of engaging gameplay and delivers on that promise. So, if you're looking for a game that'll challenge you, make you think, and have a blast with, then Capes is the way to go.<br><br>Hippo Penny, out!",
    "review-date": "2024-06-04"
  }
}