{
  "meta-review": {
    "score": 72,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - It's time to don my cape (see what I did there?) and dive into the world of Capes, a turn-based strategy game that's got everyone buzzing! Well, almost everyone. More on that later.<br><br>First off, let me just say that Capes is a real treat for fans of XCOM-style gameplay. The combat is challenging, the visuals are vibrant, and the narrative is... well, it's something. More on that in a bit too.<br><br>Hardcore Gamer gave Capes a solid 80, praising its intricate mechanics and thought-provoking story. And I get it – the game does have some real brain-twisters, especially when it comes to those pesky enemy AI patterns. But let's be real, folks: when you're dealing with a genre like turn-based strategy, there's always gonna be a learning curve.<br><br>PC Gamer was similarly impressed, calling Capes \"one of the best\" in its class. And I don't think they were just saying that to get on Santa's nice list. The game does have a certain je ne sais quoi that sets it apart from other games in the genre.<br><br>But not everyone is singing Capes' praises. GameStar gave it a measly 67, which, honestly, doesn't surprise me one bit. I mean, who doesn't love a good score with a review that's as long-winded as a French novelist? (Sorry, had to).<br><br>And then there's The Games Machine, which gave Capes an 83 and basically said it's the perfect game for fans of XCOM. Um, okay – if you're already an XCOM fan, then I guess this is just more of the same ol' turn-based goodness. But what about all you non-XCOM fans out there? Are you gonna be left in the dust, like a cape blown away by the wind?<br><br>CGMagazine and Screen Rant both gave Capes a 70, which seems pretty mediocre to me. CGMagazine said it's \"good enough\" but lacks distinction (whatever that means), while Screen Rant complained about the narrative getting too long-winded (again with the French novel thing). I guess these critics were just looking for something more... extraordinary? More like a superhero, maybe?<br><br>And then there's PCGamesN, which gave Capes a 60. Now this review is the one that really got my attention: \"Capes mostly overcomes its cliches, lack of customization, and limited scope thanks to its strategic gameplay.\" Mostly?! That's like saying a superhero saves the day but forgets their cape – what even is that?!<br><br>Anyway, that's Capes in a nutshell (or rather, a cape-shaped cookie). It's a game that'll challenge your brain, entertain you with colorful visuals, and maybe even make you question the meaning of life. But hey, isn't that what superheroes are all about?",
    "review-date": "2024-05-29"
  }
}