{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! Let's dive into the world of Capes, where superheroes soar and strategy reigns supreme!<br><br>As I embark on this review journey, I must admit that my excitement for Capes is rivaled only by my enthusiasm for poking fun at fellow critics. After all, what's a good game without some healthy schadenfreude, am I right?<br><br>Now, let's get to the nitty-gritty! With its XCOM-inspired gameplay and superhero flair, Capes has garnered praise from several notable critics. IGN, in particular, loves how the game \"gives you all of the information you need to turn the tables on its villains.\" Meanwhile, Worth Playing praises Capes for being just plain fun, saying it's a great example of how the XCOM formula can still be fresh and exciting.<br><br>But not everyone is a fan. Gaming Age thinks Capes falls short, calling it \"just another superhero game\" that doesn't live up to its promise. Ouch! Meanwhile, GameStar seems less than impressed, leaving their review open-ended with a mere \"Quotation forthcoming.\"<br><br>As for me? Well, I'll just say that my experience with Capes was...enlightening. I mean, who wouldn't want to play as a team of superheroes, combining powers and taking down villains in a turn-based tactical combat system? It's like the ultimate game of \"Heroes, Inc.\"!<br><br>Of course, no review is complete without some nitpicking. The story, while entertainingly written, might not be the most compelling. And those stealth missions? More like \"stealth-y\" optional objectives that don't quite work as well.<br><br>All in all, Capes is a game that will keep you engaged, even if it's not perfect. And who knows? Maybe with some DLC and balance tweaks, it'll be the next big thing in turn-based strategy gaming!<br><br>So, what's my Hippo Penny take on Capes? Well, I'll just say that it's a game that's equal parts fun and frustrating – like trying to get a cat to do tricks (spoiler alert: they won't). But hey, at least the graphics are purr-fectly gorgeous!<br><br>Hippo Penny out!",
    "review-date": "2024-06-08"
  }
}