{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - It's that time again where I get to don my cape (literally) and review a game that's got everyone talking! This time around, I'm putting Capes under the microscope.<br><br>Now, I know what you're thinking - \"What makes this game special?\" Well, let me tell you, it's not just the fact that I get to play as superheroes with crazy abilities. Okay, maybe it is a little bit of that. But seriously, Capes has got some serious tricks up its sleeve (or should I say, cape?).<br><br>First off, let's talk about the combat. It's turn-based, which is perfect for me because I'm not exactly the most patient person when it comes to real-time battles. And let me tell you, watching those action figure-like characters combine their powers and supercharge their ultimate abilities is a total rush! The diversity of enemy types adds an extra layer of complexity to the gameplay, making it all the more engaging.<br><br>But what really sets Capes apart is its focus on teamwork. I mean, who doesn't love a good superhero team-up? It's like playing as your own personal Justice League ( minus Superman because, let's be real, he's kind of a show-off). The game also features stealth missions, which are mostly optional but add an extra layer of challenge to the mix.<br><br>Now, I know some critics might say that the story is a bit lacking (looking at you, IGN), but honestly, who plays superhero games for the plot? Let's be real, we're all here for the action-packed gameplay and the ability to save the world from certain doom. And on that front, Capes delivers.<br><br>Worth Playing agrees with me that this game is just plain fun. The XCOM formula still has plenty of life in it, as long as you're willing to look at things from a different angle (read: superhero style). Even Vandal's \"quotation forthcoming\" couldn't bring down the game's overall positive vibe.<br><br>Now, I know some people might be thinking, \"But what about those audio-visual sync issues and balance quirks in the combat system?\" Well, let me tell you, those are just minor bumps in an otherwise awesome ride. Even Hardcore Gamer, who praised the game's vibrant visuals and narrative, didn't hold back on its minor critiques.<br><br>GameStar might have kept their quote under wraps, but even they couldn't deny the game's charm. The Games Machine summed it up perfectly - Capes is a perfect blend of fun, complexity, and colorfulness. And honestly, that's all I'm looking for in a game!<br><br>In conclusion, Capes is an absolute blast (pun intended). If you're like me and love a good superhero story with a side of tactical combat, then this game is the one for you. Trust me, it won't let you down!",
    "review-date": "2024-06-01"
  }
}