{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - I've got a review that's so good, it'll make you want to grab some popcorn, sit back, and get ready for a thrilling ride! (Sorry, had to start with something fun)<br><br>Okay, let's dive in and see what the critics have to say about Capes. First up, IGN gave it an 80%, saying that \"Capes' clever and challenging take on superhero-flavored turn-based tactical combat gives you all of the information you need to turn the tables on its villains.\" Yeah, yeah, we get it - they like the game!<br><br>But what about Worth Playing? They also gave Capes an 80% and said it's \"just fun. If you like XCOM but wanted your heroes to have more power from the get-go, Capes scratches that itch incredibly well.\" See, I told you they'd agree on something! <br><br>Now, Vandal decided to keep their review short and sweet (or not so sweet, depending on how you look at it). They gave Capes a 70% and didn't bother explaining why - maybe they were too busy being cool and mysterious?<br><br>Moving right along, Hardcore Gamer gave Capes an 80% and raved about the \"vibrant visuals\" and \"intricate gameplay mechanics.\" Yeah, yeah, we get it again - they love the game! But then they had to go and mention some minor issues with audio-visual sync and balance quirks in the combat system. Party pooper!<br><br>PC Gamer also gave Capes an 80% and said it's one of the best turn-based strategy games of recent years... even with that awkward story. We're not sure what to make of that, but hey, at least they liked the game, right?<br><br>And then there's GameStar, who decided to keep their review brief (or maybe just didn't care). They gave Capes a 67% and didn't bother explaining why - maybe they were too busy playing video games or something?<br><br>Last but not least, The Games Machine gave Capes an 83% and said it's the perfect game for those looking for a level of challenge similar to that of any XCOM. Yeah, yeah, we get it again! They love the game, and who can blame them? It sounds like a lot of fun!<br><br>So there you have it - my review of Capes is over, but I hope yours hasn't ended just yet!",
    "review-date": "2024-06-01"
  }
}