{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's your favorite grok video game reviewer here to dish out the deets on Capes. Now, I know what you're thinking - another superhero game? Yawn. But trust me, folks, this one's got some serious bite.<br><br>First off, let's get the obligatory \"XCOM comparisons\" out of the way. Yeah, Capes has that whole turn-based tactical combat thing down pat. But it's not just a rehash of XCOM; no sir, this game adds its own unique spin to the formula. Like IGN said, Capes' clever and challenging take on superhero-flavored turn-based combat gives you all the info you need to turn the tables on those pesky villains.<br><br>Now, I know some critics (cough, cough, Gaming Age) might say that Capes doesn't quite live up to its promise. But come on, folks, who doesn't love a good underdog story? The heroes and villains in this game are entertainingly written throughout the substantial campaign, and even if the plot's not exactly Pulitzer material, it's still fun to watch those action figure-like characters combine their powers and supercharge their diverse ultimate abilities.<br><br>And don't even get me started on the stealth missions - mostly optional, thank goodness. I mean, who doesn't love a good sneaky-sneak mission every now and then? Just be prepared for some... let's call them \"creative liberties\" taken in the name of game design. Wink-wink.<br><br>On a more serious note, Worth Playing nailed it when they said that Capes is just plain fun. And if you like XCOM but wanted your heroes to have more power from the get-go, Capes scratches that itch incredibly well. The by-the-numbers plot and somewhat-thin characters hold it back slightly, but the title is engaging enough to keep you invested in the next fun stage or exciting boss fight.<br><br>All in all, Capes is a great example of how the XCOM formula still has plenty of life in it, as long as you're willing to look at things from a different angle. And who knows? You might just find yourself enjoying the ride despite the occasional wobbly plot point or two.<br><br>So there you have it, folks - my two cents on Capes. Whether you're a die-hard XCOM fan or just looking for some lighthearted superhero action, this game's got something for everyone. Hippo Penny out!",
    "review-date": "2024-06-09"
  }
}