{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny!<br><br>Alright, let's get this review party started! I'm diving into the world of Capes, a game that has got everyone talking about its superhero-flavored turn-based tactical combat. And boy, do I have some thoughts to share with you all.<br><br>First off, IGN nailed it when they said Capes is \"clever and challenging.\" I mean, who wouldn't want to be a hero and save the world? The game's got that XCOM feel, where you're tasking your team of heroes to take down villains and complete objectives. And let me tell you, it's a blast! Watching my characters combine their powers and supercharge their ultimate abilities was like watching a well-oiled machine (or in this case, a well-oiled superhero team).<br><br>But what really stood out for me was the optional objectives and enemy types. Chasing those extra goals gave me so much to think about, trying to come up with the perfect strategy to take down these baddies. And don't even get me started on the stealth missions – while they might not be as polished as the rest of the game, they added a nice layer of complexity to the gameplay.<br><br>Now, I know some folks out there are saying Capes doesn't quite live up to its promise (ahem, Gaming Age). But for me, it was all about having fun. Worth Playing got it right when they said \"Capes is just fun.\" That's what it's all about, folks! The by-the-numbers plot and somewhat-thin characters might not be the most compelling, but who cares when you're in the midst of an action-packed mission?<br><br>And hey, Vandal, I know you're still working on that review, but don't worry, we won't wait up for you. PC Gamer got it spot on, too – Capes is one heck of a turn-based strategy game! And Hardcore Gamer, you said it best: with its vibrant visuals and intricate gameplay mechanics, Capes sets itself up as a memorable addition to the superhero genre.<br><br>So, what's my final verdict? Well, I think GameStar summed it up pretty nicely when they left their review... blank. Kidding aside, folks, if you're looking for a fun, action-packed experience with plenty of strategy and teamwork, Capes is the game for you!",
    "review-date": "2024-06-09"
  }
}