{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - Here's my review of Capes:<br><br>Listen up, fellow groks! Are you tired of turn-based strategy games that are as exciting as a snail on valium? Well, buckle up (or should I say, cape up?) because Capes is here to save the day!<br><br>This game has got it all: colorful visuals, intricate gameplay mechanics, and a narrative that will make you question your life choices. Okay, maybe not that last one, but you get my drift! The story's pretty solid, with heroes who are more than just their superpowers (I mean, they've got personalities too... sort of).<br><br>Now, I know what you're thinking: \"What about the combat?\" Ah, my fellow gamers, this is where Capes truly shines. It's like a mix between XCOM and, well, capes! The turn-based system is so much fun, with characters combining their powers to create some seriously epic moments. And don't even get me started on the stealth missions - they're basically just an excuse for me to pretend I'm a sneaky ninja.<br><br>Of course, not everyone will agree with my assessment of Capes. Take IGN, for example. They gave it an 80 and said it's got all the information you need to turn the tables on its villains (which is just about right, if you ask me). Worth Playing also chimed in with a similar score and some glowing praise (\"Overall, Capes is just fun\" - I couldn't agree more!).<br><br>But hey, not everyone can be as optimistic as those two. Vandal, for instance, gave it a measly 70, saying that the game's got some minor flaws (I guess they meant the part where it asks you to actually think critically...). And GameStar? Forget about it - their score was even lower!<br><br>So, what's my verdict? Well, I'm just gonna leave this one alone and say that if you're a fan of turn-based strategy games with a side of capes (see what I did there?), then Capes is the game for you! Just don't expect me to give it a score or anything - that would be too serious. Hippo Penny out!",
    "review-date": "2024-06-03"
  }
}