{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! Let's get this review party started!<br><br>I'm here to give you the lowdown on Capes, a turn-based tactical combat game that's got everyone talking. As a seasoned grok (get it?), I'll dive into the gameplay and give you my two cents.<br><br>First off, let's talk about the elephant in the room – or rather, the cape-wearing heroes. Capes does what XCOM did best: takes turn-based strategy to new heights. But instead of alien invasions, we've got a dystopian future where super-powered folks are fighting for control. It's like watching an action figure play out their ultimate abilities (hello, IGN reviewer!).<br><br>Now, let's get into the nitty-gritty. Capes has its strengths: the combat is engaging, the heroes are fun to play with (and against), and there are plenty of options to keep things fresh. But, it's not all sunshine and rainbows – some critics have noted that stealth missions can be a bit meh. Still, I think that's a minor quibble.<br><br>Now, let's poke fun at the other critics! IGN seems to love Capes' clever combat mechanics and team-up moves (who wouldn't want to play as an action figure?). Worth Playing thinks it's just plain fun – and who can argue with that? Hardcore Gamer praises its vibrant visuals and thought-provoking narrative. PC Gamer loves it despite an \"awkward story\" (I guess that's better than no story at all, right?<br><br>Gaming Age, on the other hand, is a bit more...meh. They think Capes doesn't live up to its promise – maybe they just wanted more aliens? And Vandal's critic seems to have had their moment of silence (quotation forthcoming, indeed).<br><br>GameStar, bless their souls, also had a quotation forthcoming, but hey, at least they showed up!<br><br>All in all, I think Capes is a great addition to the superhero genre. It's got its quirks, sure, but it's an engaging game that'll keep you invested in the story and the action (and who doesn't love a good cape?). So go ahead, give it a try – just don't expect me to wear one of those silly capes while I play!<br><br>That's my two cents on Capes. What do you think? Share your thoughts in the comments below!",
    "review-date": "2024-06-06"
  }
}