{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - It's Your Boy Grok Here!<br><br>Capes, the game that's got everyone donning their superhero capes (see what I did there?)! As a seasoned grok video game reviewer with witty humor (try not to blush, it's okay!), I'm here to give you the lowdown on this turn-based tactical combat extravaganza. So, buckle up and let's get this review flying!<br><br>First off, IGN says Capes is \"clever and challenging\" - yep, that's what I'm talking about! Watching those action figure-like characters combine their powers and supercharge their ultimate abilities is pure magic. It's like watching a superhero team-up in real life (minus the destruction of cities, of course). But, let's get to the good stuff: the combat. Stealth missions don't quite live up to their promise, but hey, they're mostly optional, right?<br><br>Now, Worth Playing chimes in with their praise, saying Capes is \"just fun\" - and I'm here for it! If you love XCOM but wanted your heroes to have more power from the get-go (like me!), then this game scratches that itch. The by-the-numbers plot might be a tad lacking, but the title's engaging enough to keep you invested in the next thrilling stage or exciting boss fight.<br><br>Vandal's review is still pending, but I'm guessing it'll be something like, \"Capes: A-okay, but not totally.\" (Okay, maybe not exactly, but you get the idea!). And don't even get me started on GameStar - their quote's forthcoming, but I bet it'll be some sassy remark about balance quirks in the combat system. <br><br>PC Gamer agrees that Capes is one of the best turn-based strategy games out there, despite its awkward story. Meanwhile, The Games Machine praises Capes for being \"fun, complex, and colourful\" - exactly what we want in a game!<br><br>So, to summarize: Capes is an awesome game with clever combat mechanics, engaging gameplay, and some minor quibbles (which are mostly optional). If you love XCOM or just looking for a fun time, this game's got your back! Now if you'll excuse me, I've gotta go save the world from certain doom - Hippo Penny - out!",
    "review-date": "2024-06-01"
  }
}