{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny -! Welcome to my humble abode of groovy gaming reviews!<br><br>Now, let's dive into the world of superhero-flavored turn-based tactical combat with... CAPES! (You know I'm going to make fun of myself and other critics, right?)<br><br>First off, let me just say that these reviewers are having a blast with Capes. Even Vandal, the critic known for their brutal honesty, has nothing but nice things to say about this game! Okay, okay, I know what you're thinking - \"What's the catch?\" Well, my friends, there isn't one! Or at least, not that I could find.<br><br>According to IGN, Capes is a clever and challenging take on superhero-flavored turn-based tactical combat. They love how the action figure-like characters combine their powers and supercharge their diverse ultimate abilities, making teamwork a breeze. And don't even get me started on the optional objectives in each mission - it's like they're trying to keep us on our toes! (Or should I say, on our cape-y toes?)<br><br>Worth Playing agrees that Capes is just plain fun. They're having a blast with the title and can see why fans of XCOM might enjoy this game as well. The only slight criticism is that the plot and characters are somewhat by-the-numbers, but hey, who needs complex storytelling when you have EXPLOSIONS?!<br><br>Vandal's review (ahem) will remain a mystery for now, but we're guessing they didn't find much to complain about either.<br><br>Now, it's time for some serious gaming love from Hardcore Gamer. They praise Capes' vibrant visuals and intricate gameplay mechanics, not to mention the narrative that both entertains and provokes thought. If only all superhero games could be this good!<br><br>PC Gamer chimes in with their own take on Capes - calling it one of the best turn-based strategy games of recent years. And honestly, who can blame them? It's like they took the XCOM formula, gave it a cape-y twist, and voilà! Instant fun.<br><br>Lastly, GameStar decides to keep things brief (like my attention span). Sorry, folks!<br><br>All righty then! Capes has got me all sorts of excited. I mean, what more could you ask for in a superhero game? Superheroes fighting super-villains with their trusty capes? It's like they took all the best elements from XCOM and gave them a cape-y makeover! And honestly, it seems like everyone (except Vandal... but we can't blame them for that) is having a blast with this one. So, what are you waiting for? Get ready to join the league of superheroic strategy enthusiasts and strap on your cape-y adventure!<br><br>That's all for now, folks! See you in the next groovy review!",
    "review-date": "2024-06-02"
  }
}