{
  "meta-review": {
    "score": 49,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny!<br><br>I'm back with another thrilling review of Crime Boss: Rockay City! This game had me hooked from the start, mostly because I was wondering how badly it would tank. Spoiler alert: it's not great, but hey, at least it tried... right?<br><br>Let's dive into the world of organized crime, shall we? IGN thinks this game is a \"sloppy air ball\" that fails on all fronts, from its gameplay to voice acting (ouch). I mean, come on, who doesn't love a good ol' fashioned heist? Game Informer agrees, stating it's just a void of interesting or fun things. Yeah, no kidding! Even when bugs aren't ruining the party, Rockay City is just... meh.<br><br>But wait, not all hope is lost! SpazioGames says it's \"often fun\" and will make you wonder what would've happened if you'd approached things differently. That's some encouragement right there! GamingTrend thinks the game has some conceptually interesting mechanics, but they're underutilized and overshadowed by its many flaws. Yeah, that sounds about right.<br><br>Now, I know what you're thinking: \"Is it worth my hard-earned cash?\" Well, according to Hardcore Gamer, if you like rogue-like games and 90s crime movies, Rockay City might be your cup of tea... as long as you don't mind repetition. And hey, at least it's only $40 (or less with a sale).<br><br>But let's not forget the low-hanging fruit (pun intended). Metro GameCentral calls it an \"unlikeable\" and \"blandly designed\" clone of Payday that wastes its celebrity cast on substandard script. Ouch! CD-Action agrees, saying it's just a mediocre game with some interesting ideas that failed to outweigh dated design, awful AI, and poor writing.<br><br>In the end, Crime Boss: Rockay City is like that one friend who means well but can't quite get their act together. It's not the worst thing ever (see Metro GameCentral), but it's no masterpiece either. If you're looking for a light-hearted, co-op romp with some roguelike elements and 90s vibes, Rockay City might be worth a look... just don't say I didn't warn you!<br><br>That's all for now, folks! Stay groovy, and remember: Hippo Penny says it like it is.",
    "review-date": "2024-06-05"
  }
}