{
  "meta-review": {
    "score": 49,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny -<br><br>I'm back again with another thrilling review of Crime Boss: Rockay City! This time, I get to poke fun at some other critics who clearly didn't have as much fun playing the game as I did. Or maybe they just had different taste in gangster movies?<br><br>Let's start with IGN, shall we? They gave the game a dismal 40, calling it an \"overly ambitious air ball on all fronts.\" Ouch! It sounds like they really hated this game. I mean, who doesn't love a good crime caper? Maybe they were expecting something more... cinematic? Like, oh, I don't know, a Payday or GTA game?<br><br>Game Informer wasn't far behind, giving it a paltry 30. They said the game was \"painfully dull\" and that even when bugs didn't ruin their experience, the gameplay was still underwhelming. Wow, sounds like they really didn't get into the groove of being a crime boss!<br><br>But hey, not everyone hates this game! SpazioGames gave it a respectable 68, praising its fun moments and wondering what would have happened if the developers had approached things differently. That's the spirit! And who knows? Maybe if they'd fixed those technical issues on PC, the game would be even better?<br><br>GamingTrend took a more measured approach, giving it a 55. They said the game had some interesting mechanics, but they were either underutilized or poorly tied together. And don't even get them started on the cheap deaths! Ouch indeed!<br><br>Hardcore Gamer was one of the few bright spots, giving it a 70 and saying that if you like rogue-like games and 90s crime movies (like me!), this game might be for you. Just don't expect Payday or GTA levels of excitement.<br><br>And finally, Metro GameCentral took a dim view of the game, calling it an \"unlikeable, repetitive, and blandly designed\" clone of Payday that wasted its celebrity cast on a substandard script. Oh, burn!<br><br>Last but not least, CD-Action gave it a 50 and said they were disappointed despite not having high expectations to begin with. They did, however, praise the game's co-op mode.<br><br>Well, there you have it folks! A mixed bag of reactions to Crime Boss: Rockay City. I hope my review has been more fun-filled and helpful than some of these other critics' scathing reviews. Until next time, when I'll be reviewing another game with (hopefully) more humor and less hate...",
    "review-date": "2024-06-03"
  }
}