{
  "meta-review": {
    "score": 49,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny - I'm back with another review that's sure to make you grok (get it?)!<br><br>I'm diving into Crime Boss: Rockay City, a game that's got everyone talking... for all the wrong reasons. It seems like some critics are having a field day roasting this game, and I'm excited to see if my thoughts align with theirs.<br><br>Let's start with IGN, who gave this game a score of 40. Yeah, it's an \"air ball\" alright! They're not impressed with the \"sloppy moment-to-moment gameplay\" or the \"abysmal voice acting.\" Ouch!<br><br>Game Informer took it easy on Crime Boss, giving it a score of 30. But don't worry, they still managed to find some things to dislike - like how it's \"void of anything interesting or fun to support\" its celebrity cast.<br><br>SpazioGames was slightly more positive, saying that despite the game's flaws, it can be \"fun and will make you wonder what would have happened if you decided to approach things differently.\" Unfortunately, those good design ideas are overshadowed by technical issues on PC.<br><br>GamingTrend is all about concept, saying that Crime Boss has some great gameplay mechanics, but they don't quite come together. And don't even get them started on the cheap deaths!<br><br>Hardcore Gamer likes the game's roguelike elements and 90s crime movie vibes, but warns that it's not for everyone - especially those looking for a Payday or GTA experience.<br><br>Last but not least, we have Metro GameCentral, who gave Crime Boss a whopping score of 30. They're not impressed with the game's script, calling it \"substandard\" and saying it wastes its celebrity cast on an \"unlikeable\" game.<br><br>So, what did I think? Well, let's just say that my experience playing Crime Boss: Rockay City was... eventful. There were moments where I felt like I was having fun, but those moments were few and far between.<br><br>Overall, it seems like most critics agree that Crime Boss has some potential, but is held back by its poor design choices and technical issues. As for me? Well, I'll just leave you with this: if you're looking for a game that's all about heists and gunfights, you might want to look elsewhere. But hey, at least the co-op is decent, right?<br><br>That's it for now - stay groovy, and don't forget to subscribe!",
    "review-date": "2024-05-31"
  }
}