{
  "meta-review": {
    "score": 79,
    "rating": "Outstanding Experience",
    "comment": "**Hippo Penny says:** \"Get ready for a wild ride with Cult of the Lamb! This game is like a crazy sheep-herding aunt who keeps stealing your snacks and hiding them in her...erm... lamb-cave. I mean, what's not to love? It's got a dash of dark humor, challenging layouts that will keep you on your toes (or should I say, hooves), and some of the most delightful combat this side of the sheep-pen!\"<br><br>**Ironic Note:** Meanwhile, other critics are saying things like \"[LEVEL] says it'll provide hours (maybe even dozens) of entertainment\" – who needs a whole day when you can play Cult of the Lamb for a quick 'unforgettable experience' to take with you, right? [cough]<br><br>And then there's those nice people at **GameStar**, who just love how \"black humour\" is always the best medicine (just not for Slant Magazine; more on them later). It's an excellent genre mix, according to them – if only they'd say something a bit snappier. Highly addictive? You bet! Like an ex-girlfriend's Instagram posts.<br><br>Even **Gfinity** joins in with the fun squad, saying it's \"[a] masterpiece of [an action roguelike game]\" (wow, what a compliment!). A beautiful but brutal aesthetic – you know, the usual perfect blend of beauty and a good beating. And, let's be honest, if you don't replayability in them eyes then I suppose what's the fuss all about? But, trust [them], it's absolutely worth \"a play through.\" Get that?<br><br>Nowhere to hide...for game critics like **TheSixthAxis**, who admit they can’t \"[g]ive enough praise\" for their own sanity – having created something unique and memorable, one of which is best indies ever played! It’s more 'praise for their sanity' needed, if you ask me. That one special lamb they helped spawn might have \"earned a place in the heart.\" [Love at first sight; not really.]<br><br>For others like **Shacknews**, it shines through as both wicked wonderful and just perfect under an adorable surface with lovely visual aesthetic... with sinister surprises lying beneath. Someone converted, someone new that loves roguelikes after experiencing this delightful conversion!<br><br>But then there's the inevitable harsh criticism. I suppose when you're doing great work, some like **Slant Magazine** will \"play like [an] inventory of half-understood mechanics\". Oh dear, can’t let their score get in between a true friend and Cult of the Lamb just to be nice for the sake of it, would we?",
    "review-date": "2024-09-08"
  }
}