{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! Get ready to deceive your way into the world of espionage with Deceive Inc.!<br><br>Let me get this out of the way: I'm not a professional critic like those fancy folks at PC Gamer or The Games Machine. Heck, I can barely play games without accidentally killing my character (who, by the way, has a much better death animation than mine). But hey, who needs expertise when you have wit and humor?<br><br>Now, onto Deceive Inc.! This stealthy multiplayer game promises a thrilling experience where you'll outsmart, outmaneuver, and out-gunned- (wait, no, that's not a thing) -out-witted your opponents. The formula is successful, if I may say so myself, in delivering an entertaining blend of sneaking and shooting.<br><br>But let's not get too carried away with the positives just yet. I'm not here to sugarcoat things; Deceive Inc. has its share of issues. For instance, those pesky bugs can be quite the nuisance. Oh, and don't even get me started on the confusion surrounding progression (The Games Machine, you got me there!). It's a minor annoyance, but it can be frustrating at times.<br><br>Now, I know what you're thinking: \"What about the other critics?\" Well, let me tell you, they're not entirely wrong. PC Gamer praised Deceive Inc.'s creative blend of sneaking and shooting, while NME thought it was a fantastic multiplayer game (with some minor annoyances). TheGamer, on the other hand, enjoyed the solo mode and hopes for better bug fixes soon. Shacknews saw potential in this unique game, even with its bugs. And GameSkinny... well, let's just say they had some concerns about player engagement (but hey, who doesn't love a good critique?).<br><br>In the end, Deceive Inc. is a fun multiplayer game that will keep you on your toes. It might not be perfect, but it's got heart and creativity to spare. So go ahead, gather your squad, and get ready to deceive your way to victory!",
    "review-date": "2024-06-08"
  }
}