{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! Let's dive into the world of Deceive Inc., where sneaking and shooting come together like peanut butter and jelly. Well, sort of.<br><br>As you slip into the shoes of an undercover agent, you'll find that this game is all about strategy and teamwork - kind of like trying to get your friend to do a funny dance without them realizing what's up. Except instead of making dad jokes, you're taking down enemy agents and extracting top-secret intel (or not, because let's be real, it's all about the fun).<br><br>But don't just take my word for it! The critics are chiming in, and some are actually having a blast with this game. PC Gamer gives Deceive Inc. an 82 out of 100, saying it's a \"creative blend of sneaking and shooting that will have squads coming back for more.\" High praise, if I do say so myself!<br><br>Meanwhile, The Games Machine thinks the game is doing something different from other competitive multiplayer titles - y'know, like putting on a funny hat to stand out in a crowd. They give it an 80, saying it's \"a lot of fun\" but needs more content and a premium season to keep things fresh.<br><br>Shacknews takes a slightly more laid-back approach, giving Deceive Inc. a 70. They think the game is \"refreshing\" and has some great ideas, even if it's not perfect just yet. And TheGamer agrees, sort of - they also give it a 70 and say it's fun enough to keep them playing solo mode while hoping for bug fixes.<br><br>GameSkinny, on the other hand, is a bit more...critical (heh). They think Deceive Inc. has some great mechanics, but is currently suffering from a lack of player base engagement - kind of like when your friend gets too into a game and forgets about the snacks. Ouch, harsh reviews are so fun to read!<br><br>Last but not least, NME gives Deceive Inc. an 80 and says it's a \"fantastic\" multiplayer game, just hamstrung by some minor annoyances. Yikes, sounds like they're giving it a hard time!<br><br>In the end, I think this game is worth checking out - after all, who doesn't love sneaking around, shooting things, and being a spy? It's not perfect, but hey, what game is? Even us critics can agree on that one.",
    "review-date": "2024-06-07"
  }
}