{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Hey there, gamers! It's your favorite seasonal grok (that's me) back with another review that's sure to make you laugh and maybe even convince you to give this game a try.<br><br>Today, I'm tackling Deceive Inc., the multiplayer game that's got everyone talking. Well, some people are talking about it, anyway. But don't worry, I won't let my bias towards games with funky names cloud my judgment (much). Let's get to the good stuff!<br><br>First off, Deceive Inc. is a stealthy game that combines sneaking and shooting in a way that'll keep you on your toes. The matches are fast-paced and fun, but not so easy that you'll dominate every match without breaking a sweat. And when things get intense, you'll need to use all your wits to outsmart the opposing team.<br><br>Now, I know what you're thinking: \"What about the bugs?\" Well, let's just say that Deceive Inc.'s developers are working hard to squash those pesky little critters. But don't worry, they won't ruin your experience. At least, not yet they haven't!<br><br>So, what do the critics think? Well, PC Gamer gave it an 82 and said it's a \"creative blend of sneaking and shooting that will have squads coming back for more.\" The Games Machine chimed in with an 80, saying Deceive Inc. is a stealthy game that'll keep you on your toes.<br><br>Shacknews was a bit more critical, giving it a 70 and saying it's a \"refreshing change of pace\" but needs more content to really shine. And TheGamer also gave it a 70, saying solo mode is fun enough to keep you going until the multiplayer bugs are fixed.<br><br>GameSkinny, on the other hand, was not impressed, giving it a 60 and saying that Deceive Inc.'s biggest problem is its player base - or rather, the lack thereof. And finally, NME gave it an 80, calling it a \"fantastic multiplayer game hamstrung with confusing progression\" but still worth playing.<br><br>So there you have it, folks! Deceive Inc. may not be perfect, but it's definitely worth checking out if you're a fan of stealthy gameplay and multiplayer action. Just don't forget to bring your A-game (and maybe a few bug spray) when you dive in!<br><br>Stay groovy,<br>Your favorite seasonal grok",
    "review-date": "2024-06-01"
  }
}