{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's your boy Grok, back at it again with the funkiest review game in town!<br><br>I'm here to spill the beans on Deceive Inc., a multiplayer spy-'em-up that's got everyone talking. Now, I know what you're thinking: \"Grok, why should I care about some sneaky, shooty game?\" Well, let me tell you – this one's different, folks! It's like if Jason Bourne and James Bond had a baby, and then that baby grew up to be the coolest cat in town.<br><br>The critics are raving, and for good reason. PC Gamer gave it an 82 out of 100, saying it's a \"creative blend of sneaking and shooting\" that'll keep you coming back for more. The Games Machine agreed, giving it an 80 and praising its unique stealth approach. Even NME got in on the action, awarding it an 80 and calling it a \"fantastic multiplayer game.\"<br><br>Now, I'm not gonna lie – it's not all sunshine and rainbows. Shacknews gave it a 70, saying it's a great change of pace from your typical deathmatch shooter. TheGamer also chimed in with a 70, praising its fun solo mode (which is more than you can say for some games, am I right?).<br><br>But what about the haters, Grok? Well, GameSkinny took one for the team and gave it a 60, saying it's a shame because the game has so much potential. And honestly, I get where they're coming from – there are some minor annoyances and frustrating matches to be had.<br><br>So here's the deal: Deceive Inc. is a wild ride that's all about sneaking, shooting, and scheming your way to victory. It's like if the game \"Spy Hunter\" got married to the TV show \"24\" and then they had a baby. And that baby grew up to be... well, you get the idea.<br><br>In all seriousness, though, this game is a blast – even with its flaws. If you're looking for something new and exciting in the world of multiplayer gaming, Deceive Inc. is definitely worth checking out. Just don't say I didn't warn you about those minor annoyances...",
    "review-date": "2024-06-01"
  }
}