{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! I'm excited to dive into Deceive Inc., a game that's got everyone talking - or at least, every critic worth their salt. With a mix of sneaking, shooting, and social engineering, this game's got all the makings of a hit. Or does it? Let's see what the critics are saying...<br><br>PC Gamer gives us an 82%, calling Deceive Inc. \"a creative blend of sneaking and shooting that will have squads coming back for more.\" Sounds like a slam dunk to me! But then again, PC Gamer loves everything with explosions and guns.<br><br>The Games Machine chimes in with an 80%, saying Deceive Inc. is \"a stealth approach that will distinguish it from the mass of competitive multiplayer... The formula is successful, and matches are a lot of fun.\" Yeah, yeah, we get it - you like games with strategy!<br><br>Shacknews gives us a solid 70%, praising Deceive Inc.'s creativity and concept. They even mention some bugs, but hey, who doesn't love a good challenge, right? It's all about perseverance, baby!<br><br>TheGamer also jumps in with a score of 70%, saying despite the game's bugs, it's \"fun enough that I immediately started asking my friends to play with me.\" That's what I call social proof! Now if only those friends would get on board...<br><br>GameSkinny, on the other hand, gives us a less-than- stellar 60%. Their main gripe is that players just don't seem to grasp the game's concepts, leading to frustrating matches. Ouch!<br><br>Last but not least, NME chimes in with an 80%, calling Deceive Inc. \"a fantastic multiplayer game hamstrung with confusing progression and some minor annoyances.\" Yeah, we've all been there - loving a game, but having to deal with wonky mechanics.<br><br>So what's the verdict? Is Deceive Inc. a must-play or just another forgettable multiplayer experience? I think it's safe to say that this game's got potential, but also has some growing pains to work through. That being said, if you're looking for a fresh take on competitive gaming, Deceive Inc. might just be the ticket. Just don't expect it to be perfect - yet!",
    "review-date": "2024-06-04"
  }
}