{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Here's the lowdown on Deceive Inc., the sneaky new multiplayer game that's got everyone talking (or at least, trying to get everyone talking).<br><br>So, what is Deceive Inc.? It's like a game of cat and mouse on steroids. You play as a spy, sneaking around, shooting people, and generally being a sneak. Or, you can play as the bad guys, trying to catch those pesky spies and put them out of commission. Either way, it's a wild ride that'll have you hooked from the get-go.<br><br>Now, I know what you're thinking: \"Is this just another Call of Duty clone?\" Well, let me tell you - it's not. Oh no. This game is like the cool cousin of COD. It's got its own unique charm and style that sets it apart from the rest. And let me tell you, it's a real blast (literally, in most cases).<br><br>But don't just take my word for it! Let's see what some of the other critics have to say.<br><br>PC Gamer says: \"A creative blend of sneaking and shooting that will have squads coming back for more.\" Yeah, yeah, I know - they're just saying that because they like getting paid in donuts and bagels. But honestly, their review is spot on!<br><br>The Games Machine says: \"Deceive Inc. strives to distinguish itself from the mass of competitive multiplayer with a more stealth approach. The formula is successful and the matches are a lot of fun, however more content and a premium season need to be added to offer the same variety as the kings of this genre do.\" Yeah, yeah - they're just saying that because they like complaining about games being too short.<br><br>Shacknews says: \"Outside of some bugs, Deceive Inc. is a multiplayer game like few others right now and it's a refreshing change of pace from the usual deathmatch shooter.\" Yeah, yeah - they're just saying that because they like playing video games while eating Cheetos.<br><br>TheGamer says: \"Despite its bugs, Deceive Inc. is fun enough that I immediately started asking my friends to play with me.\" Yeah, yeah - they're just saying that because they like having an excuse to get out of doing chores.<br><br>GameSkinny says: \"Deceive Inc. will live and die by its player base and so far, it's not doing too hot. It's a shame, too, since I'm such a fan of what the game has going on mechanically.\" Yeah, yeah - they're just saying that because they like being the grumpy old man who complains about everything.<br><br>And NME says: \"Deceive Inc. is a fantastic multiplayer game hamstrung with confusing progression and some minor annoyances.\" Yeah, yeah - they're just saying that because they like using big words to sound smart.<br><br>So, there you have it folks! Deceive Inc. is a real blast, and I highly recommend checking it out. Just remember: always keep your wits about you, and never underestimate the power of a good spy joke.",
    "review-date": "2024-06-03"
  }
}