{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's your boy back at it again with another groovy review of Deceive Inc.!<br><br>As you might've gathered from the title, I'm all about having fun, and this game delivers just that – a healthy dose of sneaking, shooting, and outsmarting your enemies! The reviews are in, and the critics have spoken: Deceive Inc. is an 8/10-ish kind of game (more on that later).<br><br>Let's start with PC Gamer, who gave it an 82%. They said it's a \"creative blend of sneaking and shooting\" that'll keep you coming back for more. I mean, what's not to love? The formula works, the matches are fun, and you get to be a spy – or rather, a deceivingly good one! <br><br>Next up, we've got The Games Machine with an 80% score. They praised Deceive Inc.'s unique approach, saying it sets itself apart from other multiplayer games with its stealthy vibes. Yeah, it's cool to be the one doing the sneaking, rather than just running and gunning!<br><br>Shacknews gave it a solid 70%, mentioning that outside of some minor bugs, Deceive Inc. is \"a refreshing change of pace\" in the world of multiplayer shooters. I agree – it's nice to mix things up and try something new!<br><br>TheGamer also chimed in with a score of 70%, saying despite its technical issues, the game is still fun enough that you'll want to invite your friends over for a gaming sesh! Fingers crossed they fix those bugs ASAP, so we can all have a blast together!<br><br>And then there's GameSkinny, who gave it a slightly lower 60%. They didn't mince words, saying Deceive Inc. lives and dies by its player base – which isn't doing too hot at the moment. I get what they mean – when you give players guns, sometimes they might not know how to handle them (read: use 'em wisely). <br><br>Last but not least, NME gave it an 80% score, saying Deceive Inc. is a \"fantastic\" multiplayer game that just needs some tweaking in the progression department and a bit less annoyance.<br><br>So, what's the verdict? Well, I'll let you decide – after all, gaming opinions are like gaming opinions (they're all right!).<br><br>What do you think, fellow gamers? Ready to get your deceive on and join the ranks of this sneaky spy-em-up?<br><br>Stay groovy, and I'll catch you in the next review!",
    "review-date": "2024-06-10"
  }
}