{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! Let me tell you, I'm not exactly the most stealthy reviewer out there. But hey, someone's gotta keep it real and poke fun at these serious critics, right?<br><br>Now, onto Deceive Inc.! This multiplayer game has got some serious sneaking (and shooting) skills, if I do say so myself. And apparently, some of my fellow reviewers agree – like PC Gamer, who gave it an 82 out of 100. Yeah, that's like giving me a high-five for being one of the few critics who dares to be different.<br><br>The Games Machine also weighed in, giving Deceive Inc. an 80. They say it's got a great formula and matches are super fun. I mean, what more could you want? Although, they do mention that the game needs more content and a premium season to keep things fresh – like a reviewer who's always asking for more... or is that just me?<br><br>Shacknews gave it a 70, saying it's a refreshing change of pace from your average deathmatch shooter. I'm all about trying new things, so that sounds right up my alley! And TheGamer also chimed in with a 70, mentioning that despite some bugs, the game is still fun – as long as you don't mind being solo.<br><br>GameSkinny took a slightly different approach, giving Deceive Inc. a 60. They say it's not doing too hot right now, but they do love what the game has mechanically. Ah, I get it – sometimes we reviewers just need to chill and appreciate the little things.<br><br>And finally, NME gave it an 80, calling it \"a fantastic multiplayer game.\" Yeah, that's like me saying I'm a fantastic reviewer (okay, maybe not).<br><br>So there you have it – my take on Deceive Inc.! It's got some serious potential, but let's be real, it's up to the players to make or break this game. And hey, if anyone asks, I'm ready for some sneaky fun!<br><br>Oh, and one more thing – can we please stop calling critics \"influencers\" and just call them what they are: reviewers? Just saying.",
    "review-date": "2024-06-09"
  }
}