{
  "meta-review": {
    "score": 73,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny, folks! I'm here to give you the lowdown on Deceive Inc., a sneaky multiplayer game that's got some serious mojo. Now, I know what you're thinking: \"What's the deal with these critic scores?\" Well, let me tell you - I've got my own opinions, and I'm not afraid to poke fun at the critics (more on that later).<br><br>First off, Deceive Inc.'s got some major cred going for it. It's a creative blend of sneaking and shooting that'll have squads coming back for more. That's what PC Gamer is saying, anyway. And with an 82%, you know it's gotta be good! (Just don't ask me how I managed to score a 0% - long story).<br><br>Now, The Games Machine is saying that Deceive Inc. strives to distinguish itself from the mass of competitive multiplayer with a more stealth approach. And hey, who doesn't love a good game of sneaky-sneaks? It's a formula that's successful and matches are a lot of fun... but, let's be real, we need some more content and premium seasons to really make it shine like the kings of this genre do.<br><br>Shacknews is giving Deceive Inc. props for being a multiplayer game like few others right now. And I gotta agree - outside of some bugs, it's a refreshing change of pace from the usual deathmatch shooter. It's creative, both visually and conceptually, and something worth watching... or playing, if you will.<br><br>TheGamer is having a blast with Deceive Inc., even with some pesky bugs getting in the way. Solo mode is fun enough to tide them over until they can get some multiplayer action going on.<br><br>And then there's GameSkinny, who's giving Deceive Inc. the old \"it's not you, it's me\" treatment. They love the mechanics, but hate how players just don't seem to understand what's going on. I mean, come on - when you give people guns, they're gonna wanna shoot 'em! It's like trying to get a cat to do yoga... ain't happening.<br><br>Lastly, we've got NME giving Deceive Inc. some love with an 80%. They're saying it's a fantastic multiplayer game hamstrung with confusing progression and some minor annoyances that won't bug (heh) the people who vibe with this spy-'em-up.<br><br>So, what's my verdict? Well, let me just say... I'm hippo-pediatrician-ing to get my hands on Deceive Inc. and see for myself!",
    "review-date": "2024-06-05"
  }
}