{
  "meta-review": {
    "score": 65,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - I'm back with my groovy review of Deliver Us Mars! Grab your space helmet and buckle up for some intergalactic fun (and frustration, but we'll get to that later).<br><br>First off, let's talk about the voice cast. Whoa, it's like they assembled a squad of talented astronauts... er, I mean, actors! Their performances bring the Martian mystery to life, making me wanna join the mission to Mars (minus the space travel bit, because, you know, safety first). The character writing is also top-notch - these extraterrestrial explorers are more than just pretty faces (or in this case, spacesuits).<br><br>Now, let's get to the not-so-groovy bits. Some critics might say that Deliver Us Mars \"bit off more dehydrated astronaut food than it could chew.\" I'm looking at you, IGN! Technical performance issues and poor cutscene quality can make the experience feel... well, like a spacewalk without an EVA suit - it's not exactly exhilarating. Frustrating platforming mechanics don't help, either (Worth Playing, I'm talking to you!).<br><br>On the bright side, when Deliver Us Mars does get its groove on, the puzzles and exploration are pure sci-fi bliss! It's like discovering a hidden Martian lake or stumbling upon an ancient alien artifact - it's those moments of wonder that make the journey worthwhile.<br><br>But let's not forget about the rock-climbing bit. Vandal, I'm looking at you for that one! It feels like an entirely different game... or maybe just a really grueling space-station maintenance exercise?<br><br>In conclusion, Deliver Us Mars is a mixed bag - it's a space-tacular story with some amazing performances and puzzle-solving goodness, but also some technical issues and frustrating moments. Worth Playing gets it right when they say that the game balances narrative and player agency. Edge Magazine nails it, too, highlighting the game's dramatic storytelling prowess.<br><br>Now, if you'll excuse me, I'm off to play more Deliver Us Mars (with a healthy dose of patience and a few space-themed snacks). See you in orbit!",
    "review-date": "2024-04-24"
  }
}