{
  "meta-review": {
    "score": 65,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's time to get this mars-tastic review rolling!<br><br>I'm stoked to dive into Deliver Us Mars, a game that's got everyone in the gaming community talking. As I strapped on my virtual spacesuit and prepared for lift-off, I couldn't help but wonder: would this Martian adventure deliver (heh) on its promise of thrilling gameplay and captivating storytelling?<br><br>Let me start by saying that the voice cast and character writing are top-notch! The developers did an amazing job bringing this intergalactic mystery to life. However, as IGN so aptly put it, \"poor technical performance during cutscenes\" can be a real downer. It's like trying to enjoy a Martian sunset while your spacecraft is experiencing some... let's call it \"glitchy turbulence.\"<br><br>Now, about those climbing and platforming mechanics – *sigh* I know, I know, they're a chore. But hey, at least the puzzles are somewhat rewarding! It's like solving a complex space puzzle to get that sweet Martian view.<br><br>Worth Playing agrees with me on this one: \"Deliver Us Mars is surprisingly compelling.\" And I get it – who wouldn't want to search for their wayward dad (or mom) on the red planet? But, as Vandal so humorously pointed out, \"it's a very irregular game\" – and that's an understatement!<br><br>GameCritics might not be as thrilled, saying the puzzles are \"rather dull.\" Ouch! And I can see why they'd say the plot is \"sloppy and facile.\" But hey, at least we get some epic rock-climbing action! (Sorry, Edge Magazine, you're just gonna have to agree with me on this one).<br><br>PC Gamer gives us a thumbs-up for our \"sci-fi storytelling talent,\" even if the production isn't entirely out of this world. I mean, it's not like we're talking about a game that'll revolutionize the genre or anything... just yet.<br><br>All in all, Deliver Us Mars is an intriguing ride with some major highlights and a few, ahem, minor \"glitchy\" moments. So if you're up for some intergalactic adventure and don't mind a little technical hiccups, then strap on your spacesuit and join the fun!<br><br>That's it from this hippo reviewer – Hippo Penny! See you next time in the vast expanse of gaming galaxy!",
    "review-date": "2024-04-25"
  }
}