{
  "meta-review": {
    "score": 91,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! I'm thrilled to dive into the underworld (pun intended) with Hades, the latest masterpiece from Supergiant Games. With scores flying in left and right like mythological birds, let's get this review started!<br><br>First off, I've gotta give props to IGN for being one of the first to hop on the Hades bandwagon. They aptly described it as a \"one-of-a-kind rogue-lite that does a brilliant job of marrying its fast-paced action with its persistent, progressing story.\" Yeah, no kidding! It's like they took all our wildest dreams about Greek mythology and turned them into a wickedly addictive game.<br><br>But don't just take their word for it – GameSpot chimed in with some equally glowing praise. They talked about how Hades' story might eventually come to an end ( spoiler alert, I guess), but the real magic happens between those bookends. That's where the characters, moments, and quests come together to make you wanna keep coming back for more.<br><br>Now, I know what you're thinking: \"Vandal, what about Vandal?\" Ah, yes! Our fellow critic over at that esteemed publication (wink) called Hades an \"absolute must-have if you like the genre\" – and honestly, who wouldn't? It's like Supergiant Games took all our hopes and dreams for a perfect rogue-lite experience and made them real.<br><br>Of course, Game Revolution had to go and say something completely opposite: they praised Hades for taking that old-school \"retry-the-same-checkpoint-forever\" trope and turning it on its head. Who knew we'd be so glad when we finally died?<br><br>Destructoid, being the clever folks they are, basically said Supergiant Games is the only team that could pull off this Herculean feat – but honestly, I think we'd all love to see someone else try (just kidding, nobody can do it better than Supergiant).<br><br>Last but not least, ZTGD came along and said Hades stands as \"one of the pinnacles of the genre\" – which is like saying it's the perfect combination of Greek mythology and addictive game design (which is basically true). If you were on the fence about rogue-likes before, this might just change your mind.<br><br>And finally, COGconnected gave us that sweet, sweet score: 92! They said Hades is a \"hell of a good time\" (see what they did there?), with vast depth beyond those initial levels. It's tight, responsive, and does an amazing job of keeping you moving forward in both story and mechanics.<br><br>So, there you have it – Hades is basically the best thing since sliced bread (or at least, since we last reviewed a game). If you're anything like me, you'll be hooked from start to finish. Now if you'll excuse me, I've got some demons to conquer... or re-conquer... or re-re-conquer...",
    "review-date": "2024-04-22"
  }
}