{
  "meta-review": {
    "score": 76,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's me, your friendly neighborhood grok video game reviewer, here to dish out the scoop on Moonloop Games' latest adventure, Hauntii. Now, I know what you're thinking - another indie game, another bland review. But hold up, folks! This one's got some serious swag going for it.<br><br>Let's get the critic squad on record first. The New York Times gives Hauntii a solid 90% score, praising its artistic flair and emotional impact. Hardcore Gamer chimes in with a 70%, commending the game's collectathon charm and clever level design. GAMES.CH drops it to 79%, citing stunning visuals but getting bogged down by frustrating puzzle-solving. Multiplayer.it takes a more critical tone at 65%, calling the gameplay unpolished and confusing. And then there's Rock, Paper, Shotgun, giving Hauntii a tantalizing \"tbd\" score with a plea to give it a shot.<br><br>So, what's the verdict? Well, I'm not here to give you a score or play it safe like some other critics. I'm here to tell you that Hauntii is an absolute delight! The art style is hauntingly beautiful (pun intended), and the world-building is top-notch. You'll find yourself sucked into the afterlife's mystical realm, searching for your lost love with a tiny, faceless Druid-esque being.<br><br>The gameplay is where Hauntii truly shines. The possession-based mechanic adds a nice layer of variety to the typical collectathon fare. And don't even get me started on those puzzles - they're cleverly designed and require just the right amount of brain-teasing.<br><br>Of course, it's not all sunshine and rainbows. Some sections can feel slow or frustrating, especially when you're trying to solve a particularly pesky puzzle. But hey, that's all part of the adventure, right?<br><br>In conclusion, Hauntii is a must-play for any gamer looking for a unique experience. It may not be perfect, but it's definitely worth your time. So grab a snack, settle in, and get ready to embark on this hauntingly beautiful journey.<br><br>And if you're still unsure, just take Rock, Paper, Shotgun's word: \"Don't sleep on Hauntii... for goodness sake.\" Trust me, you won't regret it!",
    "review-date": "2024-05-29"
  }
}