{
  "meta-review": {
    "score": 76,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - It's Time to Get Your Chase On!<br><br>Ah, another game in the ever-growing list of arcade racing games that promise to bring back those sweet, sweet memories of quarter-munching, joystick-wielding glory days. Horizon Chase 2 is the latest contender, and I'm here to give you the lowdown on whether it's worth trading in your old NES for.<br><br>Let me start by saying that Horizon Chase 2 gets a lot right. The track design is top-notch, with twists, turns, and boosts galore. And boy, does it ever get fast! You'll be whooshing along at breakneck speeds in no time, feeling like a true arcade racing legend (minus the need for frequent quarter refills).<br><br>Now, I know what you're thinking - what about those other reviewers? The ones who scored this game left and right? Well, let me tell you, they're not all wrong. But nor are they the only voice in the wilds of the internet.<br><br>Gaming Nexus gave it a solid 65, calling it \"relatively mindless racing\" (ouch!). Push Square chimed in with a 70, saying it's \"smiling plenty while it lasts\" - but ultimately not holding attention for too long. And don't even get me started on IGN Spain's glowing review, which I'll get to in a minute.<br><br>But what about the fun factor? Well, let me tell you, Horizon Chase 2 is all about the fun. It's the kind of game that makes you want to grab some friends and have a blast (pun intended). The multiplayer mode is surprisingly robust, with crossplay and rotating challenges that keep things fresh. And those cosmetic unlocks? Yeah, they're just the right amount of extra motivation to get you chasing high scores like it's 1989 all over again.<br><br>Of course, not everyone will agree on this. Some might find the game a bit shallow, a one-trick pony with no real depth or variety (cough, PlayStation Country, cough). But hey, sometimes that's exactly what we're in the mood for - something simple, something fun, and something that doesn't require us to think too much.<br><br>So, is Horizon Chase 2 worth your time? If you're a fan of arcade racing games, I say absolutely. It's a love letter to the genre, with all its quirks and charm intact. And if you're not - well, maybe it's still worth giving it a shot. You might just find yourself getting hooked on that sense of speed, those colorful graphics, and the pure, unadulterated joy of racing.<br><br>And who knows? You might even start to feel like you're back in the old days, quarter-munching away with your friends at the arcade. Just don't forget to bring some extra cash - you never know when you'll need it!",
    "review-date": "2024-06-09"
  }
}