{
  "meta-review": {
    "score": 86,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's your boy, back again to review the latest craze in puzzle gaming - Humanity. I mean, who wouldn't want to save humanity by solving puzzles and managing a bunch of cute, little critters? Sounds like a plan to me!<br><br>Now, let's get down to business. What did our fellow critics think of this modern Lemmings-esque romp?<br><br>IGN gave it a 90, saying it's \"esoteric and artsy\" with a \"beautiful\" premise that's as ambitious as Enhance's previous games (whatever those are). Oh, and I'm sure they loved the \"countless little feet\" pitter-pattering away. <br><br>GameSpot handed out an 80, praising its charming and engaging gameplay, unique premise, and striking visuals. They also raved about the user-generated levels - because who doesn't want to create their own puzzle hell?<br><br>Game Informer chimed in with an 85, saying Humanity strikes a balance between challenge and feel-good vibes (which is exactly what you need when managing tiny humans). They also appreciated the minimalist visuals and clicky electronic beats (because music matters, people!).<br><br>Vandal and GamingTrend both gave it a 90, calling it \"fantastic\" and \"vast,\" respectively. Vandal likened it to those crazy Dreamcast titles (remember those?), while GamingTrend praised its inventive design and clever mechanics. You can't ask for more than that!<br><br>Last but not least, COGconnected handed out an 85, saying Humanity is \"weird and wonderful\" with simple yet growing challenges. They even appreciated the jubilation that comes with solving each puzzle (I'm assuming).<br><br>God is a Geek simply gave it an 85, praising its expert crafting and giving you freedom to reach those stage goals. Yaaas, who doesn't love a good puzzle?<br><br>Now, about my own experience - I had a blast playing Humanity! It's all about guiding these little critters through levels by solving puzzles and managing resources. Simple yet addictive, with just the right amount of challenge (and some adorable moments). <br><br>So, what are you waiting for? Go save humanity already!",
    "review-date": "2024-06-07"
  }
}