{
  "meta-review": {
    "score": 72,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! It's your boy, a groovy seasonal reviewer, here to dish out the dirt on Kona, a mystery-solving adventure game that'll have you snooping around for clues and secrets. Now, I know what you're thinking - what makes this game so special? Well, let me tell you, it's all about the story, baby! Kona doesn't just rely on its narrative to deliver an engaging experience; it's like a puzzle box of awesomeness waiting to be solved.<br><br>But before we dive into the details, let's give some props to the critics. Vandal gives it 80/100, saying that while it may not offer anything special gameplay-wise, if you're a fan of exploration and good storytelling, Kona is worth a try. SpazioGames agrees, giving it 70/100, praising its ability to tell a story that can make you forget about technical hiccups and lackluster finales. COGconnected also gives it high marks (80/100), highlighting the game's captivating narrative and stellar graphics.<br><br>Now, I'm not gonna sugarcoat it - Kona has some issues. The survival and combat elements can be a bit wonky at times, but hey, who doesn't love a good challenge? And let's not forget Eurogamer Italy, who gives it 60/100... and nothing else, because, well, that's all they're willing to share.<br><br>God is a Geek chimes in with a score of 70/100, saying it may not be the best in the genre, but it does have some great mysteries to solve. And finally, GameCritics gives Kona its highest praise (85/100), calling it a \"nosy friend\" game that scratches an itch you didn't know you had.<br><br>Now, back to me - I'm gonna keep it real, folks. Kona is all about the story, and if you're into mystery-solving and exploration, this game is for you. It's like being a detective, minus the raincoat and trench coat (although those would be pretty cool too). But in all seriousness, Kona has some great moments, even with its flaws.<br><br>So there you have it - Hippo Penny's take on Kona. If you're looking for a fun adventure game that'll keep you guessing, give it a try! And hey, if you don't like it, well, that's okay too. At least we can agree that the critics are having some fun with their reviews, right?",
    "review-date": "2024-04-24"
  }
}