{
  "meta-review": {
    "score": 72,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Get ready for a groovy review of Kona!<br><br>As I dove into this indie game, I found myself transported to the grooviest decade ever – the '60s! With its psychedelic vibes and mystery-solving gameplay, Kona is like finding that rare vinyl record you've been searching for.<br><br>Let's start with the critics. Vandal gave it an 80, praising the narrative and exploration. SpazioGames agreed, saying it's a good beginning for a new series. COGconnected also chimed in with an 80, loving the investigative storyline and graphics. God is a Geek gave it a 70, saying it's not the best in the genre but still has its charm. GameCritics went all in with an 85, declaring Kona a must-play for nosy friends like myself! TheSixthAxis was more mixed, giving it a 60 and praising its nonlinear design, while Eurogamer Italy... well, let's just say they're still working on their review<br><br>Now, onto the gameplay! Kona is all about exploration, puzzle-solving, and – gasp! – actual gameplay. You play as a detective trying to solve a murder mystery in a small Canadian town (the '60s, remember?). The game has a lovely pace, with each new discovery leading you on a wild goose chase through the town.<br><br>The puzzles are clever, requiring observation and critical thinking. I won't lie; there were moments when I felt like I was searching for that proverbial needle in a haystack. But hey, it's all part of the fun! The combat mechanics are also well-done, with a nice balance between strategy and action.<br><br>Now, let's talk about the graphics. Whoa, are they psychedelic?! The game's art style is trippy, with vibrant colors and detailed environments that transport you to that far-out decade. The sound design is equally impressive, with an iconic soundtrack that'll have you groovin' along in no time!<br><br>In conclusion, Kona is a must-play for fans of mystery games, exploration, and – let's be real – awesome '60s vibes! It may not revolutionize the genre, but it's definitely a fun ride. So grab your bell-bottom jeans, your favorite vinyl record, and get ready to solve some far-out mysteries!<br><br>P.S. Don't worry if you get lost in the game; just remember: it's all part of the groovy experience!",
    "review-date": "2024-05-11"
  }
}