{
  "meta-review": {
    "score": 72,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - I'm back with another groovy review for you! Today, we're diving into the world of mystery-solving and exploration in Kona. Grab your detective hat and let's get this investigation started!<br><br>As a seasoned (get it?) critic, I love when games deliver on their promises. And boy, does Kona deliver on its promise to tell an engaging story! You'll be hooked from the get-go as you explore the mysterious world of 1960s Alaska with a cast of quirky characters. The narrative is where Kona shines brightest - it's like sipping coffee (or hippie tea) while listening to a campfire tale, only better!<br><br>Now, I know what you're thinking: \"But what about gameplay?\" Well, let me tell you, friends - Kona doesn't revolutionize the genre, but it does offer some satisfying investigative gameplay. You'll poke around abandoned houses, interview suspects (or should I say, \"suspects\"?), and uncover clues to unravel the mystery. It's like playing a digital version of Clue, minus the mustachioed detective (but that would be awesome, wouldn't it?).<br><br>Of course, not everyone will be as stoked about Kona as I am (okay, maybe some of you are). The Vandal over at GameCrate gave it an 80, saying it's all about the story and exploration. SpazioGames agrees, calling it a \"good beginning\" for a new series. Even COGconnected chimed in with a 80, praising the narrative and graphics.<br><br>But hey, not everyone was convinced. TheSixthAxis scored Kona a mere 60, citing issues with puzzle vagueness, backtracking, and a less-than-satisfying finale. And let's be real, some critics might say I'm being too generous (cough, cough, you know who you are).<br><br>All in all, Kona is a groovy little game that will appeal to fans of mystery-solving and exploration. It might not break new ground, but it does deliver on its promises - mainly, telling an engaging story with some solid gameplay. So grab your detective hat and get ready to solve some crimes!<br><br>P.S. If you're still on the fence about Kona, just remember: it's all about the hippie vibes, man!",
    "review-date": "2024-04-25"
  }
}