{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's time to get this groovy review party started!<br><br>LEGO Marvel Super Heroes 2 is a fun-filled adventure that brings together your favorite Marvel characters and puts them on one crazy ride. But don't just take my word for it – let's check out what some other critics had to say.<br><br>IGN, the cool kids at IGN, gave this game an 80, saying it's \"constantly fun to play, especially in co-op.\" Yaaas, co-op mode is where it's at! The combat might be a bit simple, and it can get confusing figuring out what to do next, but that lighthearted story makes all those minor annoyances fade away.<br><br>GameSpot, the ultimate gaming authority (or not), gave this game a 70, saying \"Lego Marvel Super Heroes 2 is reverential to its source material, even if the game that surrounds that adoration is starting to sag somewhat.\" Yeah, it's like when your favorite snack food starts getting stale – it still tastes good, but you can tell it's not as fresh.<br><br>Gaming Age, those lovely folks over at Gaming Age, gave this game an 83, saying \"I'm a sucker for the LEGO games and toys, and of course Marvel, so this release is a no-brainer for me.\" Aw, thank you, Gaming Age! You're always making us feel good about our love for LEGO.<br><br>And then there are some other critics who just can't get enough of this game. Cheat Code Central gave it an 82, saying \"Lego Marvel Super Heroes 2's roster of over two hundred characters are sure to delight.\" Yeah, that many characters is like having a whole Marvel movie in your hands! Vandal, the cool cats at Vandal, gave it a 77, saying \"You won't find many new features here, but both the universe and the formula are quite good, so the result is a very enjoyable game.\" SpazioGames, those Italian gaming gurus, gave it an 80, saying it's an \"entertaining experience thanks to a great variety of characters, locations, and situations that will manage to keep players going until the very end of the game.\"<br><br>And finally, Destructoid, those feisty folks at Destructoid, gave this game a 70, saying \"LEGO Marvel Super Heroes 2 still has the power to entertain, but while the game's chronological theme has allowed the brand to stride confidently into the future, its core mechanics remain rooted firmly in the past.\" Yeah, sometimes we just gotta let go of our old ways and adapt to something new.<br><br>In conclusion, LEGO Marvel Super Heroes 2 is a fun ride that brings together your favorite Marvel characters for one epic adventure. It's not perfect, but it's got heart and plenty of excitement! So grab some popcorn, assemble your co-op squad, and get ready to join the Avengers (or maybe not) in this groovy game!",
    "review-date": "2024-06-04"
  }
}