{
  "meta-review": {
    "score": 72,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Ah, another Lego game, another excuse to play dress-up in a ridiculous costume and save the world (or at least, Middle-Earth). But seriously, is Lego The Hobbit just more of the same old thing? Or does it bring something new to the table?<br><br>Let's start with the good stuff. As expected from Traveller's Tales, the game looks great - the Lego-ified version of Middle-Earth is a sight to behold, and the characters are as charming as ever (I mean, who doesn't love a good Smaug-slaying?). The humor is still spot-on, with plenty of winks and nods to fans of the book and movie. And hey, it's always fun to play as Bilbo Baggins, even if he does spend most of the game getting told off by Gandalf.<br><br>But let's get down to business. Is this game more than just a rehash of previous Lego games? Well, sorta. The new mechanics they've added are nice, but not exactly earth-shattering (pun intended). And as for the quest navigation - it's better than some of the previous entries, but still feels a bit like being guided by the nose.<br><br>Now, I know what you're thinking: \"What about all the critics out there?\" Ah, yes. The critics. Well, let me tell you, some of them are just a bunch of pompous, self-important, overly-serious... okay, maybe that's unfair. Okay, fine - they're actually pretty spot-on. Game Revolution says it expands the series repertoire with new mechanics? Check. Game Informer says it's a complete and entertaining game? Absolutely.<br><br>But then there are the ones who think this game is just more of the same old Lego formula... like Push Square, saying the pantheon of LEGO games has gotten tired (ouch). And poor, beleaguered GameSpot, who thinks capturing the look of an epic quest doesn't count if it's not actually fun. Ouch again.<br><br>All in all, Lego The Hobbit is a solid addition to the series, but don't expect it to reinvent the wheel (or at least, not until they get around to making a Lego Game Revolution). It's still the same old Lego charm, with some new mechanics and better navigation - just don't say I didn't warn you about those critics.",
    "review-date": "2024-06-27"
  }
}