{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny!<br><br>Ah, Lego 2K Drive, where speed meets silliness in a world made of bricks (literally!). As I dive into this colorful chaos, I'm reminded why critics like GameSpot and GamingTrend gave it high praise. But don't worry, folks; I won't sugarcoat the good, bad, and ugly for you.<br><br>Gameplay-wise, Lego 2K Drive is an absolute blast. The combination of open-world racing, kart racing, and – you guessed it – Lego-ness makes for a wildly entertaining experience. Imagine zooming through Bricklandia, building bridges with your friends, and causing utter destruction (because, let's be real, that's half the fun). It's like playing with Legos all over again... minus the mess and annoyed parents.<br><br>But, as Vandal astutely pointed out, microtransactions can be a bit of a bummer. I mean, who doesn't love a good ol' fashioned Lego brick-building session? Alas, those pesky transactions might make you question your commitment to building that perfect Lamborghini-Lego hybrid (sorry, not sorry, parents).<br><br>Now, I know what you're thinking: \"What about the rest of the reviews?\" Well, Game Informer summed it up nicely – the game is inviting, with absurd narratives and moreish open-world challenges. COGconnected echoed this sentiment, praising the level design, humor, and smooth experience.<br><br>On the other hand, Destructoid's critique was a bit harsh (but hey, someone's gotta keep things real). They noted that the story mode is basic, monetization is questionable, and there isn't enough content yet. SpazioGames' review was more lukewarm, pointing out monotony underlying the fun.<br><br>All in all, Lego 2K Drive is an absolute hoot! It's a game that'll make you feel like a kid again ( minus the mess and annoyed parents, of course). Just be aware of those microtransactions and be prepared for some frustrating mission design. Overall, it's a great choice for late-night gaming shenanigans with friends.<br><br>That's all for now, folks! See you in the next review, where I'll no doubt poke fun at myself and other critics (just kidding... or am I?)",
    "review-date": "2024-04-22"
  }
}