{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - it's your boy back with another review that's gonna make you wanna jump for joy!<br><br>Lego Marvel Super Heroes 2 is out now, and I'm here to tell you if it's worth joining the Marvel-ous party or not. First off, let me just say that as a critic, I'm used to being wrong... or at least, being proven wrong by my fellow critics (ahem, @IGN). But seriously, Lego games are always a delight, and this one is no exception!<br><br>I mean, where do you even start with the sheer number of Marvel characters on offer? Over 200! That's right, folks - from the Avengers to the Guardians of the Galaxy, you'll get to play as your faves (and maybe some not-so-faves... I'm looking at you, Carnom). And don't worry if you're not a completionist; even just playing through the story mode is an absolute blast.<br><br>Now, I know what you're thinking: \"What about the gameplay?\" Well, let me tell you - it's more of the same ol' Lego magic. Simple combat? Check! Wacky puzzles to solve? You bet! And that co-op mode? Forget about it (in a good way)! It's like playing with your best buds, except they're made entirely out of plastic bricks and have silly powers.<br><br>Of course, there are some minor niggles - the story can get a bit meh at times, and the game doesn't exactly try to reinvent the wheel. But honestly, who cares when you've got that many superheroes to play as?! It's all about having fun, and Lego Marvel Super Heroes 2 delivers in spades.<br><br>So, what do my fellow critics think? Well, IGN gave it an 80, saying it's \"constantly fun to play\" (yep, I'm biased). GameSpot went with a 70, calling it \"basic cheerful gameplay\" that's still enjoyable. And let's not forget the other folks - Gaming Age said it's \"better than the last Marvel LEGO release,\" while Vandal gave it a solid 77 for being \"a very enjoyable game.\"<br><br>So there you have it - another Lego game that's all about having fun, and I'm here to tell you: this one is no exception! Now if you'll excuse me, I've got some Lego-ing to do...",
    "review-date": "2024-05-31"
  }
}