{
  "meta-review": {
    "score": 77,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - It's Time to Get Groovy with Lords of the Fallen!<br><br>Hey, fellow gamers! Your favorite seasonal grok is here to dish out the lowdown on CI Games and HexWorks' rebooted masterpiece, Lords of the Fallen. With a plethora of Soulslike titles flooding the market, it takes something special to stand out from the pack. And boy, does Lords of the Fallen deliver!<br><br>But before we dive into the nitty-gritty, let's take a quick peek at what some of our esteemed critic friends have to say:<br><br>* IGN says: \"Lords of the Fallen is a great soulslike... its killer new idea of swapping between two versions of the world to solve puzzles and slay enemies is an excellent twist.\" (Score: 80)<br>* Slant Magazine chimes in: \"With Lords of the Fallen, we get a fresh spin on the Soulsborne formula that brings darkness to the light.\" (Score: 80)<br>* Gaming Age gives it some love: \"None of this is to say the game is bad, because it isn't!... I can see enemy density being adjusted, I can see some adjustments to checkpoint placements...\" (Score: 75)<br><br>And then there's SpazioGames, who decides to rain on the parade: \"Lords of the Fallen fails to meet every expectation and its own ambitions. With many technical flaws and some gameplay issues, CI Games and HexWorks' reboot is very far from top-notch soulslike games.\" (Score: 75)<br><br>Now that we've got our critic buddies out of the way, let's get back to the good stuff – Lords of the Fallen itself! This game has got it going on:<br><br>* That killer new idea I mentioned? It's a real game-changer. Swapping between two versions of the world adds an extra layer of depth and strategy to solving puzzles and taking down enemies.<br>* The explorable areas are simply fantastic, with so much to see and discover in each nook and cranny.<br>* Buildcrafting is also top-notch – I mean, who doesn't love crafting and customizing their own gear?<br><br>But, of course, no game is perfect. Technical issues do pop up from time to time, and some boss fights can get a bit wonky. However, I'm all about the potential, people! With these minor setbacks addressed, Lords of the Fallen has the makings of an absolute masterpiece.<br><br>So, if you're in the market for a fresh take on the Soulslike formula, look no further than Lords of the Fallen. It's got brains, it's got brawn, and it's got style – what more could you ask for?<br><br>Groovy review, much?",
    "review-date": "2024-06-02"
  }
}