{
  "meta-review": {
    "score": 65,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Ah, the latest installment of Lunar Lander Beyond, and what a wild ride it is! I'm not sure if I should be impressed by the sheer amount of content or frustrated by the difficulty curve, but either way, let's dive into this review.<br><br>First off, I've got to give credit where credit is due - those critics who gave this game a solid score. You know, the ones who are actually good at games (wink, wink). Gaming Age was singing its praises with an impressive 90%, praising the \"insanity aspect\" and the ability to get new ships and upgrades. Similarly, God is a Geek also gave it a high mark, saying it's a loving reimagining of the classic Atari game.<br><br>But then there are those critics who... well, let's just say they didn't exactly \"land\" on their feet (heh). Metro GameCentral was less than thrilled, calling the gameplay simple and the storytelling overblown. Video Chums also had some issues with the game, finding it to be a step back from the original and prone to frustration.<br><br>Now, I'm not one to toot my own horn (okay, maybe just a little), but even I could see that this game has some real potential. Hobby Consolas was another critic who saw the value in Lunar Lander Beyond, praising its ability to update the classic while adding new mechanics and a background story.<br><br>And then there are those critics... well, let's just say they should stick to reviewing games from the 80s (Finger Guns, I'm looking at you). Their review read like a laundry list of complaints - difficult gameplay, dull execution, and no reward system. Ouch!<br><br>Lastly, Player 2 was another critic who found some great ideas in Lunar Lander Beyond, but ultimately felt that the execution fell short.<br><br>All in all, Lunar Lander Beyond is a game that's got a lot going on, but also has its share of frustrations. If you're looking for a unique challenge that'll keep you busy for a while, this might be the game for you. Just don't say I didn't warn you about those pesky difficulty spikes!",
    "review-date": "2024-04-24"
  }
}