{
  "meta-review": {
    "score": 83,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny -<br><br>Alright, let's get this groovy review party started! I'm here to dish out my two cents on Minds Beneath Us, and I promise you won't be disappointed (well, maybe a little).<br><br>First off, I gotta give those Noisy Pixel folks credit - their 90% score is no joke! They're all about that sci-fi vibe, and Minds Beneath Us delivers the goods. A haunted dystopian future? Check! Compelling storyline? Double check! Atmospheric visuals? You bet your cyberpunk-loving butt it's got those! But don't get too comfy, folks - there's some clunky save system going on that'll keep you on your toes.<br><br>Now, over at Try Hard Guides, they're all about the visual novel experience. And let me tell you, Minds Beneath Us serves up a heart-wrenching story with a side of unique sci-fi concepts to munch on. Fans of VNs and great storytelling are in for a treat!<br><br>Digital Chumps gives us 85%, saying that Minds Beneath Us uses \"a hell of a lot of good confusion\" to get you hooked. Okay, I can dig it! They're onto something with this whole \"meaningful choices\" thing - even if they're just illusionin' the fact that our choices matter.<br><br>Then we've got Gamer Escape with their 80% score and some serious praise for the game's sci-fi exploration of identity, mind, and personal values. I mean, who doesn't love a good think-piece on morality in a corrupt system? Minds Beneath Us keeps it real!<br><br>GAMINGbible gets us up to 80% too, saying that this game makes us question our morals (again!) and asks just how far we're willing to go for the greater good. Food for thought, anyone?<br><br>The Games Machine gives us a score of 75%, highlighting the weirdo graphics adventure vibes with minimal puzzles but loads of dialogue. I mean, who doesn't love some good ol' fashioned chatter-and-wander gameplay? Minds Beneath Us makes sure you're on your toes (or in this case, on your cyberpunk heels).<br><br>So there you have it - a mixed bag of opinions on Minds Beneath Us! But hey, that's what makes life worth living, right? At least, I think that's what Noisy Pixel would say if they were still sipping on their existential sci-fi Kool-Aid. Stay groovy, friends!",
    "review-date": "2024-07-31"
  }
}