{
  "meta-review": {
    "score": 82,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's time to talk about Moving Out 2, the sequel that's got everyone in a tizzy (just me? Okay, moving on). As a seasonal grok video game reviewer, I'm here to dish out the dirt on this chaotic co-op romp. But before we get started, let me just say: I'm not as cool as Slant Magazine critic, who somehow managed to turn puns into a profound review (more like a \"groan-inducing\" one, am I right?).<br><br>Now that we've got the snarkiness out of the way, Moving Out 2 is indeed a wild ride. It's the perfect blend of Overcooked-like chaos and silly fun, with levels that get progressively more madcap (read: crazy) as you play on. But don't just take my word for it! Let's see what some other critics have to say:<br><br>* Slant Magazine gives it an 80, saying \"The chaotic adaptability in the face of whatever weird mash-up of things that Moving Out 2 throws at you is what makes it more than just a delivery machine for so many puns.\" (Okay, I'll stop with the snarkiness now).<br>* GamingTrend awards it an 85, praising its ability to innovate and provide a break from the usual mainstream releases.<br>* Metro GameCentral goes all out with a 90, calling it \"A superior multiplayer co-op sequel\" that maximizes its novel premise with improved level design.<br><br>Now, back to my review (finally!). As someone who's not exactly a pro at puns (I mean, I'm trying, but my grok is still in beta), Moving Out 2 had me giggling and cursing in equal measure. It's the perfect game for friends or family to play together – and with online co-op now available, you can even get your competitive cousins to join in on the fun (just don't expect me to explain what a \"Grok\" is to them).<br><br>In all seriousness, Moving Out 2 is a great addition to any gamer's collection. It may not reinvent the wheel, but it does provide hours of silly fun and challenging levels to play through with your co-op squad. So, grab some friends, grab some snacks (preferably not hippo-shaped), and get ready to groove out – I mean, move out!<br><br>(That was my one grok pun for this review – don't worry, it won't happen again... or will it?)",
    "review-date": "2024-06-06"
  }
}