{
  "meta-review": {
    "score": 82,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's your old pal, here to review the latest installment in the Moving Out series - and boy, am I excited!<br><br>As someone who loves a good dose of chaos and silliness in their games, Moving Out 2 delivered exactly that. And let me tell you, it's a real treat for fans of Overcooked-like co-op gameplay. But before we dive into the nitty-gritty, let's take a look at what the other critics had to say.<br><br>Slant Magazine gave it an impressive 80, saying that \"The chaotic adaptability in the face of whatever weird mash-up of things that Moving Out 2 throws at you is what makes it more than just a delivery machine for so many puns.\" Ah, I see what they did there - love a good pun!<br><br>GamingTrend gave it an even higher score of 85, stating that \"Moving Out 2 innovates on the foundation of puns, puzzles, and platforming its predecessor built before it and provides a break from the mainstream releases of 2023.\" Break from the norm? You can count me in!<br><br>Metro GameCentral went all out with a glowing 90, saying that \"A superior multiplayer co-op sequel, which maximizes its novel premise with improved level design and a flood of clever new ideas.\" Whoa, talk about high praise!<br><br>TheSixthAxis gave it an 80, saying that \"It's a cliché line but that doesn't stop it from being true: if you loved Moving Out then you'll love Moving Out 2. It's a whole lot more of the same chaotic multiplayer action you've come to expect.\" Agreed!<br><br>Push Square gave it a solid 70, stating that \"If you're after more Overcooked-like co-op fun, Moving Out 2 is a great option. Its colorful presentation, cheeky humor, and increasingly madcap levels combine for a successful follow-up.\" Cheeky humor? Sign me up!<br><br>GameSpew gave it an 80, saying that \"Bold, colourful and entirely silly, Moving Out 2 is a must-play for couch co-op fans. A sequel to 2020's Moving Out perhaps wasn't needed, but it does provide fans with bigger, better, and more riotous levels to play with their friends.\" Ri-otous? Okay, I'll stop there!<br><br>And finally, GameGrin gave it an impressive 95, stating that \"Moving Out 2 is an enjoyable game with friends or family, but it can sometimes get a little frustrating. Playing alone can get boring.\" Ah, solo play - we know the struggles!<br><br>Now, let's get back to the review at hand! In Moving Out 2, you take on the role of a delivery expert (read: professional furniture mover), tasked with moving all sorts of wacky objects from one place to another. Sounds easy, right? Wrong! The game throws curveballs your way in the form of obstacles, puzzles, and sheer chaos - and it's up to you to adapt and overcome them.<br><br>But what really sets Moving Out 2 apart is its multiplayer co-op gameplay. Playing with friends or family adds a whole new level of fun (pun intended!) - from competing to see who can move the most objects in the shortest time to working together to solve tricky puzzles. Trust me, it's a blast!<br><br>Of course, no game is perfect, and Moving Out 2 has its fair share of frustrations - mainly when playing alone or encountering some of the tougher levels. But hey, that's just part of the fun, right?<br><br>Overall, Moving Out 2 is a wild ride of silly fun, clever puzzles, and chaotic action. If you're looking for a game to play with friends or family, this one's a must-buy! Hippo Penny out!",
    "review-date": "2024-05-29"
  }
}