{
  "meta-review": {
    "score": 82,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - It's Time to Get Moving (and laughing)!<br><br>As I settled in for my grok-filled adventure with Moving Out 2, I couldn't help but think of all the critics who came before me. Slant Magazine raved about the game's chaotic adaptability (\"The weird mash-up of things that Moving Out 2 throws at you...\"). GamingTrend praised its innovativeness (\"A break from the mainstream releases of 20[23]\"), while Metro GameCentral called it a \"superior multiplayer co-op sequel.\" TheSixthAxis echoed sentiments from its predecessor, saying it's more of the same chaotic fun (but loses steam later on). Push Square highlighted its Overcooked-like co-op goodness and colourful presentation. And finally, GameSpew praised its boldness, colourfulness, and sheer silliness.<br><br>Now, let me get moving myself!<br><br>In Moving Out 2, you play as a team of delivery robots trying to survive the chaos that ensues when your boss decides to fire all his employees (because... reasons). It's Overcooked meets Moving Out, with a dash of platforming and puzzle-solving. Your goal is to navigate levels, collecting packages while avoiding obstacles and... well, getting in the way of each other.<br><br>This sequel has big shoes to fill, but it largely succeeds. The levels are bigger and better, the puzzles more challenging, and the co-op fun multiplied. Online play makes it easier for friends to get together, even if you can't be in the same room (although, let's be real, that's half the fun).<br><br>GameGrin was a bit harsher, saying it can get frustrating at times, but I found my robot pals and me giggling our way through most levels. And hey, when things get tough, there's always an option to \"accidentally\" knock over your friends' robots (it's all in the name of teamwork, right?).<br><br>Moving Out 2 is a great option for couch co-op fans and anyone looking for some lighthearted fun with friends or family. Just don't expect it to be a groundbreaking experience – unless you're Slant Magazine, that is.<br><br>So, what are you waiting for? Grab your robot friends and get ready to... well, move out!",
    "review-date": "2024-06-07"
  }
}