{
  "meta-review": {
    "score": 82,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - Ah, Moving Out 2! The sequel to the pun-filled party game that got everyone moving...and laughing. I'm not saying I'm biased towards silly games, but someone's gotta bring the funny (it's me!). So, is this chaos of a game worth your time?<br><br>Let's get the critics out of the way first. Slant Magazine gave it an 80, calling it \"more than just a delivery machine for so many puns.\" GamingTrend chimed in with an 85, praising its \"break from the mainstream releases\" (read: more puns, please!). Metro GameCentral went full-steam ahead, giving it a 90 and saying it's a \"superior multiplayer co-op sequel\" that \"maximises its novel premise.\" TheSixthAxis got a bit too comfortable, though - they said it's the same old chaotic action (déjà vu much?), but with a focus on non-stop silly fun, Moving Out 3 might be just what we need. Push Square and GameSpew both agreed that it's a \"must-play\" for couch co-op fans, and GameGrin even gave it a perfect score (95!) - but warned solo players to beware the occasional frustration.<br><br>Now, onto my review!<br><br>I'll be honest: I'm not exactly the most coordinated person. In fact, you might find me sprawled on the floor, laughing at my own clumsiness while trying to navigate Moving Out 2's chaotic levels. But hey, that's what makes this game so much fun! It's like a never-ending supply of silly, slapstick humor and challenges to overcome with friends (or solo, if you're feeling brave).<br><br>The gameplay is as zany as the premise: you get to control a team of movers (with different abilities, no less!), working together to navigate increasingly absurd levels. It's like Overcooked on steroids - minus the cooking part, naturally. There are so many moments where I was laughing so hard, tears were streaming down my face (okay, maybe not that much, but it was close!). The colorful graphics and cheeky humor really do shine through.<br><br>Of course, there are some minor quibbles: some levels get a bit too challenging, and the online multiplayer experience might be hit-or-miss. But overall? This game is an absolute riot! And who knows - you might just find yourself moving out (get it?) with friends or family, having the time of your life.<br><br>That's my two cents on Moving Out 2: a ridiculous, hilarious, and utterly enjoyable experience that'll have you giggling long after the credits roll.",
    "review-date": "2024-05-28"
  }
}