{
  "meta-review": {
    "score": 82,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny, folks! It's your boy, the grok-iest reviewer around (yeah, I'm biased), and I'm back to dish out the dirt on Moving Out 2, because who doesn't love a good moving pun-filled romp? In all seriousness, this sequel promises more chaos, co-op shenanigans, and, of course, those dad jokes that'll make you groan.<br><br>But first, let's take a gander at what the critics had to say:<br><br>* Slant Magazine: \"The chaotic adaptability in the face of whatever weird mash-up of things that Moving Out 2 throws at you is what makes it more than just a delivery machine for so many puns.\" (80) Ah, they get me!<br>* GamingTrend: \"Moving Out 2 innovates on the foundation of puns, puzzles, and platforming its predecessor built before it and provides a break from the mainstream releases of [2023].\" (85) Yay, more innovation!<br>* Metro GameCentral: \"A superior multiplayer co-op sequel, which maximises its novel premise with improved level design and a flood of clever new ideas.\" (90) Who wouldn't want clever new ideas?<br>* TheSixthAxis: \"It's a cliché line but that doesn't stop it from being true: if you loved Moving Out then you'll love Moving Out 2. It's a whole lot more of the same chaotic multiplayer action you've come to expect. Sadly, when you get your mates around to play, you'll likely just focus on the early levels, as the game once again loses its way and gets far too hard in the latter stages. A focus on straight-up non-stop silly fun would be much appreciated if there's a Moving Out 3.\" (80) Cliché or not, it's true – more of the same is always welcome!<br>* Push Square: \"If you're after more Overcooked-like co-op fun, Moving Out 2 is a great option. Its colourful presentation, cheeky humour, and increasingly madcap levels combine for a successful follow-up.\" (70) Yeah, because who doesn't love more Overcooked?<br>* GameSpew: \"Bold, colourful and entirely silly, Moving Out 2 is a must-play for couch co-op fans. A sequel to 2020's Moving Out perhaps wasn't needed, and this doesn't exactly reinvent the wheel. But it does provide fans with bigger, better, and more riotous levels to play with their friends. And this time, you can play online too! What more could we ask for, really?\" (80) I mean, what's not to love?<br>* GameGrin: \"Moving Out 2 is an enjoyable game with friends or family, but it can sometimes get a little frustrating. Playing alone can get boring.\" (95) Okay, maybe don't play alone, then.<br><br>In all seriousness, Moving Out 2 delivers on its promise of chaos and co-op fun. If you loved the first one, you'll love this sequel – more puns, more puzzles, and more platforming to go around! It's a great option for those looking for more Overcooked-like experiences or just wanting some good ol' couch co-op shenanigans. So grab your friends, your favourite snacks (I recommend pizza), and get ready for a movingly good time!",
    "review-date": "2024-05-31"
  }
}