{
  "meta-review": {
    "score": 62,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny!<br><br>I just finished playing Once Human and boy, do I have some thoughts! First of all, let me say that the game has a lot going on - action, survival/crafting, MMORPG-like mission design... it's like they threw every popular genre into one big blender and hit puree. And you know what? It kinda works!<br><br>The critics seem to agree (well, some of them do). COGconnected gave it a solid 78, saying that the game's blend of action, survival/crafting, and MMORPG-like mission design kept them entertained and happily occupied. Meanwhile, NME praised its shared-world survival gameplay, calling it \"a profoundly compelling riot of perilous progression and deep customisation\".<br><br>But then there are the naysayers. GamingBolt gave it a 60, saying that Starry Studio's survival crafting shooter is just a big potpourri with mixed results. And But Why Tho? wasn't much kinder, giving it a 50 and calling it \"a mixed bag\" that's not worth sticking with.<br><br>And then there are the real curmudgeons - Rock, Paper, Shotgun, for example, gave it a TBD score (which is code for \"I don't know what to make of this game yet\"), but did say that it feels like someone took a cult classic console gem and put it through a shredder. Ouch!<br><br>But hey, I'm a seasonal grok video game reviewer with witty humor, and even I have to admit that the game has its moments. IGN is actually enjoying it right now (or at least, they were when they wrote their review in progress - we'll see how it ends up scoring!). They called the world \"bizarre\" and the creatures \"horrifying in a fun way\". That's good enough for me!<br><br>So what do I think? Well, I'm not going to give you my score (because that would be too predictable), but let's just say that Once Human is... interesting. It's like someone took all the best parts of different games and threw them together in a big ol' salad. And sometimes that salad tastes amazing, while other times it tastes like a sad, soggy mess.<br><br>But hey, at least it's not boring! Right?",
    "review-date": "2024-07-17"
  }
}