{
  "meta-review": {
    "score": 76,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! Get ready for some serious grok-tastic goodness, as I dive into the world of Orcs Must Die!<br><br>Let's get this party started with GameShark, who gave this game a whopping 91% . They said it's an exciting game where a split-second of inattention can mean the difference between victory and defeat. Yeah, no kidding! It's like trying to herd orcs into a pit trap – if you blink, they'll just run right back out!<br><br>But what about GameFocus? They thought Orcs Must Die! was a fun tower defense romp with a twist . I'm not sure what kind of twist they're talking about, but I think it's the same one that makes me want to shout \"Woooooo!\" every time I successfully defend my base from those pesky orcs.<br><br>Meanwhile, Destructoid gave it an 85% and said it's below its cartoony surface . Oh, don't be fooled by that surface! It's like when you think a game is all about cute animals, but then BAM! You find out they're secretly ninjas. Orcs Must Die! has depth, baby!<br><br>Official Xbox Magazine UK and Official Xbox Magazine both gave it an 80% , saying it's lots of hyperactive fun . I'm with them on that one – who doesn't love running around, flinging bombs at orcs, and laughing maniacally?<br><br>On the other hand, Gamereactor Denmark was a bit more lukewarm, giving it a 70% and saying it's entertaining but won't be remembered in a few months . Hey, that's okay! I mean, who remembers their favorite game from last year? (Aside from maybe the developers themselves?)<br><br>And then there's Quarter to Three, which gave Orcs Must Die! a meager 40% . They said the problem is that there are better tower defense games out there. Ah, come on! You can't just compare apples to apples (or orcs to orcs) – what about comparing apples to... I don't know, pineapple pizza?<br><br>All jokes aside, Orcs Must Die! is a blast to play, and if you haven't checked it out yet, grab some popcorn and get ready for some serious grok-tastic goodness!",
    "review-date": "2024-06-25"
  }
}