{
  "meta-review": {
    "score": 86,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's your boy, back with a review that's gonna make you wanna shout it from the rooftops - or at least, scroll down and read what I have to say about this remade masterpiece, Riven!<br><br>Now, before we dive in, let me just say that I'm no stranger to poking fun at myself. After all, who needs self-seriousness when you can have Hippo Penny's brand of humor? So, bear with me as I tackle the critics and give you my take on this puzzle game.<br><br>First off, let's get the easy ones out of the way - or should I say, the high-flying ones? GamingTrend gave Riven a perfect 100! That's right, folks, they're talking about a \"majestic piece of art\" that will blow your mind (and not just because it's from 1997). Try Hard Guides and PCGamesN also chimed in with their own 90s - praise for the game. And don't even get me started on Gamer Escape, who said Riven is an \"unforgettable ride.\" I mean, what more can you ask for?<br><br>Now, let's talk about the ones that didn't quite reach the same heights (pun intended). God is a Geek gave it an 80, saying while it was difficult, Cyan Worlds did a great job remaking this classic. And Shacknews? Same score, same praise - beautiful game, beautiful upgrade. The only one who didn't quite join the party was The New York Times with their 75. Sorry, NYT, but your three-year-old video card is just gonna have to step up its graphics game.<br><br>All joking aside (for now), Riven's remake is a true masterpiece that deserves all the praise it's gotten. It's like stepping into another world - and not just because of the mind-bending puzzles! Cyan Worlds really outdid themselves bringing this classic back to life in 2024. So, if you're a fan of deep puzzles, exploration, or just wanna experience something new, Riven is definitely worth your time.<br><br>That's it for now, folks! Hippo Penny signing off - see you next review!",
    "review-date": "2024-06-24"
  }
}