{
  "meta-review": {
    "score": 90,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny - Here's my take on Rogue Legacy 2. *takes deep breath* I'm gonna try not to gush too much (but let's be real, this game is amazing).<br><br>First off, kudos to the developers for not resting on their laurels and delivering a sequel that improves upon an already fantastic formula. The addition of new classes, biomes, and House Rules gives players a ton of options to tailor the experience to their liking - even if that means sacrificing your family tree (spoiler alert: it's worth it).<br><br>Now, I know some of my fellow critics are gonna be all like, \"Oh, it's just another roguelite\" (cough, IGN, cough). But let me tell you, Rogue Legacy 2 is more than just a bunch of procedurally generated levels and enemies. It's an experience that'll keep you coming back for more, even when the inevitable deaths happen.<br><br>And don't even get me started on the combat - it's like butter (the good kind, not the \"I'm-trying-to-make-a-spread-but-it's-still-tedious\" kind). Every enemy encounter feels deliberate and challenging, yet rewarding when you emerge victorious. I mean, who doesn't love a good \"one more run\" effect?<br><br>Now, if I'm being totally honest (and I am), some of the critics out there might not be as... enthusiastic about this game. Like Game Informer - they mentioned some \"nitpicks,\" and I'm guessing that means something like \"the progression systems could be a bit better\" or \"the ramp to endgame is kinda wonky.\" But honestly, those are just minor quibbles in an otherwise fantastic package.<br><br>All right, all right, I'll stop gushing now. Suffice it to say, Rogue Legacy 2 is a must-play for any fan of the genre (or anyone looking for a great game, period). Even the most discerning critics out there - like Destructoid - can't help but give it high praise.<br><br>So go ahead, grab your controller, and get ready to sacrifice your family tree (just kidding... or am I?). Hippo Penny says Rogue Legacy 2 is a real treasure.",
    "review-date": "2024-05-09"
  }
}