{
  "meta-review": {
    "score": 90,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's your boy, back with another review that's sure to make you giggle, nod your head in agreement, and maybe even get you excited to jump into the world of Rogue Legacy 2!<br><br>Let me just say, this game has got it all - classes, biomes, House Rules (more on those later), and a whole lot of roguelite goodness. But before we dive into the meat of the review, let me take a quick jab at some of my fellow critics.<br><br>I mean, come on, IGN, \"shoulder to shoulder among the very best of the genre\"? That's like saying I'm on par with the likes of Gordon Ramsay in the kitchen - yeah, okay, maybe if I had a fancy chef hat and a mean streak! Meanwhile, GameSpot is over here talking about the \"one more run\" effect. You know what that means? It means we're all gonna be stuck in this never-ending loop of playing just one more level... until the cows come home.<br><br>Game Informer, you're always so serious, but even you can't help but gush about how satisfying it is to discover new skills and defeat those pesky bosses. And don't even get me started on Vandal - \"fantastic sequel\" indeed! But what really gets my hippo blood pumping is Cellar Door's decision to add more depth and variety to this already winning formula. I mean, who doesn't love a good roguelite?<br><br>Now that we've got the formalities out of the way, let's get down to business. Rogue Legacy 2 is an absolute blast. With its diverse areas, rewarding combat, and - oh yeah - House Rules, you'll be hard-pressed not to come back for more (and more, and more...). It's like playing a game of Jenga - except instead of blocks, it's your sanity that keeps getting pulled apart one run at a time.<br><br>Eurogamer, I'm looking at you when I say that this game is all about exploration. Whether it's the new classes or the vast biomes, there's always something new to discover. And don't even get me started on those House Rules - they're like having your own personal rogue-lite architect, designing a challenge tailored just for you!<br><br>But let's not forget about the competition out there. Destructoid says it's one of their favorite roguelite games of 2022 (and I'm inclined to agree). Eurogamer Italy takes things up a notch, calling Rogue Legacy 2 the \"perfect sequel\" - and when they say perfect, you know it means something special.<br><br>So, in conclusion, Hippo Penny gives Rogue Legacy 2 two big thumbs way up! It's a game that will keep you hooked from start to finish, with its addictive gameplay, charming roguelike formula, and just the right amount of challenge. So go ahead, give it a try - but don't say I didn't warn you about those one more run...",
    "review-date": "2024-04-25"
  }
}