{
  "meta-review": {
    "score": 67,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny -<br><br>SCHiM, the game that has everyone hopping with excitement! I mean, who wouldn't be thrilled by a game that lets you play as a cute little shadow frog? It's like they knew exactly how to win me over - by being adorable!<br><br>But enough about my obvious biases (I mean, have you seen those eyes?!). Let's get down to business and see what the critics are saying.<br><br>Try Hard Guides thinks SCHiM is \"a relaxing and artistic little game\" with a \"clever take on platform puzzles.\" I mean, that sounds like a great way to spend an afternoon - all cozy and artsy in your Steam library. But Hey, try-hard (heh), I'm not sure if they're trying too hard to be nice.<br><br>But Why Tho? agrees that SCHiM is worth jumping at, but then again, what's not worth jumping at when you have a game that's all about cute little shadow frogs?<br><br>Now, let's hear from IGN Deutschland - \"The creative platformer Schim impresses using puzzles and jumping passages with innovative shadow mechanics...and a surprisingly touching story.\" Okay, okay, I get it - you guys like SCHiM too!<br><br>Gamer.nl says the game is \"a brilliant idea in a special work of art\" with a unique style, but then complains that it's \"too repetitive in terms of gameplay and environments to last long.\" Hmm, sounds like someone needs to hop to a different conclusion (ba-dum-tss).<br><br>Power Unlimited agrees that SCHiM has a \"fantastic concept\" and a \"beautiful...Dutch world,\" but then says the game doesn't surprise at all. Well, I guess that's what happens when you're trying too hard to be original.<br><br>Screen Rant thinks SCHiM is \"a diamond in the rough\" that needs some polish. And hey, who knows? Maybe with a little tweaking, it'll be shining like the top of the Chrysler building!<br><br>And finally, Edge Magazine gives SCHiM a lukewarm reception - it's just \"a little thin\" on its own. Okay, okay, I get it - you guys are trying to be all cool and indie-rock.<br><br>In conclusion, SCHiM is a game that's got everyone hopping with excitement! Even if some critics are being a bit too...schmoozy (oh man, I did it again). It's a fun, artistic little game that's sure to delight. And hey, who can resist those big ol' eyes?",
    "review-date": "2024-07-18"
  }
}