{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny, folks! It's your favorite seasonal grok video game reviewer here to dish out the dirt on the latest turn-based tactics anthology, Songs of Conquest. Now, I know what you're thinking: another indie game trying to fill the void left by Heroes of Might and Magic? Well, let me tell you – this one's got heart, folks!<br><br>Now, before we dive into the nitty-gritty, I gotta give a shout-out to my fellow critics out there. Eurogamer says it's all about the battles being \"surprisingly punishing\" and occasionally uneven, but hey, that's what makes 'em so fun, right? God is a Geek gives it a whopping 90% for being a \"stand-out hit,\" while IGN Italia chimes in with some seriously romantic language: \"a respectful and heartfelt tribute to Heroes of Might and Magic... modern and nostalgic, romantic and exciting.\" GameStar just says it's \"really good\" without much elaboration, The Games Machine praises the game's balance and community features, PC Games calls it a \"first-class indie game,\" and TheGamer just straight-up says it's a \"golden example\" of turn-based strategy done right.<br><br>Now that we've got our critics' takes out of the way, let's get to what really matters: gameplay! Songs of Conquest is all about the nostalgia, folks. It's like stepping back into the golden age of Heroes of Might and Magic, with a modern twist that'll keep you coming back for more. The battles are where it's at – they're tactical, intense, and sometimes even a little bit frustrating (in a good way, of course). And hey, who doesn't love a good ol' fashioned campaign mode? The world is rich and colorful, with characters and factions to spare.<br><br>So what's the verdict, folks? If you're looking for a game that'll scratch that Heroes of Might and Magic itch without feeling like a carbon copy, Songs of Conquest is your answer. Trust me when I say it's a wild ride full of strategy and charm – just don't say I didn't warn you about those punishing battles!",
    "review-date": "2024-05-26"
  }
}