{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! I'm so excited to dive into the delightful world of Songs of Conquest, a turn-based tactics anthology that's got everyone singing its praises. From Lavapotion, this indie gem is a loving tribute to Heroes of Might and Magic, but does it live up to the hype?<br><br>Let me start by saying that the game's battles are where it truly shines. I mean, who doesn't love a good ol' fashioned strategy session, right? The punishing difficulty curve had me scrambling for those sweet, sweet victory rewards (and, let's be real, sometimes just scrambling to not get destroyed). But in all seriousness, the combat is cleverly designed, with each faction having its unique strengths and weaknesses.<br><br>Now, I know what you're thinking: \"Self-deprecating reviewer, why are you always making fun of yourself?\" Well, it's because even I, a seasoned grok (get it?), can appreciate a good laugh. And trust me, Songs of Conquest had me chuckling more times than I can count.<br><br>But let's get to the serious stuff. What really sets Songs of Conquest apart is its sheer scale and ambition. The developers at Lavapotion have managed to cram an absurd amount of content into this game – think hours upon hours of gameplay, multiple factions to play with (each with their own unique storylines!), and even community-made content! It's like they took everything that was good about Heroes of Might and Magic and amplified it.<br><br>And yet, despite all the praise from critics like Eurogamer (\"a lot of heart in this gorgeous turn-based tactics anthology\"), God is a Geek (\"stand-out hit\" – I mean, who doesn't love that?), IGN Italia (\"respectful and heartfelt tribute\" with \"splendid contemporary pixel art\"?), GameStar (\"strikes a really good figure\"), The Games Machine (\"near-perfect balance of the four playable factions\"), PC Games (\"first-class indie game... will keep you enthralled for many hours\"), and TheGamer (\"golden example of turn-based strategy games done right\")... I still found myself nitpicking. Where was the replay value? Was it enough to justify the price tag?<br><br>Don't get me wrong, Songs of Conquest is an absolute delight. It's a love letter to fans of Heroes of Might and Magic (and, honestly, anyone who loves a good turn-based strategy game). But let's not forget that Lavapotion has set the bar high – very high. If this is the start of a new series, I'm both excited and terrified. Bring it on, though!<br><br>In conclusion, Songs of Conquest is a fantastic addition to the world of turn-based tactics games. With its gorgeous pixel art, clever combat mechanics, and sheer scale, it's a game that will keep you enthralled for hours on end (if not days... or weeks... okay, maybe months). So go ahead, give it a try – just don't say I didn't warn you about those punishing battles!",
    "review-date": "2024-05-23"
  }
}