{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! Let's dive into the world of turn-based tactics and strategy with Songs of Conquest. I'm not here to give you a history lesson or wax poetic about game development; just get ready for some honest-to-goodness gaming goodness.<br><br>As a seasonal grok reviewer, I must admit that my skills are limited to the realm of video games (and sometimes even questionable). So, if you're looking for something other than a fun-loving, no-nonsense review, you've come to the wrong place! But hey, since we're on the topic of turn-based strategy games, why not start with some serious praise?<br><br>Let's see what our fellow critics have to say. The esteemed Eurogamer folks gave Songs of Conquest a score of 60, noting that while battles can be punishing and uneven at times, there's still plenty of heart in this gorgeous anthology. I mean, who doesn't love a good game with some heart?<br><br>On the other hand, God is a Geek was singing the praises of Songs of Conquest, giving it a well-deserved 90! They praised the indie release for being a standout hit and something that can't be missed.<br><br>IGN Italia also chimed in, saying that Lavapotion has done an amazing job with this game. The reviewer even went so far as to say that they can't wait for further content because Songs of Conquest could very well become the beginning of a new legend.<br><br>GameStar gave it a score of 82, but their comment was just one big question mark. Maybe they were trying to keep things mysterious? Who knows?<br><br>The Games Machine came in with an 85, saying that this game fits perfectly into the mold of Heroes of Might and Magic. They also praised the balance of all four playable factions and the sheer amount of content.<br><br>PC Games gave it an 80, saying that Songs of Conquest does everything right. It's a golden example of turn-based strategy games, with so much depth and scope.<br><br>Last but not least, we have TheGamer, who also gave it an 80! They praised the welcoming difficulty curve, various modes to play around in, and all the interesting characters and factions that come with this game.<br><br>Hippo Penny here is just a seasonal grok reviewer, and while I might not be the most experienced critic out there, I do know how to have fun. And let me tell you, Songs of Conquest looks like a blast! So go ahead, give it a try, and see what kind of magical world you can create.<br><br>So that's my Hippo Penny review for Songs of Conquest. Hope you enjoyed the ride and had as much fun reading this as I did writing it.",
    "review-date": "2024-05-22"
  }
}