{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's time to get my groovy review on for Songs of Conquest, the indie darling that's got everyone talking. I mean, who doesn't love a good turn-based tactics game that pays homage to the classics?<br><br>Now, I know what you're thinking - \"Why should I care about another Heroes of Might and Magic clone?\" Well, let me tell you, my friends, this ain't just any ol' clone. Lavapotion's done an amazing job of capturing the essence of HoMM without copying it straight up. It's like they took all the best bits, added some groovy pixel art, and served it with a side of nostalgia.<br><br>But don't just take my word for it! The critics are having a blast too. Eurogamer gave it 60 points, saying it's got \"heart\" - whatever that means (I'm still trying to figure out what that even means). God is a Geek raved about it, calling it a \"stand-out hit\" - yeah, because indie games don't usually get that kind of attention. IGN Italia said it's a \"respectful tribute\" with some personal touches that make it modern and nostalgic at the same time - I mean, who doesn't love nostalgia? GameStar gave it 82 points, saying it revives the spirit of HoMM 3 - which is pretty high praise if you ask me. And PC Games said it's a \"first-class indie game\" that'll keep you enthralled for hours on end - sign me up!<br><br>But what really gets my hippo-pants excited is TheGamer's review, where they called Songs of Conquest \"a golden example\" of turn-based strategy games done right. I mean, if it's good enough for them, it's good enough for me!<br><br>Now, I know some of you might be thinking, \"But what about the flaws?\" Ah, yes! The single-player campaign's a bit wonky, and maybe there are some minor balance issues with certain factions. But honestly, who doesn't love a game that's still got some rough edges but is generally amazing? It's like life - we're all works in progress, right?<br><br>So, if you haven't checked out Songs of Conquest yet, what are you waiting for? Trust me, it's worth the trip. Hippo Penny approves!",
    "review-date": "2024-05-28"
  }
}