{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's time to gallop into the world of turn-based tactics with Songs of Conquest. As your trusty seasonal grok video game reviewer, I'm here to give you the lowdown on this lovely little indie gem.<br><br>First off, let me just say that I'm not exactly a master strategist. In fact, my tactical skills are roughly on par with a drunken elephant trying to navigate a minefield. BUT, I do love a good turn-based battle royale, and Songs of Conquest delivers!<br><br>The game's got heart, folks! It's clear that the developers at Lavapotion were inspired by the Heroes of Might & Magic franchise (who wouldn't be?) and aimed to create something special. And special it is! The game's gorgeous pixel art is a feast for the eyes, and the battles are engaging without being overwhelming.<br><br>Now, I know what you're thinking: \"But what about the criticism from those fancy-pants critics?\" Ah, yes! Let me take on some of them:<br><br>* Eurogamer says the battles can be punishingly uneven. Um, isn't that just a nice way of saying it's super hard and will drive you crazy? I mean, in a good way... sorta?<br>* God is a Geek gives it a 90! Yay! I'm with them on this one; Songs of Conquest is a standout hit!<br>* IGN Italia says Lavapotion has masterfully added personal touches to the turn-based gameplay. Yeah, I'd agree! It's like they took all the best bits from Heroes and mashed 'em together with some new magic.<br>* GameStar just calls it \"romantic and exciting.\" Aw, shucks, that's me! Okay, maybe not exactly...<br><br>In any case, Songs of Conquest is a charming little game that'll keep you entertained for hours. The faction designs are unique, the world is richly detailed, and the battles... oh boy, the battles! It's like they took all the fun bits from Heroes and Heroes-like games and put 'em into one neat package.<br><br>All in all, Hippo Penny gives Songs of Conquest a big ol' thumbs-up! So grab your favorite snack (I recommend something crunchy), sit back, and get ready to join me on this delightful adventure. And remember: don't worry if you're not the best strategist – just enjoy the ride!<br><br>(Reviews continue on next page... or not. I'm done for now. Happy gaming!)",
    "review-date": "2024-05-23"
  }
}