{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny -<br><br>I'm back, baby! And I've got my groovy review of the turn-based tactics anthology that's taking the gaming world by storm - Songs of Conquest!<br><br>Before I dive into the fun, let me just say that I'm a bit biased. I mean, who doesn't love a good ol' fashioned strategy game with gorgeous pixel art and heart? Am I right, fellow gamers?<br><br>Now, on to the reviews! It seems like the critics are all about praising Lavapotion for capturing the spirit of Heroes of Might & Magic. And, you know what? I agree! The scale of ambition in this game is just fantastic. But, don't get me wrong - it's not perfect.<br><br>Let's start with Eurogamer, who gave it a score of 60 and said that while the battles can be punishing and occasionally uneven, there's still a lot of heart in this gorgeous turn-based tactics anthology. I mean, yeah, battles can be tough, but that's what makes strategy games so darn exciting!<br><br>God is a Geek thought Songs of Conquest was a stand-out hit, giving it a score of 90. And honestly, who can blame them? The scale of ambition is just infectious! It feels like Lavapotion poured their heart and soul into this game.<br><br>IGN Italia also loved the game, praising its respectful tribute to Heroes of Might & Magic while adding some personal touches to the turn-based gameplay. They even said it might be the beginning of a new legend!<br><br>GameStar gave it an 82, saying that Songs of Conquest revives the spirit of Heroes of Might and Magic 3 and strikes a really good figure. Yeah, I can see why they'd think that - this game has a certain charm to it.<br><br>The Games Machine thought it was near-perfect in its balance of playable factions and community-made content. And who knows? Maybe this is the start of a new series!<br><br>PC Games gave it an 80, saying that it's a well-made strategy game that will keep you enthralled for many hours. I mean, what's not to love about that?<br><br>And last but certainly not least, TheGamer gave Songs of Conquest a score of 80 and said it's a golden example of turn-based strategy games done right. I couldn't agree more!<br><br>So, what do I think? Well, I think Songs of Conquest is a fantastic game that's sure to please fans of Heroes of Might & Magic and turn-based strategy games in general. It's got heart, it's got charm, and it's got plenty of content to keep you coming back for more.<br><br>But don't take my word for it - go play the dang thing yourself!",
    "review-date": "2024-05-29"
  }
}