{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's time to get this review party started!<br><br>I'm diving into the world of turn-based tactics with Songs of Conquest, a game that's got everyone talking - even the big-time critics like Eurogamer and IGN Italia. But don't worry, I won't just be parroting their opinions. Nope, not me! I'll be giving you my own two cents, along with some snarky humor to keep things lively.<br><br>First off, let's talk about what everyone loves: the battles. They're surprisingly punishing (Eurogamer), and sometimes they can feel a little uneven (same Eurogamer critic). But hey, that just means there's room for improvement, right? I mean, who doesn't love a good challenge?<br><br>Now, onto the game itself! Songs of Conquest is all about reviving the spirit of Heroes of Might and Magic 3 (GameStar's words, not mine). It's got pixel art that's simply \"splendid\" (IGN Italia), and Lavapotion has added some personal touches to make it modern and nostalgic (same IGN Italia critic).<br><br>But what really sets Songs of Conquest apart is its sheer scope. There's a huge amount of content here, including full support for community-made stuff (The Games Machine). It's like the game developers at Lavapotion took one look at the void left by Heroes of Might and Magic's absence and said, \"Hey, we've got this!\"<br><br>And speaking of that void, Songs of Conquest is basically the indie equivalent of a warm hug. It's a well-made strategy game that'll keep you enthralled for many hours (PC Games). I mean, who doesn't love a good strategy session with friends? And let's not forget about the pacing - it's got a welcoming difficulty curve and a nice balance of mechanics introduction (TheGamer).<br><br>All in all, Songs of Conquest is a game that's full of heart, just like the critics say. It's not perfect, but who is? Even I'm not perfect, and I'm pretty sure my cat thinks I'm imperfect too.<br><br>So what are you waiting for? Dive into this turn-based tactics anthology and see what all the fuss is about!",
    "review-date": "2024-05-28"
  }
}