{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! Let's get this groovy review going!<br><br>Songs of Conquest has got me feeling like a hippie on a sunny day, man. It's a turn-based tactics game that's all about heart and soul, just like those fabulous pixel art graphics would suggest. I mean, who wouldn't want to spend hours basking in the warm glow of nostalgia, conquering lands, and saving the world from certain doom?<br><br>Now, before I get too caught up in my own groovy vibes, let's take a look at what the other critics are saying. Oh boy, there's some love being spread around! Eurogamer gave it 60, saying that while battles can be punishing (ouch!), there's still a lot of heart here. God is a Geek thought it was a \"stand-out hit\" with a 90 score - yikes, talk about high praise! IGN Italia went all out, gushing over the game's \"respectful and heartfelt tribute\" to Heroes of Might and Magic, earning itself another 90. The Games Machine and Eurogamer Germany both gave it an 80, praising its balance and content (respect!). And GameStar... well, they're being mysterious, aren't they?<br><br>But enough about those squares - I'm here for the fun! So, what's my take on Songs of Conquest? Well, let me tell you, this game has got some serious mojo working. The single-player campaign might be a tad rough around the edges (hey, even hippies have off days!), but the multiplayer is where it's at - I mean, who doesn't love saving the world with friends?<br><br>The real magic happens when you get into the rhythm of things. You'll find yourself humming along to those pixel art tunes, mesmerized by the beautifully rendered landscapes and characters... heck, you might even start collecting factions like they're rare Pokémon! (I mean, I won't judge - we all have our quirks!)<br><br>In conclusion (and on a serious note), Songs of Conquest is an absolute blast. It's not just for fans of Heroes of Might and Magic, either - it's for anyone looking to sink their teeth into some good ol' turn-based tactics action with heart.<br><br>So, go ahead and give this game the love it deserves! I'm Hippo Penny, and I approve these groovy vibes!",
    "review-date": "2024-05-21"
  }
}