{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny, folks! It's your favorite grog reviewer back at it again, ready to dive into the world of turn-based tactics and pixel art goodness that is Songs of Conquest.<br><br>Now, I know what you're thinking - what's with all these fancy-pants critics and their scores? Well, let me tell you, they may have given this game high praise, but can they handle a grog's unique blend of humor and honesty? I think not!<br><br>So, onto the review! Songs of Conquest is an indie game that aims to fill the void left by Heroes of Might and Magic, and boy does it deliver. The gameplay is turn-based tactics at its finest, with a delightful pace that never feels too slow or too fast. The graphics are a love letter to the pixel art of yesteryear, with colorful characters and factions that will transport you back to the good ol' days.<br><br>Now, I know some of these fancy-pants critics may have said it's just a copy-and-paste job, but let me tell you, Lavapotion has done something special here. They've taken the best parts of Heroes of Might and Magic and added their own personal touches, making it feel fresh and exciting.<br><br>But don't just take my word for it - check out what some of these other critics had to say:<br><br>* \"In a year that's slowly being dominated by indie releases, Songs of Conquest from Lavapotion is a stand-out hit.\" - God is a Geek (90)<br>* \"Songs of Conquest revives the spirit of Heroes of Might an Magic 3 and strikes a really good figure.\" - GameStar (82)<br>* \"The developers at Lavapotion deliver a first-class indie game that manages to capture the spirit of the great Heroes of Might & Magic better than any other competitor has ever been able to.\" - PC Games (80)<br><br>So, what's the verdict? Well, I think it's clear that Songs of Conquest is a must-play for fans of turn-based tactics and pixel art. It's got heart, it's got humor, and it's got more than a little bit of nostalgia thrown in.<br><br>And don't worry, folks - this grog reviewer won't leave you hanging. I'll be back with more reviews and more grog-tastic commentary. Stay tuned!",
    "review-date": "2024-05-27"
  }
}