{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny, folks! Get ready to dive into the mind-blowing world of Superhot: Mind Control Delete. As a seasoned grok video game reviewer (read: self-proclaimed expert), I'll dish out the dirt on this standalone expansion to the original SUPERHOT. But first, let's take a peek at what the critics are saying...<br><br>Slant Magazine gave it an 80%: \"Mind Control Delete feels like the brainchild of students who were into debate club as much as programming.\" Hmm, sounds like they're poking fun at my own writing style (just kidding, Slant! I'll have you know, my reviews are always expertly crafted... or not).<br><br>GamingTrend also chimed in with an 80%: \"This standalone expansion to SUPERHOT is a welcome addition to the formula. What it lacks in bespoke puzzle elements, it makes up for in a completely fresh and vastly expanded approach to the central concept.\" Okay, okay, I get it – you guys are trying to say that Mind Control Delete is more of the same good stuff we loved from the original.<br><br>Now, let's talk about some of the other reviews. Destructoid gave it a whopping 95%: \"It's a power fantasy that makes you work for the right to feel like a god and when your plans come together it's a joyous romp to play.\" I mean, who doesn't love a good power trip?<br><br>Eurogamer Italy also went all in with a 80%: \"Superhot Mind Control Delete is a sublime action game like its predecessor. A continuous flow of fun that will make you dance through its levels for a long, long time.\" Okay, okay – I'll stop dancing now.<br><br>Last but not least, God is a Geek gave it a 95%: \"Superhot: MIND CONTROL DELETE is a truly fantastic, challenging shooter that makes an already incredible premise even better.\" Oh, don't be shy – give it up for those who think this game is the cat's pajamas!<br><br>And then there's Hardcore Gamer with their 80% review: \"More than four years on, SUPERHOT remains as instantly recognizable and immensely appealing a gameplay concept as it ever was on day one. MIND CONTROL DELETE may feel more like a continuation of a good run, rather than a full expanding upon the foundation, but that doesn’t mean that what new features it does offer up fail in helping to bolster what still remains a fun and ingenious interpretation of first-person shooting and puzzle-solving fused together.\" Wow, I think they might be trying too hard to sound smart.<br><br>Finally, we have GameCritics with their 60% review: \"Mind Control Delete ultimately feels like an arcade-mode add-on that should've been included with the original release. Although it’s novel, I value the original's audacity in presenting a brilliant idea without wasting any of my time.\" Ouch, sounds like they didn't quite get what Mind Control Delete is all about (hint: it's not just more of the same).<br><br>So, what's the takeaway? Superhot: Mind Control Delete is a fantastic expansion that builds upon the original while introducing new mechanics and challenges. It might not be perfect, but it's definitely worth checking out – especially if you're a fan of the SUPERHOT series.<br><br>Now, go ahead and grab those popcorns (or whatever your snack of choice is), because it's time to dive into the world of Mind Control Delete!",
    "review-date": "2024-04-24"
  }
}