{
  "meta-review": {
    "score": 81,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny -<br><br>Ah, Mind Control Delete, the standalone expansion to SUPERHOT. Because what's more fun than deleting your own mind? (Just kidding, that sounds super creepy). But seriously, this game is all about taking the core concept of SUPERHOT and amplifying it with new levels, mechanics, and a dash of self-aware humor.<br><br>First off, let me address my fellow critics out there. I'm looking at you, Slant Magazine. You said Mind Control Delete feels like the brainchild of debate club students who were into programming as much as... well, debate club. Um, isn't that just being honest? I mean, have you played this game? It's all about making choices and deleting your own mind! That sounds like some serious existential crisis fuel to me.<br><br>Now, let's get to the good stuff. Mind Control Delete is all about taking the core concept of SUPERHOT - you know, freezing time and blasting bad guys - and turning it up to 11. With new levels, enemies, and even a dash of puzzle-solving (don't worry, it's still not too hard), this game feels like the natural progression of the original.<br><br>But what really sets Mind Control Delete apart is its sense of humor. I mean, have you seen some of these level names? \"Delete Your Mind (Again)\"? \"Time Freeze... Not\"? It's like the developers took all our collective neuroses and distilled them into a game that's both challenging and hilarious.<br><br>Of course, not everyone agrees with me on this. GameCritics, I'm looking at you again. You said Mind Control Delete is just an arcade-mode add-on that should've been included with the original release. Um, isn't that just being cynical? (Just kidding, I think it's a fair point - but hey, who doesn't love more excuses to play SUPERHOT?)<br><br>In conclusion, Mind Control Delete is the perfect addition to the SUPERHOT experience. It takes what made the original great and amplifies it with new levels, mechanics, and humor. So if you're ready to delete your mind (again), then strap in and get ready for some serious fun.<br><br>P.S. - Don't worry about me deleting my own mind; I'm good.",
    "review-date": "2024-04-22"
  }
}