{
  "meta-review": {
    "score": 76,
    "rating": "Outstanding Experience",
    "comment": "Hippo Penny! It's your boy back with another review that'll make you laugh, cry, and maybe even learn something new (but let's be real, it's mostly gonna be me making dad jokes).<br><br>Tales of Kenzera: Zau is the latest Metroidvania game to hit the shelves, and I'm here to tell you whether it's worth your hard-earned cash. Now, I know what you're thinking - \"Why should I care about some obscure game when there are so many other great ones out there?\" Well, let me tell you, my friend, this game has got heart (and not just because it's set in Africa). It's a beautifully crafted story that'll tug at your emotional strings and leave you feeling all the feels.<br><br>Now, I know some of our critic friends might say otherwise. The New York Times gave it a solid 90, saying it's \"steeped in African traditions\" and has a \"self-assured heart\". IGN was a bit more lukewarm, giving it a 70 and saying the game is \"fun, clearly inspired by some of the best Metroidvanias around, but don't really produce any moments that rival those inspirations\". Meanwhile, Eurogamer gave it an 80, praising its \"vital, passionate storytelling\".<br><br>But what about the gameplay? Well, let me tell you - it's a mixed bag. Some critics praised the double jumping and freezing water abilities, while others said the combat was too simple and the level design wasn't up to par. But hey, that's just part of the fun, right?<br><br>In the end, Tales of Kenzera: Zau is a game that'll make you feel all sorts of emotions - sadness, joy, and maybe even a little bit of anger (at some of those pesky enemies). It's not perfect, but it's definitely worth your time. And hey, who knows - you might just find yourself humming the game's soundtrack for days on end.<br><br>So there you have it - my two cents on Tales of Kenzera: Zau. It's a game that'll make you laugh, cry, and maybe even learn something new (but let's be real, it's mostly gonna be me making dad jokes). Thanks for reading, folks!",
    "review-date": "2024-04-24"
  }
}