{
  "meta-review": {
    "score": 49,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny!<br><br>Teenage Mutant Ninja Turtles Arcade: Wrath of the Mutants - where do I even start? As a seasoned grok (see what I did there?), I've had my fair share of beat 'em ups, and this one's got some serious Turtle Power! But let me get this straight, IGN, you're telling me this game is like \"a two-dollar slice of pizza\" that hits the spot but doesn't fill me up for long? More like a slice of mediocrity with a side of crusty disappointment, am I right?<br><br>GamingTrend, you're not exactly singing praises either! You call it a \"rather sloppy bout of sewer surfin'\" - what's wrong, guys? Can't even surf the sewers properly?! It's like they took all the excitement and thrill of exploring the underground tunnels and replaced it with... well, nothing.<br><br>And don't even get me started on Hardcore Gamer's review! You're saying this game \"succeedes by playing it safe\"? That's like saying a turtle just decided to take up yoga - it might be cute, but come on, there's gotta be more to life than just being comfortable!<br><br>Now, I know some of you critics are gonna say, \"Hey, kid, this is just a fun little romp through the sewers!\" And to that, I say... um, thanks? But honestly, if you're looking for something with real substance, like TheSixthAxis's review says, then Wrath of the Mutants isn't it. It's like trying to find a pearl in an oyster - sure, it might be there, but is it really worth the hassle?<br><br>All right, let me wrap this up (pun intended). Video Chums and GameSpew, you both seem to agree that this game provides some basic beat-em-up fun, but it's just so... middling. Like a plain ol' pizza with no toppings - sure, it'll fill your belly, but is it really worth eating?<br><br>And finally, TheGamer, I gotta say, your review hit me right in the feels (or rather, my love for the 2012 TMNT). You're saying this game's short runtime and high price point make it hard to recommend? Well, ain't that the truth! It's like buying a ticket to a theme park only to find out they've run out of Turtle Power... I mean, cotton candy.<br><br>So there you have it - Hippo Penny's take on Teenage Mutant Ninja Turtles Arcade: Wrath of the Mutants. Is it a shell-abulous time-waster? Maybe. Is it worth your hard-earned cash? Meh. Let me know what you think in the comments below!",
    "review-date": "2024-04-24"
  }
}