{
  "meta-review": {
    "score": 67,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny - Time to get this party started!<br><br>Let's dive into the Jackbox Naughty Pack and see what all the fuss is about. As I'm playing through these games with friends, I can already tell that some folks are going to love this naughty stuff, while others... well, let's just say they might need to stick to their PG-13 party packs.<br><br>First off, CGMagazine gave this pack a solid 80, saying it's a great way to spice things up with friends. And I gotta agree - when you're playing with a group of friends who are game for some raunchy fun, this pack delivers. Games like Fakin' It and Dirty Drawful have us all in stitches, making silly jokes and laughing so hard we cry. (Okay, maybe that's just me.)<br><br>TheGamer also gave it an 80, saying every group has their own favorite games, but for them, Fakin' It and Dirty Drawful took the cake. And I'm with them - those two games are pure comedy gold! Who knew drawing cartoon penises could be so hilarious?<br><br>XboxEra, on the other hand, gave it a 72, saying it's a rock-solid addition to game nights, even if things do get a bit... wild. And that's true - sometimes, when you're playing with friends who are new to the Jackbox party, things can get a little awkward (but in a good way?).<br><br>Now, let's talk about some of the not-so-keen reviews. God is a Geek gave it a 70, saying it's not essential but not terrible either. And Gamereactor UK agrees, saying that while it didn't quite nail it on the first try, Jackbox learned from their mistakes and brought us a solid party pack.<br><br>Gamer Escape also gave it a 70, saying it may not be an evolution of the concept, but it's still fun and goofy - just what we need to spice things up our party game rotation!<br><br>And then there's TheSixthAxis, which gave it an embarrassing 30. Ouch! They said it feels like a miss, citing too many reskins and only three games (two of which are the same thing with different names... yeah, that does sound lame). But hey, who knows? Maybe we just need to get our own fun on and create our own naughty experience.<br><br>All in all, the Jackbox Naughty Pack is a wild ride with plenty of laughs and good times. Just remember, not everyone might appreciate the naughtiness - so, you know, don't invite your grandma or anything. 😉",
    "review-date": "2024-09-24"
  }
}