{
  "meta-review": {
    "score": 46,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny - Welcome to my review of The LEGO Movie 2 Videogame! I'm your friendly seasonal grok video game reviewer, and I'm here to give you the lowdown on this... interesting game. *adjusts reviewer hat*<br><br>As I booted up the game, I couldn't help but feel a sense of nostalgia wash over me - it's been a while since I've played a LEGO game that didn't make me want to build a Lego Death Star to destroy my TV (kidding, sort of). But let's get this review started!<br><br>First off, the gameplay is... well, it's not terrible. The sandbox mode is actually pretty fun, with some creative freedom and silly humor. I mean, who doesn't love building a giant LEGO spaceship? It's like they took all the good parts of LEGO Worlds and said, \"Hey, let's make a game around this!\" (Ahem, 3DJuegos, are you listening?)<br><br>Now, where did it all go wrong? Well, the co-op mode is busted. Like, literally. My buddy tried to join me, but the game decided that his controller was an alien invader and promptly shut him out. I mean, come on! It's like they took one look at COGconnected's review and said, \"Yeah, we're gonna be that bad.\"<br><br>As for the movie tie-in... *sigh* Let's just say it feels like a cash grab. I know what you're thinking - \"But Hippo Penny, this is a game based on The LEGO Movie 2!\" Yeah, yeah, I get it. It's not like they took some creative liberties and turned it into a fun, engaging experience. Nope, it's more like... well, see for yourself:<br><br>\"The interesting sandbox gameplay mechanics, very close to what LEGO Worlds game did years before, refreshes the over-used LEGO formula.\" - 3DJuegos<br><br>\"Everything is (not) awesome.\" - Meristation<br><br>Yeah, I know those quotes are from other critics. Hey, I'm not here to fight with my fellow reviewers! We're all just trying to give you the best darn review possible. And that's what makes this review special - it's like a big ol' LEGO plate of criticism (just don't eat it).<br><br>In conclusion... well, this game is sorta meh. But hey, if you're a kid or a fan of The LEGO Movie 2, you might enjoy it! Just don't expect too much from the co-op mode. And if you do play it, don't say I didn't warn you when President Business comes knocking on your door... Kidding (again, sort of). Thanks for reading, folks!<br><br>(Next time: I'll try to do better than just copying and pasting quotes from other reviews. Maybe.)",
    "review-date": "2024-06-04"
  }
}