{
  "meta-review": {
    "score": 67,
    "rating": "Solid and Enjoyable",
    "comment": "**Hippo Penny - A Wild Ride of Reviews**<br><br> Buckle up, folks! We've got a doozy of an article ahead of us. In this thrilling adventure, we're diving into the world of reviews for The Casting of Frank Stone game, where opinions range from \"mind blown\" to \"what blew your mind, anyway?\"<br><br>Let's start with GameSpew, who gave it a respectable 90/100. This critic was pleasantly surprised by the game's length and storytelling prowess, saying it's more like The Quarry than Dark Pictures. That's some solid praise right there!<br><br>Moving on, we have MeuPlayStation, who chimed in with a 83/100 score. Love is indeed \"in the air\"... of visuals, that is. This review highlights the game's creativity and action-packed sections, but notes it may not be for everyone.<br><br>Meanwhile, PlayStation LifeStyle (80/100) praises Supermassive's final act for taking some bold swings... and hitting a home run! The Easter eggs are just as fabulous as you'd expect from this series.<br><br>Not all reviews were shining stars, though. PlayStations Universe gave it 70/100, saying the formula is still the same but managed to marry well with Dead by Daylight. However, critics like us still can't help but mention those \"plodding horror adventuring\" woes <br><br>Things only got a bit rockier from there, as Hardcore Gamer (60/100) chimed in about The Casting's disappointment compared to our high expectations. And we must admit, they do have some valid points.<br><br>**Eurogamer Poland (50/100)** joins the party and warns us that this game is \"just okay\" by many measures - fun for fans of silly horror movies but not worth getting our hopes up too high.<br><br>Last but certainly not least, NME (40/100), a particularly skeptical review body in our book, claims Supermassive stuck to an old script instead of trying something new. Now that would be news worth reporting some actual disappointment",
    "review-date": "2024-09-08"
  }
}