{
  "meta-review": {
    "score": 46,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny -! I'm thrilled to be diving into this utterly average LEGO game, based on the equally unremarkable movie sequel. Let's get this out of the way: it's not great.<br><br>But first, let's take a peek at what the other \"experts\" have to say. *cough* COGconnected, you're being too harsh! I mean, I'm sure the developers did their best with limited time and all that jazz (snore). Still, your review is as dull as the game itself.<br><br>Meanwhile, Eurogamer Italy thinks this game looks like LEGO World reskinned, without the humor and pace of the movie. Yeah, that's about right. It's like they took the excitement and creativity of The LEGO Movie 2 and replaced it with... well, not much at all.<br><br>Metro GameCentral goes a bit further: \"A cheap and nasty film tie-in...\" Ouch! That's some strong language for a family-friendly franchise. But hey, when you're as underwhelmed as they are, what's the harm in being brutally honest?<br><br>3DJuegos seems to be one of the few critics who actually enjoyed this game. They praise the \"interesting sandbox gameplay mechanics\" and how it refreshes the overused LEGO formula. Okay, I'll give them that – it might be a decent way to spend an afternoon if you're a kid or something.<br><br>Cubed3, on the other hand, is not impressed. In fact, they're downright disappointed: \"A heavily flawed shell of what the franchise had become.\" Yeah, I get it. When you take away all the good parts and leave only mediocrity in their wake... well, it's just a mess.<br><br>Meristation gives this game two thumbs down, saying it's one of the easiest LEGO games out there. Well, that might be true for kids, but for anyone who's played these games before, it's just too bland.<br><br>And finally, TheSixthAxis sums up the whole experience: \"A throwback to the bad old days of movie tie-ins...\" Yeah, I'm right there with you, dude. This game is a total letdown, and if President Business designed it (as you so aptly put it), then he should probably stick to being a fictional character.<br><br>In conclusion, The LEGO Movie 2 Videogame is just that – average. Nothing special, nothing exciting, and definitely not \"everything is awesome\" like the movie promises. If you're looking for a decent LEGO game to play, I'd recommend checking out some of the other titles in the franchise (DC Super-Villains, anyone?). Trust me, your sanity will thank you.",
    "review-date": "2024-06-07"
  }
}