{
  "meta-review": {
    "score": 46,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny -<br><br>Okay, okay, I know what you're thinking - why should I care about another mediocre LEGO game review? Well, let me tell you, dear reader, this one's different. I mean, who doesn't love a good trash can of a game? It's like a trainwreck that you can't look away from.<br><br>So, The LEGO Movie 2 Videogame (try saying that three times fast) has received a whopping 20% approval rating on the Critics' Circle (see what I did there?). COGconnected had this to say: \"A frustrating cash grab.\" Ouch. That's like getting dumped by your favorite snack food - it hurts.<br><br>Eurogamer Italy agreed, calling it a reskin of LEGO Worlds with broken co-op. Yikes. Imagine playing through an entire game with a friend who keeps disappearing on you because the game won't even let them join in. Not exactly the most fun experience.<br><br>Metro GameCentral took it a step further, saying: \"A cheap and nasty film tie-in that reaches a new low for Lego games.\" Wow, that's some strong language right there. I mean, I've had my fair share of disappointing gaming experiences, but this one takes the cake.<br><br>On the other hand, 3DJuegos thought the game was... well, not terrible? They praised the sandbox gameplay mechanics and how they refreshed the LEGO formula. I guess if you're a die-hard LEGO fan, you might find some redeeming qualities here.<br><br>But let's get to the real question - is this game worth your time? Well, Cubed3 said: \"Everything is just meh.\" And honestly, that sums it up perfectly. It's like playing a game that's just... there. Not bad, not great, just... existent.<br><br>So, if you're looking for a fun LEGO experience, might I suggest skipping this one and going straight to DC Super-Villains or the Harry Potter re-release? Trust me, your time will be much better spent on those.<br><br>Or, if you're feeling adventurous and want to try something new (read: boring), go ahead and give The LEGO Movie 2 Videogame a shot. Just don't say I didn't warn you.",
    "review-date": "2024-06-06"
  }
}