{
  "meta-review": {
    "score": 46,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny - It's time to get this party started with my review of The LEGO Movie 2 Videogame!<br><br>Let me start by saying that I'm not a huge fan of movie tie-ins. They often feel like lazy cash grabs, but I went into this game with an open mind (and a few slices of pizza in my belly). And, well, it's... interesting.<br><br>The gameplay is pretty straightforward - you play as Emmet or Lucy and try to stop the evil Systar System from taking over Bricksburg. Sounds simple, right? But here's the thing: this game feels like a reskin of LEGO Worlds. You know, that other LEGO game that nobody plays anymore. Yeah, it's basically just that, but with a bunch of movie tie-ins and... well, let's be real, some pretty poor graphics.<br><br>Now, I'm not going to lie - the critics were not kind to this game. COGconnected gave it a score of 20, saying it felt like a \"frustrating cash grab.\" Metro GameCentral was even harsher, calling it a \"cheap and nasty film tie-in.\" Ouch. And don't even get me started on TheSixthAxis - they basically said the game is full of \"static environments and boring construction.\"<br><br>But hey, not everyone hated it! 3DJuegos gave it a score of 75, saying the sandbox gameplay mechanics were pretty fun. And Meristation? They said it was easy and recommended for kids (but also kinda bland).<br><br>So, what's my verdict? Well, I'm not going to sugarcoat it - this game is meh. It's just not that exciting. The graphics are subpar, the gameplay is too similar to LEGO Worlds, and... well, there just isn't much to get excited about.<br><br>But hey, if you're a kid who loves The LEGO Movie 2 (or just likes running around in LEGO worlds), you might have some fun with this game. Just don't expect too much from it.<br><br>And that's my two cents on The LEGO Movie 2 Videogame! What do you think? Have you played the game? Let me know in the comments below!",
    "review-date": "2024-06-07"
  }
}