{
  "meta-review": {
    "score": 46,
    "rating": "Disappointing Game Experience",
    "comment": "Hippo Penny!<br><br>I'm diving into the latest LEGO game, The LEGO Movie 2: Videogame, to see if it's a masterpiece or just a brick-tastic disappointment. With a slew of lackluster reviews from critics (cough, cough, COGconnected, I'm looking at you), I'm expecting some serious bricks-ness (that's \"disappointment\" for those who don't speak Grok).<br><br>But before we get to the nitty-gritty, let's take a peek at what the critics had to say:<br><br>* COGconnected: \"A frustrating cash grab.\"<br>* Eurogamer Italy: \"Looks like a LEGO World reskin without the movie's humor and pace. And with a broken co-op.\" (ouch!)<br>* Metro GameCentral: \"Cheap and nasty film tie-in that reaches a new low for Lego games.\"<br>* 3DJuegos: \"Refreshing sandbox gameplay mechanics, but still feels like more of the same old LEGO formula.\"<br>* Cubed3: \"Everything is just meh. A heavily flawed shell of what the franchise had become.\"<br>* Meristation: \"Easiest game in the franchise with some graphic issues. Very recommended for children, though.\" (yawn)<br>* TheSixthAxis: \"Uninspired and dull reskin of LEGO Worlds that takes all the good parts of LEGO games and tosses them in the bin.\"<br><br>Okay, now that we've got the critics' takes out of the way, let's get to the gameplay! In this reviewer's humble opinion (ahem), The LEGO Movie 2: Videogame is a bit of a mixed bag. On one hand, the game has some clever puzzles and fun moments of exploration. On the other hand, it feels like they took all the creativity and humor from the original movie and replaced it with... well, not much at all.<br><br>The co-op mode, which I was looking forward to trying out, is broken beyond repair (as Eurogamer Italy so kindly pointed out). And don't even get me started on the graphics – it looks like they took a shortcut by reusing assets from LEGO Worlds. Yikes!<br><br>All in all, while The LEGO Movie 2: Videogame might be suitable for younglings who are still learning to build with Legos (get it?), adults and fans of the franchise will likely find this game as dull as a butter knife. That is all.<br><br>Stay tuned for more Grok-tastic reviews!",
    "review-date": "2024-06-03"
  }
}