{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your boy back with another rad review!<br><br>Tony Hawk's Pro Skater 1 + 2 is like that one cousin who shows up to the family reunion and brings all the old favorites along with some fresh new tricks. You know what I'm talking about, right? Like, it's not just a lazy rehash of the same ol' Tony Hawk experience; nope! It's like they took all the best bits from yesteryear, threw in some modern flair, and BAM! Instant classics!<br><br>IGN thinks this game is so good, it's hard to be cynical about Activision trying to sell us our favorite games again. I mean, who can blame them? This is the kind of goodness that makes you wanna grab your board and hit the streets (or, you know, just play some more). And don't even get me started on GameSpot; they're all like, \"The load times aren't enough to keep you away from the plethora of satisfying combos...\" Yeah, yeah, yeah! I'm with them!<br><br>Now, I know what you're thinking: \"Is this game really worth it?\" Well, let's just say that Game Informer thinks it's a blast from the past that feels fresh and current. Like, who wouldn't want to relive those golden skateboarding years while still having some new tricks up your sleeve? And don't even get me started on Gaming Age; they're like, \"This is one of the best remasters available...\" Yeah, I'm a believer!<br><br>Of course, not everyone's going to be completely stoked. Like Worth Playing, who thinks it's great but could've taken more risks. And hey, I get that. But honestly, when something feels this good, you just gotta roll with it! (Cheat Code Central agrees; they're all like, \"Perfect remaster...\")<br><br>So, if you ask me, Tony Hawk's Pro Skater 1 + 2 is the real deal. It's a trip down memory lane that's also super fun and modern. Trust me when I say that SpazioGames knows what's up – this game is both nostalgic and a modern experience!<br><br>That's it for this review! If you're stoked about skateboarding or just wanna relive some classic gaming vibes, then Tony Hawk's Pro Skater 1 + 2 is the way to go!",
    "review-date": "2024-05-27"
  }
}