{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Get ready to skate like it's 1999!<br><br>I just spent the past few hours playing Tony Hawk's Pro Skater 1 + 2, and I'm still reeling from the experience. The game is a masterclass in nostalgia, transporting me back to my childhood days of mashing buttons and ollie-ing around iconic levels. But it's not just a lazy cash-in on past glories - no, this remaster is a lovingly crafted tribute to the originals, with modern twists that make it feel fresh and exciting.<br><br>Now, I know what you're thinking: \"What about those fancy-pants review scores from IGN and GameSpot?\" Well, let me tell you, those 90s are well-deserved. The game's accessible yet challenging gameplay is still timeless, and the beautiful graphics bring the levels to life like never before. And don't even get me started on the soundtrack - it's like an old childhood buddy just gave me a big ol' hug.<br><br>Of course, not everyone was entirely impressed. I mean, who needs level goals for every skater, right? But honestly, the lack of them didn't detract from my experience one bit. And hey, the online multiplayer is a great way to get your friends involved - even if you do have to deal with some laggy matchmaking.<br><br>Now, I'm not going to lie, there are a few minor gripes to be had (what's up with those load times, Activision?). But overall, Tony Hawk's Pro Skater 1 + 2 is an absolute blast. And if you don't believe me, just check out the scores from the likes of Gaming Age and Cheat Code Central - they're practically swooning over this game.<br><br>So there you have it, folks. If you're a fan of the original Tony Hawk's Pro Skater games or just looking for some old-school fun with modern flair, Tony Hawk's Pro Skater 1 + 2 is an absolute must-play. And if you don't believe me? Well, Hippo Penny - I'll give you a free pass to go forth and skate like the wind!",
    "review-date": "2024-06-03"
  }
}