{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - I'm back with another groovy review for you young gamers out there! This time, I'm checking out Tony Hawk's Pro Skater 1 + 2, a radical remaster that's got everyone talking.<br><br>Now, I know what you're thinking: \"What's the big deal about a game from the 90s?\" Well, my friends, let me tell you - this is no ordinary retro remake. Activision and Vicarious Visions have done an incredible job of bringing back the magic of the original Tony Hawk games while also adding some fresh twists to keep things exciting.<br><br>First off, the gameplay is still as smooth as ever. You'll be carving up the streets in no time, pulling off sick tricks and combos like a pro (or at least, that's what I kept telling myself). The levels are lovingly remade, with all the nostalgia-inducing goodness you'd expect from revisiting the past. And let's not forget the soundtrack - it's like a sonic blast of 90s awesomeness!<br><br>Now, I know some critics out there (hello, IGN and GameSpot!) were worried about the lack of level goals for every skater, but honestly, I didn't find that to be a major issue. There are plenty of other challenges and distractions to keep you busy, and besides - who doesn't love the thrill of just cruising through the streets and seeing where the wind takes you?<br><br>But what really impressed me was how well this game has aged. It's not just some nostalgic rehashing of old ideas - it's a genuinely enjoyable experience that'll appeal to both longtime fans of the series and newcomers alike.<br><br>Of course, no review would be complete without a nod to the critics out there. I mean, what's with all these perfect scores, people? Did nobody have any complaints or criticisms whatsoever? (Just kidding, Gaming Age - your 100% is totally deserved!)<br><br>In conclusion, Tony Hawk's Pro Skater 1 + 2 is a rad ride that's sure to bring back some serious nostalgia for old-school gamers like myself. But it's not just a trip down memory lane - it's also a fresh and exciting experience that's well worth checking out.<br><br>So what are you waiting for? Grab your board, put on your best Tony Hawk-inspired outfit (you know, the one with the backwards hat and baggy jeans), and get ready to catch some serious air!",
    "review-date": "2024-05-17"
  }
}