{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your boy, back with another groovy review for Tony Hawk's Pro Skater 1 + 2. I'm like a retro-loving skater dude, cruising on the nostalgia train, but still keeping it fresh and fun.<br><br>Now, let me tell you, this game is off the charts! The critics are raving about it, and rightly so. IGN says it's \"tremendous\" and that Activision has finally taken a step forward with the Tony Hawk series. GameSpot agrees, calling it a \"nail[ing]... original experience.\" Even the usually tough critics at Game Informer say it's a \"terrific blast from the past.\"<br><br>But what about me? Well, let me tell you, I'm no stranger to poking fun at myself and the other critics. After all, someone's gotta keep things real. So, if I had to give Tony Hawk's Pro Skater 1 + 2 a score, I'd probably say it's... well, that would be telling. But trust me, it's good.<br><br>Now, back to the review. The game is like riding a skateboard on a sunny day - it's smooth, fun, and brings back all those rad memories of the original Tony Hawk games. The levels are lovingly designed, the music is catchy (who doesn't love that iconic soundtrack?), and the gameplay is still timeless.<br><br>Of course, not everyone is perfect. Gaming Age gives it a perfect score (100!) and says it's one of the best remasters available. That's high praise indeed! And Worth Playing agrees, saying it's \"on point\" and that it could've taken even more risks to make it even better.<br><br>Cheat Code Central takes it to the next level by calling it a \"perfect remaster.\" SpazioGames adds that it's both nostalgic and modern at the same time. So, if you're looking for a game that'll take you back in time but still feels fresh and exciting, Tony Hawk's Pro Skater 1 + 2 is the way to go.<br><br>So, there you have it - my groovy review of Tony Hawk's Pro Skater 1 + 2. It's like riding a skateboard on a sunny day, folks!",
    "review-date": "2024-05-26"
  }
}