{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Welcome back to the halfpipe, folks! I'm stoked to dive into Tony Hawk's Pro Skater 1 + 2, the remastered bundle of radicalness that's got everyone from IGN to Cheat Code Central giving it a collective high-five. <br><br>As I strapped on my virtual Vans and hit the streets, I couldn't help but feel like a kid again - the thrill of pulling off sick combos, the rush of mastering tricky levels, and the satisfaction of watching your skater's stats soar. The nostalgia is real, folks! You'll be jamming to those iconic tracks, re-living the good ol' days when Tony Hawk was more than just a game series.<br><br>But before I get too waxed up about the past, let's talk present. These remastered classics hold up remarkably well, with smooth gameplay and visuals that'll make you want to grab your board (or controller) and hit the streets again. The new features, like the challenge system, add a fresh layer of depth without sacrificing the retro charm.<br><br>Now, I know what you're thinking: \"What about the critics?\" Well, let me tell you - even the most jaded reviewers (ahem, Worth Playing) can't help but praise this package for its focus on the original gameplay experience. Yeah, sure, there might be some minor complaints about load times or level goals, but when the skating is this smooth and the music is this sweet, who cares?<br><br>Gaming Age goes so far as to call it \"one of the best remasters available,\" and I'm inclined to agree. The only thing that's not entirely fresh is my memory of the original games - I mean, who didn't spend hours trying to land that one tricky trick or collecting every last skate shop item?<br><br>Tony Hawk's Pro Skater 1 + 2 is a slam dunk (or should I say, a gnarly grind?) that'll have you and your friends shredding the streets like it's 1999 all over again. So grab a friend, pick up this remastered bundle, and get ready to experience the best of both worlds - old-school nostalgia and new-school fun.<br><br>That's it for my review, folks! Hope you enjoyed the ride as much as I did. See you in the next one!",
    "review-date": "2024-05-22"
  }
}