{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - It's your boy Gork here, and I'm back with another rad review! This time, I'm tackling Tony Hawk's Pro Skater 1 + 2, a blast from the past that's got everyone talking. But don't worry, I won't just be rehashing what all the cool kids are saying - I'll add my own brand of humor and maybe even poke some fun at those other critics (just kidding... or am I?).<br><br>First off, let's talk about the elephant in the room: Activision's business strategy. Yeah, it's easy to get cynical when you're trying to revive an old franchise just to make a quick buck. But Tony Hawk's Pro Skater 1 + 2 is actually a love letter to the original games - it's like they took all the good bits from back in the day and sprinkled them with some modern magic.<br><br>Now, I know what you're thinking: \"Gork, this sounds like just another rehashing of old games.\" But trust me, these remasters are more than just a bunch of pixels reworked. They've got that same ol' charm, that same feeling of freedom and creativity that made the originals so addictive. And let's not forget about the music - it's like they raided your old CD collection and brought back all those rad tunes from back in the day.<br><br>But what really sets this game apart is the challenges. I mean, who doesn't love a good challenge? It's like they took every trick and combo from the originals and threw them together in one big, messy bowl of fun. And don't even get me started on the levels - they're like beautifully designed odes to the past (yeah, IGN, I'm looking at you!).<br><br>So, what do I think? Well, let's just say that Tony Hawk's Pro Skater 1 + 2 is the real deal. It's a game that'll transport you back to the good old days of gaming and skateboarding, while still bringing some fresh vibes to the table. And if you don't believe me, just check out what those other critics are saying (I mean, come on, GameSpot - \"playing through the newly remade levels is immensely enjoyable\"? That's not just a review, that's a endorsement!).<br><br>Anyway, that's it for this review - I hope you enjoyed it and aren't too bummed that I didn't include my score. After all, who needs a number when you've got words like \"rad,\" \"gnarly,\" and \"tubular\" to describe just how awesome this game is?",
    "review-date": "2024-05-22"
  }
}