{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -<br><br>Ah, Tony Hawk's Pro Skater 1 + 2: the game that made me want to trade in my gaming keyboard for a skateboard and hit the streets (but let's be real, I'd probably just end up with a face full of concrete). This remaster is like a warm hug from the past, reminding us all why we loved Tony Hawk's Pro Skater in the first place. But how does it hold up today?<br><br>Well, according to some folks (I mean, critics), this game is basically perfect. IGN says it's \"a tremendous turnaround\" and that Activision has finally gotten the series right again after 2015's... let's just say less-than-stellar Tony Hawk's Pro Skater 5. GameSpot agrees, calling it a \"success\" thanks to its engaging challenge system and satisfying combos.<br><br>Gaming Age goes even further, giving it a perfect score and saying it does an excellent job of retaining the spirit of the original PlayStation era classics while adding new features and music. And Worth Playing? Well, they think it's great, but could've taken a few more risks to really make it pop.<br><br>Now, I'm no expert (okay, fine, I am an expert... at being bad at video games), but even I can see that this game has some serious nostalgic appeal going for it. The music is catchy, the levels are lovingly designed odes to the past, and the skating itself feels just as smooth as you remember.<br><br>But here's the thing: what makes Tony Hawk's Pro Skater 1 + 2 so great isn't just its ability to recapture the magic of yesteryear. It's also how it manages to be both a loving throwback to the past and a modern gaming experience in its own right.<br><br>Cheat Code Central puts it best when they say this game is \"perfect\" - it truly feels like a remaster that's been done right, with extra tasks to complete, incentives to keep you coming back for more, and even a great multiplayer option.<br><br>So, should you play Tony Hawk's Pro Skater 1 + 2? Absolutely. But don't just take my word (or the critics) - go out there and experience it for yourself. And if you're like me and end up with a face full of concrete... well, that's just part of the fun!",
    "review-date": "2024-05-17"
  }
}