{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -!<br><br>Ah, Tony Hawk's Pro Skater 1 + 2 - what a blast from the past! As a groovy seasonal reviewer, I'm excited to share my thoughts on this remastered classic.<br><br>First off, let's get the obvious out of the way: these games are a nostalgic treat. Like IGN's critic, I found myself smiling ear-to-ear as I revisited the iconic levels and soundtracks of yesteryear. It's like being reunited with an old childhood buddy - warm, fuzzy feelings abound!<br><br>But Tony Hawk's Pro Skater 1 + 2 is more than just a trip down memory lane. It's also a solid gaming experience in its own right. As GameSpot so astutely pointed out, the remastered levels are incredibly enjoyable to play through, and the addition of new challenges and customization options keeps things fresh.<br><br>Game Informer summed it up best: this game is \"fresh and current\" - a phrase that might have been used to describe my hairdo during the 90s. Kidding aside, it's true! The updated visuals, smooth gameplay, and classic soundtrack all come together to create an experience that feels both nostalgic and modern.<br><br>Now, I know what you're thinking: \"But wait, didn't someone (cough, IGN) give this game a perfect score?\" Ah, yes - Gaming Age did just that. And honestly, it's hard not to agree. The remastering is top-notch, the gameplay is still timeless, and the addition of new features and music only adds to the fun.<br><br>Of course, no review would be complete without some constructive criticism. Worth Playing noted that while the game is fantastic, it might feel a bit too short - something I can attest to myself after getting through all the levels in a single afternoon. Still, there's plenty here to keep you coming back for more (and maybe even trying online multiplayer).<br><br>In conclusion, Tony Hawk's Pro Skater 1 + 2 is an absolute blast. It's a lovingly crafted remaster that retains the spirit and feel of the original games while adding in some modern touches. And who knows - maybe it'll even inspire a new generation of skaters to pick up a board.<br><br>So go ahead, grab your VHS tapes (just kidding, that's not necessary), and get ready to have the time of your life. Hippo Penny out!",
    "review-date": "2024-05-25"
  }
}