{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! Here we go again, reviewing another rad game - Tony Hawk's Pro Skater 1 + 2! You know I love poking fun at other critics' reviews (I mean, who doesn't?), so grab your board and let's get this party started!<br><br>First off, IGN says the game is \"tremendous\" and that it's \"difficult to believe they share even a shred of DNA\" with 2015's Pro Skater 5. Yeah, we won't hold that against them (wink). They praise the accessible yet tricky skating, lovingly designed levels, and music that's like an old childhood buddy (awww).<br><br>GameSpot chimes in, saying it \"nails so much about that original Tony Hawk experience\" and that it's hard to be mad at the game for its downsides. They love the satisfying combos, engaging challenge system, and the fact that playing through the remade levels is enjoyable.<br><br>Game Informer thinks the game makes the experience of playing through these classic titles feel fresh and current with contemporary visuals, smooth gameplay, and an iconic soundtrack. Someone's getting all nostalgic in here!<br><br>Gaming Age gives it a perfect score (100!) saying it's \"one of the best remasters available on the market today.\" They're stoked about the new features, music, and options that propel these two entries into the modern era.<br><br>Worth Playing notes that there's a lot to love in this game, but also mentions that you can clear every stage in a single afternoon (honey, I'm not getting any younger!). They appreciate the challenges, gear, characters, and online multiplayer.<br><br>Last but not least, Cheat Code Central calls it \"perfect\" - yep, they're really loving this remaster! They mention the gorgeous visuals, extra tasks, customization options, stat points, and a great multiplayer option. It's like Tony Hawk's Pro Skater 1+2 is speaking directly to their soul!<br><br>SpazioGames sums it up best: \"Tony Hawk's Pro Skater 1+2 is a title that manages to be incredibly nostalgic, but it's a modern experience at the same time.\" And isn't that what we all want from a remaster - something that brings back those good ol' memories while still feeling fresh?<br><br>Well, that's my review of Tony Hawk's Pro Skater 1 + 2 in a nutshell (or should I say, a skateboarding trick?). It's a rad game that'll have you stoked, so grab your board and get ready to shred!",
    "review-date": "2024-05-15"
  }
}