{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your old pal back with another review, and this one's all about Tony Hawk's Pro Skater 1 + 2. Now, I know what you're thinking - isn't this just a rehash of the same ol' skateboarding game? Well, let me tell you, it's not just that. It's like riding a board down memory lane, but with better graphics and more combos.<br><br>The first thing that struck me was how seamless the remastering process was. You'd think it would be hard to take two classic games from 20 years ago and make them feel fresh again, but Vicarious Visions did just that. The levels look gorgeous, the gameplay is silky smooth, and the soundtrack is a blast from the past (in the best way possible).<br><br>Now, I know some of my colleagues out there might be saying things like \"Oh, it's just a rehash\" or \"It's too nostalgic.\" But let me tell you, folks, this game has got some serious charm. The level design is lovingly crafted to be an ode to the past, and the challenges are fun without being too grindy.<br><br>And then there's the multiplayer - oh boy, the multiplayer. It's like having a virtual skate park right in your living room (or wherever you play games these days). You can grab some friends and have a blast competing against each other or co-oping up a storm.<br><br>Now, I know some of our esteemed colleagues over at IGN might be saying it's impossible to be cynical about this game. And honestly? They're right. It's just that good. GameSpot says the same thing - that this game is more than just a rehash, it's an experience. And I'm inclined to agree.<br><br>But let me get back to my own thoughts here (because who doesn't love hearing from themselves?). The real magic of this game is how it makes you feel. It's like walking into your old bedroom and seeing all the things that made you happy in one place again. You can't help but smile when you're playing this game.<br><br>And don't even get me started on the soundtrack - I mean, come on, who doesn't love a good ol' fashioned skateboarding jam session? It's like having your own personal Tony Hawk concert (minus the risk of injury, of course).<br><br>So there you have it - my two cents on Tony Hawk's Pro Skater 1 + 2. If you're looking for a game that'll take you back to the good ol' days, but with some serious modern flair, this is the one. Trust me, hippo fans out there - you won't regret giving this one a spin.",
    "review-date": "2024-05-31"
  }
}