{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! Welcome back to the world of gaming where nostalgia reigns supreme and I get to poke fun at myself (and other critics). Today, we're diving into the wonderful world of Tony Hawk's Pro Skater 1 + 2, a remastered blast from the past that has everyone raving. Like, seriously raving.<br><br>But before we get to the goods, let's take a trip down memory lane and revisit what our friends at IGN had to say: \"Tony Hawk's Pro Skater 1 + 2 is such a tremendous turnaround... it's difficult to believe they share even a shred of DNA with the disastrous Tony Hawk's Pro Skater 5.\" Yeah, I can see why Activision would want to erase that memory from their collective conscience. I mean, who wouldn't?<br><br>Now, let's talk about what makes this game so special. The critics are unanimous in their praise for the smooth gameplay, beautiful visuals, and iconic soundtrack (because what's a Tony Hawk game without some sick tunes?). But more than just a nostalgic trip down memory lane, Tony Hawk's Pro Skater 1 + 2 has also got some smart additions to keep things fresh.<br><br>GameSpot notes that \"the lack of level goals for every skater isn't enough to keep you from jumping back in with a new character,\" and I couldn't agree more. The game still feels like the classic Tony Hawk experience, but with just enough newness to keep things exciting.<br><br>But what really sets this game apart is its ability to balance nostalgia with modernity. Game Informer puts it best: \"The Tony Hawk's Pro Skater franchise may once again have a bright future thanks to this terrific blast from the past.\" And that's exactly what makes this game so great – it's not just a rehashing of old ideas, but a genuine attempt to bring something new to the table.<br><br>Now, I know what you're thinking: \"But [Your Name], what about the downsides?\" Well, let me tell you, folks, there are some minor complaints to be had. Worth Playing notes that the game could've taken more risks, and while it's not a major issue, it's definitely something worth considering.<br><br>However, when everything else is this well-done, it's hard to be too mad about it. I mean, who wouldn't want to play a game that feels like a perfect remaster? Cheat Code Central puts it best: \"Tony Hawk's Pro Skater 1+2 is a perfect remaster... it's better.\" And let me tell you, folks, if the reviews are anything to go by, this game is definitely worth checking out.<br><br>So there you have it – my take on Tony Hawk's Pro Skater 1 + 2. It's a game that's all about balance: balancing nostalgia with modernity, and finding that perfect blend of old and new. And if the reviews are anything to go by, it's a game that's definitely worth playing.<br><br>Hippo out!",
    "review-date": "2024-06-06"
  }
}