{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your old pal, back with another review that's sure to make you laugh and maybe even inspire you to pick up a controller.<br><br>Tony Hawk's Pro Skater 1 + 2 is a game that's got everyone talking - including the critics. And let me tell you, they're not wrong. This remastered edition of the classic PlayStation games is pure gold (or should I say, pure bird?).<br><br>First off, let me give props to IGN for their review: \"Tony Hawk's Pro Skater 1 + 2 is such a tremendous turnaround from 2015's disastrously dismal Tony Hawk's Pro Skater 5 that it's difficult to believe they share even a shred of DNA.\" Preach, brother!<br><br>GameSpot agrees, saying that the game \"nails so much about that original Tony Hawk experience.\" And who can blame them? The game is chock-full of retro charm, with levels that are lovingly designed odes to the past. You'll be reminiscing about the good ol' days (or if you're a younger player, learning what all the fuss was about back in the day).<br><br>But don't just take my word for it - check out Game Informer's review: \"Tony Hawk's Pro Skater 1 and 2 makes the experience of playing through these games again feel fresh and current.\" Fresh? Current? More like retro-tastic and totally tubular!<br><br>And then there's Gaming Age, with their glowing praise: \"Tony Hawk Pro Skater 1 and 2 is easily one of the best remasters available on the market today... The gameplay is still timeless...\" Yeah, yeah, we get it - the game is awesome. (But seriously, how can you go wrong with a game that's got the name Tony Hawk attached to it?)<br><br>Worth Playing has some minor gripes, but even they can't deny the game's charm: \"It has trimmed most of the fat that's typical of these projects and unapologetically focused on its original core experience...\" Core experience? More like core-llaborative experience! (Sorry, I had to.)<br><br>And finally, Cheat Code Central is just plain gushing: \"Tony Hawk's Pro Skater 1+2 is a perfect remaster. It feels the way you expect the game to and has everything I loved about these two games.\" Ah, yes - even the critics agree that this game is the bee's knees (or should I say, the skate's wheels?).<br><br>All in all, Tony Hawk's Pro Skater 1 + 2 is a game that'll have you ollie-ing with joy. So what are you waiting for? Grab your board and get ready to shred!",
    "review-date": "2024-05-29"
  }
}