{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your favorite groovy gaming critic here to dish out the lowdown on Tony Hawk's Pro Skater 1 + 2. Now, I know what you're thinking: \"Why should I care about a game that's old enough to be considered retro?\" Well, my curious reader, let me tell you - this remastered gem is so much fun, it'll have you feeling like a radical skater dude from the '90s!<br><br>First off, IGN gave this game a 90/100 and said it was \"old-school fun\" with \"lovingly designed odes to the past.\" Yeah, I totally agree! The gameplay is as smooth as a freshly waxed skateboard (okay, maybe not that smooth, but you get the idea). It's easy to pick up, yet challenging enough to keep you coming back for more.<br><br>GameSpot echoed these sentiments, calling it \"immensely enjoyable\" and praising its \"satisfying combos.\" I mean, who doesn't love the feeling of pulling off a sweet 360 flip and earning those sweet, sweet points?<br><br>Now, some critics might say that Tony Hawk's Pro Skater 1 + 2 is just a rehashing of the same old gameplay. But hey, sometimes going back in time can be just what you need! Game Informer summed it up perfectly: \"The experience of playing through these games again feels fresh and current.\" And who doesn't love reliving those nostalgic gaming moments?<br><br>Of course, not everyone is entirely sold on this remaster. Worth Playing gave it a 90/100, but noted that there's \"not much new\" to the game. Ouch! But let's be real - sometimes less is more, especially when you're talking about a classic like Tony Hawk's Pro Skater.<br><br>Cheat Code Central took it to the next level (pun intended), giving it a perfect 98/100 and saying it's \"a perfect remaster.\" I mean, who doesn't love perfection? And SpazioGames summed it up nicely: \"It's a title that manages to be incredibly nostalgic, but it's also a modern experience at the same time.\"<br><br>In conclusion, Tony Hawk's Pro Skater 1 + 2 is a rad game that'll have you feeling like a totally tubular skater dude (or dudette). So grab your board and get ready to ride the nostalgia train!",
    "review-date": "2024-05-20"
  }
}