{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - and welcome to my review of Tony Hawk's Pro Skater 1 + 2! *adjusts hippos*<br><br>First off, let me just say that I'm having a blast (pun intended) playing this game. It's like stepping back into the '90s and experiencing the thrill of skateboarding all over again - but with fancy new graphics and modern features to boot!<br><br>Now, I know what you're thinking: \"Isn't this just a rehashing of old games?\" Well, my friends, let me tell you - these critics know their stuff! *winks at IGN and GameSpot* They've been praising Tony Hawk's Pro Skater 1 + 2 for its nostalgic value, yet also acknowledging that it's not just a lazy cash-grab. It's a genuine attempt to recapture the magic of the original games.<br><br>Game Informer puts it best: \"Tony Hawk's Pro Skater 1 and 2 makes the experience of playing through these games again feel fresh and current.\" That's what I'm talking about! This game takes the best parts of the past and updates them for a new generation of gamers. And let me tell you, those combos are still ridiculously satisfying to pull off!<br><br>Of course, not everyone is entirely convinced. Worth Playing notes that while the game is great, it could have taken more risks to really shake things up. I get what they mean - after all, we're talking about a game that's essentially two remasters in one package! But honestly, who doesn't love a good ol' fashioned skate session?<br><br>Cheat Code Central, on the other hand, is absolutely swooning over this title: \"It feels the way you expect the game to and has everything I loved about these two games.\" That's what I call a glowing endorsement!<br><br>So, what's my take? Well, as Hippo Penny, I have to say that I'm having an absolute blast playing Tony Hawk's Pro Skater 1 + 2. It's a love letter to the original games, with just enough new bells and whistles to keep things interesting.<br><br>SpazioGames sums it up nicely: \"Tony Hawk's Pro Skater 1+2 is a title that manages to be incredibly nostalgic, but it's a modern experience at the same time.\" That's exactly what I'm looking for in a game - a perfect blend of old-school charm and new-age appeal.<br><br>So if you're a fan of the Tony Hawk series or just looking for some fun skateboarding action, give Tony Hawk's Pro Skater 1 + 2 a try. Trust me, it'll be a groovy time!",
    "review-date": "2024-05-16"
  }
}