{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -! Welcome back to the land of radical video games, folks!<br><br>Get ready to shred, grab, and manual your way through Tony Hawk's Pro Skater 1 + 2 (THPS1+2), a remastered delight that's got the critics going wild. I mean, who wouldn't want to relive the good ol' days of skateboarding, nostalgia, and rad music?<br><br>IGN is having the time of their lives, calling it \"a tremendous turnaround\" from the previous installments, praising the game for its accessible yet tricky skating, lovingly designed levels, and a soundtrack that's like an old childhood buddy. Cynicism aside, they're stoked to be playing with a blast from the past.<br><br>GameSpot is also on board, saying it \"nails so much about that original Tony Hawk experience.\" They're not too worried about the load times or lack of level goals, because let's face it - satisfying combos and an engaging challenge system are what truly matter. It's an experience that's more than just a brief skate through Tony Hawk's past.<br><br>Game Informer is all about nostalgia, declaring THPS1+2 \"a terrific blast from the past.\" They're thrilled to see the franchise get a modern makeover with contemporary visuals, smooth gameplay, and an iconic soundtrack that's sure to bring back memories.<br><br>Gaming Age is giving it a perfect 100, stating it's one of the best remasters on the market. They love how it retains the spirit and feel of the PS era classics while adding new features, music, and options. It's like a time capsule, but with better graphics and more to do!<br><br>Worth Playing is being a bit more critical, saying it could've taken a few more risks. But hey, when everything else works nicely - what's not to love? The game runs great, looks rad, and plays even better.<br><br>Cheat Code Central is basically drooling all over the place, calling THPS1+2 \"a perfect remaster.\" They love the extra tasks in original levels, multiplayer options, and incentives to keep exploring. It's a modern experience that feels like it should've been this good in the first place!<br><br>SpazioGames agrees, saying THPS1+2 is both incredibly nostalgic and a modern experience at the same time. Who wouldn't want that?<br><br>In conclusion - if you're a fan of skateboarding, nostalgia, or just great gaming experiences, Tony Hawk's Pro Skater 1 + 2 (THPS1+2) is an absolute must-play. So grab your board, get ready to shred, and experience the thrill of radical gaming!<br><br>(Note: I didn't include my own score in this review, because who needs it?)",
    "review-date": "2024-05-18"
  }
}