{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Get ready for some radical fun with Tony Hawk's Pro Skater 1 + 2!<br><br>As I booted up this remastered classic, I couldn't help but think of those old-school skate parks where the only thing more plentiful than the concrete was the attitude. And you know what? This game still captures that same essence - with a side of modern polish.<br><br>But let's get to the critics, shall we? IGN praises the game for being \"earnest and old-school fun,\" while GameSpot gushes over the \"satisfying combos\" and \"engaging challenge system.\" Game Informer simply says it's a \"blast from the past\" that still feels fresh. And I'm just happy to be here, bro.<br><br>Now, I know what you're thinking - is this just a rehash of old games? Not quite. Vicarious Visions has done an amazing job of bringing these classics up to speed with modern visuals and controls. It's like putting on a pair of fresh Vans - comfortable, familiar, and ready for some serious shredding.<br><br>Of course, there are some downsides. Worth Playing notes that the game is a bit short, and you can clear everything in one afternoon (but let's be real, who doesn't love an excuse to spend more time playing games?). And while I appreciate the addition of online multiplayer, it's not without its quirks.<br><br>But overall, this remaster has won me over. It's like riding a bike - once you get back on the board, you'll never want to get off again. With over 700 Challenges to complete and plenty of customization options, there's more than enough content to keep you busy (and maybe even learn some new tricks).<br><br>So, what are you waiting for? Grab your board, don your favorite band tee, and get ready to catch some air with Tony Hawk's Pro Skater 1 + 2. It's a radical ride that's sure to bring back some serious nostalgia - and maybe even introduce the next generation of skaters to this iconic series.<br><br>Now, if you'll excuse me, I have some combos to perfect...",
    "review-date": "2024-05-23"
  }
}