{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! Here's my take on Tony Hawk's Pro Skater 1 + 2. I've got some beef with IGN for thinking Activision's sudden love for re-releasing old games is a great thing. I mean, come on, Tony Hawk's Pro Skater 5 was basically the gaming equivalent of a participation trophy - all flash, no substance. But this remastered version? It's like they took that 2015 disaster and said, \"Hey, let's go back to the good old days!\"<br><br>The gameplay is still as rad as ever, with those sweet, sweet combos waiting to be pulled off. And don't even get me started on the levels - lovingly designed odes to the past? More like lovingly recreated masterpieces that'll transport you right back to the PlayStation era.<br><br>Now, I know what you're thinking: \"But [Critic], what about the downsides?\" Ah, yeah, those. GameSpot's got it right when they say the load times aren't enough to keep you away from all the satisfying combos and challenges. And let's be real, who needs level goals for every skater when you can just play as a new character and have at it?<br><br>Game Informer gets it spot on too - this remastered version feels fresh and current, like a blast from the past that's been upgraded with modern flair. The visuals are top-notch, the gameplay is smooth, and that iconic soundtrack will have you tapping your toes (or should I say, your skateboarding shoes?).<br><br>Gaming Age takes it to the next level by saying this remastered version is one of the best out there - it retains the spirit and feel of the classics while adding new features and music. And let's not forget that sweet, sweet online multiplayer.<br><br>Worth Playing's got some gripes about how there isn't much to do once you've cleared all the stages (besides trying again with a new character, which is totally fine), but overall, they're right - this game does an excellent job of trimming the fat and focusing on its original core experience.<br><br>Cheat Code Central takes it to the max by saying it's a perfect remaster. I mean, who wouldn't want to relive those classic levels with extra tasks and incentives to keep you coming back for more? And that multiplayer option? Yeah, it's a real treat.<br><br>SpazioGames sums it up best: Tony Hawk's Pro Skater 1+2 is both incredibly nostalgic and a modern experience at the same time. So what are you waiting for? Grab your board, fire up this remastered classic, and get ready to relive some serious skateboarding stoke!",
    "review-date": "2024-05-30"
  }
}