{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny!<br><br>I'm back with another review of Tony Hawk's Pro Skater 1 + 2, because who doesn't love a good ol' skate fest? I mean, IGN thinks it's a \"tremendous turnaround\" from the previous disaster, and GameSpot says it nails the original experience. Yeah, yeah, yeah... let's get to the good stuff!<br><br>The game is a blast (pun intended)! The controls are silky smooth, the levels are lovingly designed, and the music is like a warm hug for your eardrums. I mean, what more could you ask for in a skateboarding game? Oh, and did I mention that the graphics look amazing? Yeah, it's like having a virtual Tony Hawk poster on your wall (minus the possibility of getting splattered with bird poop).<br><br>Now, some critics might say that the game is just too easy or that there aren't enough level goals. But honestly, who doesn't love a good combo fest? And besides, the lack of level goals only encourages you to try new things and experiment with different tricks.<br><br>I do agree with Game Informer that this remaster feels fresh and current, despite being an old-school classic. The challenge system is engaging, and the multiplayer option is a nice addition (even if I didn't get too far in it).<br><br>Gaming Age thinks this remaster does an excellent job of retaining the spirit of the originals while adding new features and music. And, honestly, I think they're right on the money! It's like Activision and Vicarious Visions took all our favorite memories from the old games and polished them up to perfection.<br><br>Now, some folks might say that this game is a bit light on content or that there aren't enough new features to justify the price. But honestly, I think it's a small price to pay for such an amazing remaster. And besides, who doesn't love re-experiencing their childhood favorites?<br><br>So, what's the verdict? Well, let's just say that Tony Hawk's Pro Skater 1 + 2 is a title that will make you wanna grab your board and hit the pavement (or at least, play it for hours on end).<br><br>That's all for now! If you're ready to relive some skateboarding magic or experience it for the first time, then this remaster is definitely worth checking out!",
    "review-date": "2024-06-09"
  }
}