{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -<br><br>Get ready to kickflip your way back to the '90s with Tony Hawk's Pro Skater 1 + 2! Vicarious Visions has done an amazing job of taking two classic games and giving them a fresh new coat of paint. I mean, who wouldn't want to relive those radical days of skating, scoring points, and trying not to get flattened by the pavement?<br><br>I'm sure some critics are already saying, \"But what about Tony Hawk's Pro Skater 5? Ugh, don't even get me started!\" And honestly, I can understand their frustration. But let's be real, folks - this is a whole different ball game (or should I say, half-pipe?). The nostalgia factor is through the roof here, and it's not just because of the radical music or the über-cool graphics. No way, it's because the gameplay has been tweaked to perfection, making it feel like you're reliving those carefree skateboarding days.<br><br>Now, I know some of you might be thinking, \"But what about the load times? Are they as long as my attention span?\" And honestly, they're not too bad. You'll get used to them in no time. Besides, who needs load times when you've got sick tricks and combos to bust out?<br><br>The real magic happens when you jump into online multiplayer mode. I mean, where else can you team up with your pals, form some epic skate crews, and try to take down the competition? It's like reliving those sleepovers at your BFF's house, minus the awkward moments of trying to get a glimpse of their cat's whiskers.<br><br>Of course, no review would be complete without a nod to our esteemed critics. IGN gave it 90/100, praising its old-school charm and \"earnest and old-school fun.\" GameSpot agreed, saying it's \"a tremendous turnaround from 2015's...disastrously dismal Tony Hawk's Pro Skater 5.\" And let's not forget the glowing review from Gaming Age - they gave it a perfect score (100/100), calling it one of the best remasters out there. <br><br>So if you're looking for a blast from the past, or just want to experience some radical skateboarding action, Tony Hawk's Pro Skater 1 + 2 is the game for you!",
    "review-date": "2024-04-25"
  }
}