{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! Get ready for some radical reviews of Tony Hawk’s Pro Skater 1 + 2!<br><br>As I dove into this groovy remaster, I couldn’t help but feel like a kid again, re-experiencing the thrill of shredding gnarly rails and performing sweet tricks. But before I get too stoked, let me give you the lowdown from some of the top critics in the business.<br><br>IGN: \"This is such a tremendous turnaround from 2015's disastrously dismal Tony Hawk’s Pro Skater 5 that it’s difficult to believe they share even a shred of DNA.\" - Okay, so maybe I'm being a little harsh on THPS5, but who doesn't love a good ol' school comeback story?<br><br>GameSpot: \"Because it nails so much about that original Tony Hawk experience, it's really hard to be mad at Pro Skater 1 + 2 for any of its downsides.\" - Agreed! When something's this close to the original, it's hard not to love.<br><br>Game Informer: \"Tony Hawk’s Pro Skater 1 and 2 makes the experience of playing through these games again feel fresh and current.\" - Fresh and current? Sounds like a sweet combo to me!<br><br>Gaming Age: \"Tony Hawk Pro Skater 1 and 2 is easily one of the best remasters available on the market today...\" - High praise indeed! When remasters get it right, they can be pure magic.<br><br>Worth Playing: \"It has trimmed most of the fat that's typical of these projects and unapologetically focused on its original core experience, and the results are all the better for it.\" - Less is more, I always say!<br><br>Cheat Code Central: \"Tony Hawk’s Pro Skater 1+2 is a perfect remaster. It feels the way you expect the game to...\" - Perfect? That's some serious flattery right there! Who wouldn't want their game to be considered perfect?<br><br>SpazioGames: \"Tony Hawk's Pro Skater 1+2 is a title that manages to be incredibly nostalgic, but it's a modern experience at the same time.\" - Nostalgic and new? What more could you ask for?<br><br>And there you have it – a rad review roundup from some of the most tubular critics out there! Tony Hawk’s Pro Skater 1 + 2 is an absolute blast to play, and whether you're a seasoned pro or a new-school shredder, this game's got something for everyone. So grab your board and get ready to ride the rails – it's time to get your skate on!",
    "review-date": "2024-05-29"
  }
}