{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -! It's your boy Grok here, and I'm pumped to share my review of Tony Hawk's Pro Skater 1 + 2. Now, I know what you're thinking: \"Grok, why should I care about some old skateboarding game?\" Well, let me tell you - this remastered duo is a blast from the past that'll have you feeling like a rad skater again.<br><br>First off, the gameplay is still as smooth as ever. You can feel the nostalgia wash over you as you ollie and kickflip your way through iconic levels from yesteryear. The controls are tight, the animations are sick (pun intended), and the soundtrack? Absolutely tubular!<br><br>Now, I know some of you critics out there might be saying things like, \"Grok, why did Activision even bother with this remaster?\" Well, let me tell you - it's because they listened to our collective nostalgia cravings. They took the best bits from the originals and gave 'em a modern coat of paint, making them shine brighter than ever.<br><br>And don't even get me started on the challenges! You've got level goals for each skater, combos to master, and online multiplayer to shred with your friends. It's like Tony Hawk himself said: \"The goal is to have fun, but the more you play, the better you'll be!\"<br><br>Now, I'm not gonna lie - some of these reviewers might be a tad too harsh on the game. I mean, come on, IGN, \"it's difficult to believe they share even a shred of DNA\" with that abomination Pro Skater 5? Please, Tony Hawk's Pro Skater 1 + 2 is the antithesis of that disaster!<br><br>GameSpot might say there are some downsides, but I'd argue those minor quibbles don't detract from the overall experience. And as for Game Informer, well - let me tell you, when they say this game feels fresh and current, they ain't lying! It's like a time capsule of radness!<br><br>So, what's my verdict? Well, I'll leave it to the pros (or rather, the critics): IGN says 90, GameSpot says 90, Game Informer says 88... Heck, even Gaming Age gives it a perfect score! And as for me? Let's just say Hippo Penny - is all you need!<br><br>In conclusion, Tony Hawk's Pro Skater 1 + 2 is an absolute must-play for anyone who grew up with these classics or is looking to experience the magic of skateboarding for the first time. Trust your boy Grok - it's a game that'll make you feel like a rad skater again!",
    "review-date": "2024-06-08"
  }
}