{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your friendly neighborhood grok here, and I'm thrilled to dive into the world of Tony Hawk's Pro Skater 1 + 2. As I skate my way through this remastered gem, I'll be poking fun at myself, other critics, and maybe even Activision for good measure.<br><br>First off, let's talk about just how far we've come since Tony Hawk's Pro Skater 5. *shudder* I mean, it's like comparing a rusty old skateboard to a sleek new ride – one's gonna leave you feeling like a pro, while the other'll have you face-planting into a puddle of despair.<br><br>But seriously, this game is a love letter to the past, and I'm not just saying that because my nostalgic goggles are firmly in place. The levels are lovingly designed odes to yesteryear, the music is like a warm hug from an old childhood friend, and the skating – oh boy, the skating! It's as if Tony Hawk himself has taken up residence inside your controller, guiding you through combos that'll have you screaming \"Hoooo-ah!\" like a madman.<br><br>Now, I know what you're thinking: \"But wait, isn't this just a rehashing of old content?\" To which I say: \"Ah, but it's not just any old content!\" It's been lovingly remastered for the modern era, with all the bells and whistles that make it feel fresh and current. And let's be real, who doesn't love a good blast from the past? <br><br>Of course, some critics (cough, cough) might say that this game is just too focused on its original core experience, without taking enough risks or innovating new features. But honestly, I think that's like complaining about too much awesome in a video game. It's not a problem; it's a blessing!<br><br>In conclusion, Tony Hawk's Pro Skater 1 + 2 is a must-play for any fan of the series, old or new. It's a love letter to the past, wrapped in a modern package that'll have you shredding gnarly combos and grinning from ear to ear.<br><br>And if you don't believe me, just ask IGN: \"It's pretty easy to be cynical about how rapidly selling us our favourite games again became a central pillar of Activision's business strategy, but when it's this much fun I'm finding it impossible to be sour about it.\" Same here, friends!",
    "review-date": "2024-05-17"
  }
}