{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! I'm back with another review that's sure to make you laugh and want to grab your skateboard (or controller, whichever floats your board).<br><br>Tony Hawk's Pro Skater 1 + 2 - the perfect combination of nostalgia and awesomeness. I mean, who doesn't love a good ol' fashioned skateboarding game? And when it's done right, like this remaster is, you can bet your board it's gonna be a blast.<br><br>Now, I know what you're thinking: \"What about all the other critics out there?\" Well, let me tell you, they're all on point (pun intended). IGN, GameSpot, and even those fancy folks at Gaming Age - everyone agrees that this remaster is a total win. And for good reason! The levels look gorgeous, the music is rad, and the gameplay is just as smooth as Tony Hawk's hair (if he had any).<br><br>But what really sets this game apart is its ability to balance nostalgia with modern flair. You get all the classic levels, skaters, and songs you loved back in the day, but with a fresh coat of paint and some sweet new features to boot. It's like getting an old friend's update - they're still the same awesome person, but now they have better hair and a cooler phone.<br><br>Of course, no game is perfect, and Tony Hawk's Pro Skater 1 + 2 has its downsides (like the occasional load time hiccup). But overall, it's a slam dunk (see what I did there?). It's a blast from the past that feels fresh and current, with plenty of reasons to keep coming back for more.<br><br>So, if you're looking for a game that's guaranteed to bring the nostalgia, but with enough new tricks to keep things interesting - look no further than Tony Hawk's Pro Skater 1 + 2. It's a must-play for any fan of the series, and even if you're not a die-hard skateboarding enthusiast, it's still a whole lotta fun.<br><br>That's my two cents (or should I say, that's my \"skate\" cents?). Agree or disagree - let me know in the comments!",
    "review-date": "2024-05-16"
  }
}