{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your boy reviewing Tony Hawk's Pro Skater 1 + 2 - and let me tell you, I'm stoked to be diving back into this classic combo!<br><br>First off, I gotta give props to Vicarious Visions for bringing these retro rad games into the modern era. The visuals are straight fire, with those iconic levels looking like they just stepped out of a time capsule from the late '90s (in the best way possible). And, oh man, the music? It's like a warm hug from your childhood - all those sick jams that made you wanna grab your board and hit the streets.<br><br>Now, I know what you're thinking: \"But what about the gameplay?\" Well, let me tell you, it's still as tight as ever! The controls are smooth, the combos are satisfying, and those challenges? Forget about it - they'll keep you coming back for more. And don't even get me started on the online multiplayer... it's like a digital skate fest up in here!<br><br>Now, I know some critics (cough, IGN, cough) might be all about the nostalgia trip, but let me tell you, this game is more than just a blast from the past. It's a modern masterpiece that'll have you shredding and grinding for hours on end.<br><br>And hey, speaking of critics... what do we got here? Oh yeah, those fancy-schmancy review scores! Let me just grab my magnifying glass and take a gander:<br><br>* IGN: 90/100<br>* GameSpot: 90/100<br>* Game Informer: 88/100<br>* Gaming Age: 100/100 (yep, they gave it a perfect score!)<br>* Worth Playing: 90/100<br>* Cheat Code Central: 98/100<br>* SpazioGames: 90/100<br><br>So, what's the verdict? It looks like this game is basically universally loved! And honestly, I'm not surprised. Tony Hawk's Pro Skater 1 + 2 is a masterclass in remastering - it takes the best parts of those classic games and updates them for modern audiences.<br><br>Anyway, that's my two cents on Tony Hawk's Pro Skater 1 + 2. If you're looking for a game that'll transport you back to the '90s while still delivering a rad gaming experience today, look no further!",
    "review-date": "2024-06-05"
  }
}