{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your boy, back with another review that'll make you wanna grab your board and hit the streets (or rather, the skate park)! This time around, I'm tackling Tony Hawk's Pro Skater 1 + 2, a game that's all about going back to the good ol' days. And let me tell you, these remasters are more than just a trip down memory lane - they're a fresh take on a classic.<br><br>Now, before we get into the nitty-gritty of the review, I have to say: it's been a while since I've had so much fun playing a game that wasn't trying to reinvent the wheel (or in this case, the skateboard). Tony Hawk's Pro Skater 1 + 2 is a masterclass in nostalgia, with remastered graphics, timeless gameplay, and a soundtrack that'll have you singing along like it's the year 2000.<br><br>But don't just take my word for it - even the most skeptical critics are singing the same tune. IGN says it's \"such a tremendous turnaround from 2015's disastrously dismal Tony Hawk's Pro Skater 5\" (ouch!), while GameSpot notes that \"it nails so much about that original Tony Hawk experience.\" Even the usually-cynical Worth Playing can't help but gush, saying it's \"on point: challenges, gear, more characters, and online multiplayer.\"<br><br>Now, I know what you're thinking: is this just a lazy cash-grab, rehashing old ideas with new graphics? Far from it. The developers at Vicarious Visions have done an amazing job of updating the originals for modern audiences, while still retaining that old-school charm. And let's not forget - it's 2020, and we've got the power of nostalgia on our side! <br><br>Of course, no game is perfect (except maybe the original Super Mario Bros.). Some critics have noted that the load times can be a bit lengthy, but honestly? That's a small price to pay for the joy of reliving your childhood skateboarding fantasies.<br><br>So what's my verdict? Well, I'll leave it up to you - are you ready to grab your board and ride the wave (pun intended)? Trust me when I say that Tony Hawk's Pro Skater 1 + 2 is a blast from the past that's sure to delight even the most jaded gamers. And if you're not convinced yet? Well, maybe IGN's summary says it best: \"It turns out going backwards has been the best step forward Activision has taken with the Tony Hawk series in nearly 15 years.\" Who knew going retro could be so rad?!",
    "review-date": "2024-06-02"
  }
}