{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your old pal, back with another review of Tony Hawk's Pro Skater 1 + 2. I know what you're thinking - why should I care about some old skateboarding game? Well, let me tell you, this one's different. Like, really different.<br><br>First off, the game looks great. Not just great, but actually kind of... stunning. It's like they took all the original levels and gave them a fancy new makeover. You know, like if your grandma got a facelift. Okay, maybe that's not exactly the best analogy, but you get the idea.<br><br>Now, let's talk about gameplay. Oh boy, it's still got that old-school magic. You can feel the nostalgia flowing through every trick, every combo, every... well, every thing. It's like they bottled up all the fun and excitement from back in the day and poured it directly into this remastered version.<br><br>Of course, there are some downsides. Like, have you tried to load the game? It's slow, folks! Slow like a snail on valium. But hey, who doesn't love a good loading screen, right?<br><br>In all seriousness, though, Tony Hawk's Pro Skater 1 + 2 is an absolute blast. Even critics as tough as IGN and GameSpot can't help but gush about how much fun it is. I mean, take this from IGN: \"It's really hard to be mad at Pro Skater 1+2 for any of its downsides.\" Same here! Who needs downsides when you're having that much fun?<br><br>But don't just take my word for it (or IGN's). Check out what the other critics have to say:<br><br>* Game Informer: \"Tony Hawk's Pro Skater 1 and 2 makes the experience of playing through these games again feel fresh and current.\"<br>* Gaming Age: \"Easily one of the best remasters available on the market today...\"<br>* Worth Playing: \"It has trimmed most of the fat that's typical of these projects and unapologetically focused on its original core experience, and the results are all the better for it.\"<br><br>You get the idea. The critics (okay, maybe not Cheat Code Central... 100%? Come on) are having a blast with Tony Hawk's Pro Skater 1 + 2. So should you!",
    "review-date": "2024-05-09"
  }
}