{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny, folks! It's your boy, back with another groovy review that's sure to get you stoked!<br><br>Tony Hawk's Pro Skater 1 + 2 has been making waves in the gaming world, and for good reason. These classic games have been revamped, modernized, and brought back to life like a phoenix rising from the ashes (or should I say, from the halfpipe?). <br><br>Now, you might be thinking, \"What's the big deal? It's just an old game with new graphics.\" Ah, but no! This is where the magic happens. The folks at Vicarious Visions have done an incredible job of not only updating the visuals and gameplay mechanics but also capturing that same ol' school vibe that made us fall in love with these games back in the day.<br><br>IGN says it best: \"It's difficult to believe they share even a shred of DNA\" with Tony Hawk's Pro Skater 5. And honestly, I'm just glad we can put that trainwreck behind us and focus on the good stuff! The accessible yet tricky skating, lovingly designed levels, and music that'll make you feel all warm inside – it's like having an old friend back, minus the drama.<br><br>GameSpot agrees, saying it nails so much about that original Tony Hawk experience. And let's be real, who doesn't love a good blast from the past? The load times might not be perfect, and some critics might say there's room for improvement (see: Worth Playing), but honestly, when it's this much fun, can you really complain?<br><br>I mean, what more could we ask for? New levels to explore, new challenges to conquer, and even online multiplayer! It's like the developers took all our favorite memories from the 90s and early 2000s and threw them back together with a dash of modern flair. <br><br>So if you're feeling nostalgic or just looking for a fun game to play, Tony Hawk's Pro Skater 1 + 2 is the perfect choice. And who knows? You might even learn some new tricks!<br><br>Now, go forth and shred those rails, my friends!",
    "review-date": "2024-05-19"
  }
}