{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - and welcome back to the world of radical skateboarding! I'm stoked to dive into Tony Hawk's Pro Skater 1 + 2, a remastered blast from the past that's got everyone feeling like they're hangin' loose.<br><br>First off, let me just say that it's amazing to see how far the series has come. From the disastrous Pro Skater 5 to this triumphant return to form, Activision and Vicarious Visions have done an incredible job of capturing the spirit of the original games while still offering something new and exciting for fans both old and new.<br><br>But enough about the past - let's talk about the gameplay! The accessible yet tricky skating is still as addictive as ever, and the newly remade levels are a treat to explore. I mean, who doesn't love revisiting the likes of School, Mall, and Warehouse with a fresh coat of paint and some contemporary flair?<br><br>Now, I know what you're thinking - \"What about the downsides?\" And yeah, there are a few minor gripes here and there (load times, lack of level goals for every skater, etc.). But honestly, who cares when the experience is just so darn enjoyable? The load times aren't enough to keep me away from the plethora of satisfying combos, and the lack of level goals isn't enough to keep me from jumping back in with a new character.<br><br>Of course, there are some smart additions and an engaging challenge system that make this remaster even more than just a brief skate through Tony Hawk's past. I mean, who doesn't love the thrill of trying to complete every challenge, unlock new customization options, or get stat points?<br><br>Now, I know some of you might be thinking, \"But what about [insert critic name here]? They gave it a score of X out of Y!\" And yeah, I've seen those reviews too. IGN loved it, GameSpot loved it, even the usually cynical critics at Worth Playing were impressed.<br><br>So if you're looking for a game that's just plain fun, Tony Hawk's Pro Skater 1 + 2 is definitely worth checking out. It might not be perfect (what is, right?), but it's a title that manages to be incredibly nostalgic while still offering something new and exciting. And hey, even the usually tough critics at Gaming Age were impressed with its \"timeless\" gameplay.<br><br>So there you have it - my take on Tony Hawk's Pro Skater 1 + 2. It's not just a remaster of two classic games; it's a love letter to the series and a great way for new fans to get in on the action. And who knows? Maybe this is the start of something big for the Tony Hawk franchise...",
    "review-date": "2024-05-10"
  }
}