{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! <br><br>Get ready to skate like it's 1999 all over again, because Tony Hawk's Pro Skater 1 + 2 is back and better than ever! The latest remasters of the classic PlayStation era games are a love letter to old-school gamers like me. I mean, who didn't spend hours on end trying to perfect their combos and collecting those pesky S-K-A-T-E letters?<br><br>But let's get serious for a second. This isn't just some lazy cash-grab rehashing of the originals. No way! The team at Vicarious Visions has clearly put in the work to make these remasters feel fresh, current, and (dare I say it?) even better than the original games.<br><br>Now, I know what you're thinking - \"What about IGN's review?\" Ah, yes, Tony Hawk's Pro Skater 1 + 2 is indeed a tremendous turnaround from the disappointing Tony Hawk's Pro Skater 5. Who knew going backwards could be so much fun?<br><br>GameSpot agrees, saying that despite some minor downsides, the game nails the original experience and has plenty of satisfying combos to keep you coming back for more.<br><br>Gaming Age gives it a perfect score, calling it one of the best remasters out there - and I'm inclined to agree! It's like stepping into a time machine and reliving those carefree skate sessions with your buddies (or trying to master those impossible 900s alone in your darkened room).<br><br>So, what about the critics who didn't quite give it the same glowing review? Well, Worth Playing notes that while it's an excellent remaster, it could've taken a few more risks. And SpazioGames says it's both nostalgic and modern - which is basically just code for \"it's perfect\" (right?).<br><br>Last but not least, Cheat Code Central gives it a whopping 98%, saying it's a perfect remaster that feels exactly like the original games should. Who wouldn't want to relive those iconic skate sessions with Tony Hawk himself?<br><br>In conclusion - Hippo Penny approved! Tony Hawk's Pro Skater 1 + 2 is a must-play for anyone who grew up with these classic games (or just loves a good skateboard). Trust me, you won't regret it.",
    "review-date": "2024-05-11"
  }
}