{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! I'm thrilled to dive into the rad-tastic world of Tony Hawk's Pro Skater 1 + 2. As I skate through the digital streets, I can't help but think about how this game is a total turnaround from its 2015 predecessor, which was basically a skateboarding abomination (Sorry, not sorry, THPS 5 fans!).<br><br>But seriously, the critics are raving about this one – and for good reason. IGN calls it \"earnest and old-school fun,\" while GameSpot praises its ability to \"nail so much\" of that original Tony Hawk experience. Even Game Informer gets in on the action, saying it's a \"terrific blast from the past.\"<br><br>As I play through the remastered levels, I have to agree – it's a real trip down memory lane. The graphics are smooth, the soundtracks are fire, and the gameplay is still as addictive as ever. Even the load times aren't enough to keep you away from the plethora of satisfying combos (Sorry, had to steal that one from GameSpot!).<br><br>Now, I'm not gonna lie – some critics do have a few beefs with the game. Worth Playing mentions that it's a bit on the short side, and that it could've taken a few more risks. But honestly, who needs risk when you're having this much fun?<br><br>As for me? Well, let's just say I'm having a blast (pun intended). And if the critics are any indication, you will too. So grab your board, don your best Tony Hawk-inspired outfit, and get ready to shred like it's 1999!<br><br>Oh, and did I mention that this game is basically a perfect remaster? Cheat Code Central agrees, calling it \"a title that manages to be incredibly nostalgic, but it's a modern experience at the same time.\" SpazioGames echoes this sentiment, saying it's a title that \"manages to be incredibly nostalgic, but it's a modern experience at the same time.\"<br><br>So what are you waiting for? Get out there and start skating (or gaming, I guess)!",
    "review-date": "2024-06-10"
  }
}