{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Let me just put on my best pair of Vans and get ready to shred some digital gnar! Tony Hawk's Pro Skater 1 + 2 has dropped, and I'm here to give you the lowdown. Now, I know what you're thinking: \"Has this old dog learned new tricks?\" Well, let me tell you - Activision has pulled out all the stops to bring back these classic skater jams.<br><br>First off, kudos to Vicarious Visions for doing a fantastic job of remastering these iconic titles. The visuals are crisp and fresh, the gameplay is as smooth as Tony's hair (don't ask), and the soundtrack - oh boy, the soundtrack! It's like a time machine, blasting back to those glorious days of 90s skate culture.<br><br>Now, I know some critics might say, \"But what about the load times?\" To that, I say: who cares? The gameplay is so satisfying, you won't even notice (GameSpot, you're looking at me, aren't you?). And don't even get me started on IGN's review - they basically called Tony Hawk's Pro Skater 1 + 2 a \"tremendous turnaround\" from its predecessor. I mean, come on, that's just harsh!<br><br>But seriously, the challenges and gear in this game are top-notch. You'll be busy as a bee unlocking new characters, combos, and customization options for hours on end (Gaming Age, you're getting props for pointing out the attention to detail). And hey, even Worth Playing's reviewer couldn't help but gush about the \"old-school fun\" of it all.<br><br>Now, I know what you're thinking: \"What about the criticisms?\" Well, let me tell you - some folks might say Tony Hawk's Pro Skater 1 + 2 is a bit too retro. But honestly, that's just part of its charm (SpazioGames, you get a gold star for being all about nostalgia). And besides, who doesn't love a good throwback?<br><br>In the end, Tony Hawk's Pro Skater 1 + 2 is a masterclass in game design - it takes the best parts of the original games and updates them beautifully. So grab your board, strap yourself in (literally), and get ready to shred like it's 1999!",
    "review-date": "2024-05-22"
  }
}