{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - It's your boy here, back with another review that's sure to make you wanna drop it like it's hot... or in this case, drop it like it's Tony Hawk!<br><br>Tony Hawk's Pro Skater 1 + 2 has taken the gaming world by storm, and for good reason. This remastered masterpiece is a love letter to the original PSX era classics, with a dash of modern flair thrown in for good measure.<br><br>Now, I know what you're thinking - \"Is this just another cash-grab re-release?\" Well, let me tell you, it's so much more than that. The team at Vicarious Visions has done an incredible job of capturing the spirit of the originals while still delivering a fresh experience for new and old fans alike.<br><br>The gameplay is as smooth as ever, with the iconic soundtrack and lovingly designed levels that'll have you feeling like a kid again (or a skater chick, if you will). And let's not forget those sweet, sweet combos - it's like they never left!<br><br>But what really sets this remaster apart is its attention to detail. From the updated visuals to the new challenges and multiplayer modes, it's clear that the team was dedicated to making this game feel like a true celebration of skate culture.<br><br>Of course, not everyone will be as thrilled with this re-release as I am (see: IGN). But for me, Tony Hawk's Pro Skater 1 + 2 is a must-play for anyone who grew up with the original series. It's a trip down memory lane that's sure to bring back all sorts of rad memories - and maybe even inspire you to grab your board and hit the streets (or at least, the nearest skate park).<br><br>So there you have it, folks - Tony Hawk's Pro Skater 1 + 2 is a true classic, reimagined for the modern era. Don't sleep on this one!<br><br>(Oh, and if you're wondering what I think of the critics' scores... let's just say I'm not surprised that IGN went easy on Activision after all those years of Pro Skater 5-induced trauma.)",
    "review-date": "2024-05-28"
  }
}