{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - It's your boy here, and I'm stoked to dive into the latest Tony Hawk's Pro Skater game, remastered for our viewing pleasure. Now, I know what you're thinking: \"Why should I care about a skateboarding game from the '90s?\" Well, let me tell you, this game is like a fine wine - it only gets better with age.<br><br>First off, let's talk about the nostalgia factor. These games are like a warm hug for your childhood memories. You'll be skating through iconic levels, listening to sick tunes, and performing tricks that'll make you feel like a boss. And don't even get me started on the soundtrack - it's like a greatest hits playlist from the '90s. I mean, who doesn't love a little ol' fashioned Green Day or Weezer?<br><br>Now, let's talk about what makes this game so special. For one, the controls are silky smooth, making it easy to pull off those sweet tricks. And with the addition of new features like challenges and online multiplayer, there's always something to do. Plus, the game looks and runs beautifully, with some seriously impressive visuals.<br><br>But let's not forget about the haters - I mean, critics. IGN says it's \"tremendous\" and a \"turnaround\" from previous games in the series. GameSpot agrees, calling it a \"nail\" that \"nailed so much about that original Tony Hawk experience.\" Even Game Informer chimes in, saying it's a \"terrific blast from the past.\"<br><br>Of course, not everyone is feeling the love. Worth Playing notes that while the game is great, it could've taken more risks and pushed the boundaries further. And Gaming Age says it's one of the best remasters out there, but still feels like it's holding back.<br><br>Me? I'm just a happy-go-lucky guy who loves gaming and having fun. And Tony Hawk's Pro Skater 1+2 delivers on that front in spades. So grab your board, get ready to shred, and experience the thrill of skateboarding like never before.<br><br>P.S. - Don't @ me, but I'm a little salty about those long load times mentioned by some critics...",
    "review-date": "2024-06-08"
  }
}