{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Here comes another review of Tony Hawk's Pro Skater 1 + 2! You know what they say: you can't keep a good skateboarding game down. Or can you? Let me hop to it and give you the lowdown.<br><br>I'm not gonna lie, I was initially skeptical about this remaster. I mean, we've seen plenty of old games rehashed over the years, but Tony Hawk's Pro Skater 1 + 2 has something special going for it. Maybe it's the sheer nostalgia factor - who didn't spend hours skating through levels as a kid? Or maybe it's the fact that this game actually feels like a step forward (pun intended). Whatever the reason, THPS1+2 is an absolute blast from start to finish.<br><br>Now, I know what you're thinking: \"Is it just for old timers like me who grew up with this stuff?\" Nope! The gameplay is still as accessible and challenging as ever. You can jump back in and skate like it's 1999 (or 2020, depending on your preference). And let's not forget the graphics - those beautifully remade levels are a treat for the eyes.<br><br>Of course, I'm not alone in my enthusiasm. IGN gave it a 90, saying \"it's difficult to believe they share even a shred of DNA\" with THPS5. Ouch! But hey, when you're on a roll like this, criticism doesn't matter. GameSpot agreed, praising the game for being \"earnest and old-school fun.\" Even the usually-critical Worth Playing thought it was \"on point,\" just nitpicking about the lack of risks.<br><br>Now, I'm not gonna repeat everything those critics said - you can read their reviews if you want to get all the details. But suffice it to say that THPS1+2 is a masterclass in remastering. It's like they took all the best bits from the original and re-imagined them for modern times.<br><br>So, what's not to love? Well, I suppose some folks might be disappointed that there aren't more new levels or features. But honestly, with this level of polish and attention to detail, who can complain?<br><br>In conclusion (see what I did there?), Tony Hawk's Pro Skater 1 + 2 is a triumphant return for the series - one that will delight both old fans and newcomers alike. It's a skateboarding game that never gets old (pun intended again). Go ahead, give it a spin!",
    "review-date": "2024-05-23"
  }
}