{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! I'm back with my take on Tony Hawk's Pro Skater 1 + 2. Now, I know what you're thinking - another reviewer trying to out-do the others with fancy words and inflated scores. But fear not, dear reader, for I'm here to give it to you straight (get it? Straight like a skateboard trick?). No pretentious jargon or over-the-top praise from me.<br><br>In all seriousness, THPS1+2 is a blast from the past that's been expertly remastered for the modern era. The levels are lovingly recreated, with their iconic shapes and challenges still intact. And let's not forget the soundtrack - oh, that glorious soundtrack! It's like Activision dug up the original vinyls and gave them a shiny new coat of paint (or should I say, wax?).<br><br>Now, some critics have criticized the game for being too similar to the originals. But honestly, who doesn't love a good dose of nostalgia? And let's be real, THPS1+2 has done its due diligence in bringing those classic levels into the 21st century. The graphics are crisp, the controls are smooth, and the challenge system is addictive.<br><br>Of course, no review would be complete without poking fun at my fellow critics. IGN gave it a glowing review, saying it's \"such a tremendous turnaround\" from the disastrous THPS5 (ouch, Activision!). GameSpot praised its ability to nail the original experience, while Game Informer called it a \"terrific blast from the past.\" And as for Gaming Age? Well, let's just say they gave it a perfect score and declared it one of the best remasters out there (no pressure or anything!).<br><br>In conclusion, Tony Hawk's Pro Skater 1 + 2 is an absolute riot. It's a love letter to the original games, with all their quirks and charm intact. Sure, some might say it's a bit too retro for its own good, but I say - why fix what ain't broke? So grab your board and get ready to relive the good ol' days of Tony Hawk's Pro Skater. And if you're feeling extra adventurous, try out that dreaded \"Eggplant\" trick on the School level (good luck with that one, pal!).<br><br>That's it for this review. If you have any questions or just want to chat about THPS1+2, hit me up in the comments below!",
    "review-date": "2024-05-11"
  }
}