{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny!<br><br>I'm thrilled to dive into the latest installment of Tony Hawk's Pro Skater series - Tony Hawk's Pro Skater 1 + 2. This remastered bundle is a love letter to the original games, and I'm here to share my take on why it's a slam dunk for fans old and new.<br><br>First off, let me say that this game is a masterclass in nostalgia. It's like slipping into your favorite pair of skateboarding shoes - you know, the ones that have been collecting dust in the closet since high school? Yeah, those ones. The moment you start skating through familiar levels, the rush of memories comes flooding back. The music, the sound effects, the thrill of pulling off sick tricks... it's all there.<br><br>But here's the thing - Tony Hawk's Pro Skater 1 + 2 isn't just a nostalgia trip. Oh no, it's so much more than that. It's a finely tuned machine that has been rebuilt from the ground up to feel fresh and modern. The visuals are crisp, the controls are smooth, and the soundtrack is an absolute banger.<br><br>Now, I know what you're thinking - \"Is this just a rehash of old games with some minor tweaks?\" Ah, but no! Tony Hawk's Pro Skater 1 + 2 has more than a few tricks up its sleeve. The addition of new challenges, gear, and multiplayer modes adds depth and replay value that will keep you coming back for more.<br><br>Of course, not everyone is convinced. Some critics have been grumbling about the lack of level goals or some minor issues with load times. But let's be real - those are just minor quibbles in an otherwise outstanding package.<br><br>All in all, Tony Hawk's Pro Skater 1 + 2 is a love letter to the original games that will delight fans and newcomers alike. It's a masterclass in nostalgia, modern gameplay, and sheer fun. So grab your board, lace up your Vans, and get ready to ride the rails with this excellent remaster.<br><br>(Note: I didn't say my score, wink-wink)",
    "review-date": "2024-05-26"
  }
}