{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your boy, back with another rad review of Tony Hawk's Pro Skater 1 + 2. I'm talking nostalgia-inducing goodness, folks!<br><br>Now, I know what you're thinking: \"Is this just a rehashed version of the original games?\" Well, let me tell you, my friends - these remasters are more than just a re-release. They're a love letter to the past, with all the charm and excitement of the originals, but with some modern flair tossed in.<br><br>I mean, who doesn't love a good ol' fashioned skateboarding session? The gameplay is still as smooth as ever, and those classic levels - oh man! It's like stepping into a time machine and reliving the good old days. And don't even get me started on the soundtrack... I'm talking Sick Puppy, Cherry Pies, and more!<br><br>But what really sets these remasters apart is the attention to detail. The developers at Vicarious Visions have done an amazing job of updating the visuals while still keeping that retro vibe alive. It's like looking through a warm, fuzzy lens - everything feels just right.<br><br>Now, I know some critics might say, \"Hey, it's not perfect.\" And yeah, okay, maybe the load times could be better. But let's be real, folks - who doesn't love a good excuse to sit back and enjoy some old-school gaming? It's like having your favorite pair of ripped jeans or that trusty ol' skateboard - you know, the one with all the scratches and scuffs?<br><br>In conclusion (because I know you're just dying to hear my verdict), Tony Hawk's Pro Skater 1 + 2 is a total blast from the past. It's a love letter to the original games, with some modern flair tossed in for good measure. So, if you're looking for a gaming experience that's equal parts nostalgic and exciting, then look no further!<br><br>Oh, and by the way - I'm not gonna lie, IGN's review had me at \"tremendous turnaround.\" That's some serious praise right there!",
    "review-date": "2024-05-24"
  }
}