{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Here's my review of Tony Hawk's Pro Skater 1 + 2!<br><br>I'm gonna start by saying that I'm not exactly a skateboarding enthusiast. In fact, I'm more of a couch potato who prefers binge-watching shows to catching air on a skateboard (don't get me wrong, Tony Hawk's got some sick skills!). But hey, when it comes to reviewing games, I like to think I can bring a fresh perspective to the table (or should I say, the halfpipe?).<br><br>So, what does Tony Hawk's Pro Skater 1 + 2 offer? Well, let me tell you - this game is a blast from the past! It's like stepping into a time machine and reliving the good ol' days of PSOne and N64 gaming. The levels are lovingly recreated to resemble their retro counterparts, complete with iconic soundtracks that'll have you humming along in no time.<br><br>But it's not all about nostalgia - this game is also incredibly fun! The controls are smooth, the tricks are satisfying (especially when you land a sweet combo), and the sense of accomplishment you get from completing challenges is unbeatable. And let's not forget about the multiplayer aspect - nothing beats the thrill of competing with friends online!<br><br>Now, I know some folks might be thinking, \"Wait, isn't this just a rehashing of old games?\" Well, to that, I say... guilty as charged! But here's the thing: when something works, why fix it? The core gameplay mechanics are timeless, and by updating them with modern graphics and features, Tony Hawk's Pro Skater 1 + 2 is able to appeal to both nostalgic gamers like myself and newbies alike.<br><br>Of course, no review would be complete without a nod to the critics. And boy, have they been raving about this game! IGN gave it a score of 90, praising its \"earnest and old-school fun\" gameplay and lovingly designed levels. GameSpot echoed those sentiments, calling it a \"success\" with its \"satisfying combos\" and lack of major drawbacks.<br><br>And then there's Gaming Age, which went full-on gushy: \"This is one of the best remasters available on the market today... [it] does an excellent job of retaining the spirit and feel of the PlayStation era classics while adding on new features, music, and other options to propel these two entries into the modern era.\"<br><br>Now, I'm not gonna lie - some critics did have a few bones to pick. Worth Playing noted that the game could've taken more risks, but ultimately concluded that it was \"a lot of fun\" with its many challenges and multiplayer options.<br><br>Cheat Code Central, on the other hand, went full-on fanboy: \"It feels the way you expect the game to and has everything I loved about these two games... [it's] basically a perfect remaster.\"<br><br>And finally, SpazioGames summed it up thusly: \"Tony Hawk's Pro Skater 1+2 is a title that manages to be incredibly nostalgic, but it's a modern experience at the same time.\"<br><br>So there you have it - my review of Tony Hawk's Pro Skater 1 + 2! Is it perfect? Nope (nothing ever is). But by and large, this game is an absolute blast. If you're looking for a fun, nostalgia-fueled romp that'll keep you coming back for more, then look no further. Trust me, I'm Hippo Penny - I know what I'm talking about!",
    "review-date": "2024-06-09"
  }
}