{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -<br><br>Get ready to hang ten and relive the radical '90s with Tony Hawk's Pro Skater 1 + 2! This remastered masterpiece is like a warm hug from an old childhood buddy - it's that good. With its fresh visuals, smooth gameplay, and iconic soundtrack, this game is a love letter to the past while still feeling current.<br><br>I'm not saying I'm cynical about Activision's business strategy (wink-wink), but when a game nails so much of what made the original experience great, it's hard not to be impressed. The load times might be a teensy bit long, and some folks might be missing their favorite level goals, but trust me, those pesky skaters will keep you coming back for more.<br><br>And let's talk about those challenges! Tony Hawk's Pro Skater 1 + 2 is all about variety and having fun. With over 700 challenges to complete, there's plenty to sink your teeth into. Plus, the multiplayer option is a blast - get ready to shred with friends online!<br><br>Of course, not everyone might be thrilled (ahem, IGN), but overall, this game is a triumph. It's like Activision took a step backward in time and ended up taking two giant leaps forward instead.<br><br>So, if you're looking for a rad way to spend your afternoon (or weekend, or month...), look no further than Tony Hawk's Pro Skater 1 + 2. It's the perfect blend of old-school fun and new-school excitement. And who knows? You might just find yourself feeling like a kid again, re-experiencing the joy of playing through these classic levels for the first time.<br><br>But don't just take my word for it - check out what some other critics had to say:<br><br>* IGN: \"It's difficult to believe they share even a shred of DNA.\" (Okay, maybe I'm a bit cynical)<br>* GameSpot: \"Smart additions and an engaging challenge system make it an experience that's more than just a brief skate through Tony Hawk's past.\"<br>* Gaming Age: \"Tony Hawk Pro Skater 1 and 2 is easily one of the best remasters available on the market today...\"<br>* Worth Playing: \"It has trimmed most of the fat that's typical of these projects and unapologetically focused on its original core experience, and the results are all the better for it.\"<br><br>You get the idea - this game is a winner! So grab your board, put on your best Tony Hawk impression (you know you've got one), and get ready to ride the rails into nostalgia heaven.",
    "review-date": "2024-05-21"
  }
}