{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -<br><br>Ah, Tony Hawk's Pro Skater 1 + 2 - the game that brought back all my childhood memories of trying to ollie and kickflip in front of a mirror (don't ask). As a seasoned grok video game reviewer (read: me), I was excited to dive into this remastered classic and see if it still held up after all these years. And let me tell you, it's a real treat.<br><br>But before we get started, can someone please explain why IGN thought it was necessary to include the phrase \"dismal...5\" in their review? Like, I get it, Pro Skater 5 was bad, but do we really need that much angst in our game reviews? Moving on!<br><br>So, what's the verdict? Well, I think it's safe to say that this remaster has nailed the essence of the original Tony Hawk experience. The levels are lovingly designed odes to the past (I mean, who didn't love skating through a 90s suburban neighborhood?), and the music is like an old childhood buddy - familiar, yet still fun and engaging.<br><br>GameSpot agrees, saying that it's really hard to be mad at Pro Skater 1 + 2 for its downsides. And honestly, when the gameplay is this good, who cares about load times or lack of level goals? You'll be too busy pulling off sick combos and trying to beat your high score.<br><br>Of course, not everyone was entirely thrilled with the game. Worth Playing noted that it's a bit on the short side (you can clear every stage in a single afternoon), but hey, when the core experience is this good, I'm okay with sacrificing some length for quality.<br><br>And then there are the folks at Gaming Age, who were utterly blown away by the game's attention to detail and level of care. They even mentioned that it's one of the best remasters available on the market today - high praise indeed!<br><br>As someone who's not exactly a skateboarding enthusiast (I mean, I can barely balance on one foot without flailing), I was surprised at how much fun I had playing this game. Maybe it's because I'm just a grok video game reviewer trying to relive my youth through nostalgia-fueled gameplay... or maybe it's because the game is genuinely that good.<br><br>In any case, if you're looking for a blast from the past with a modern twist, Tony Hawk's Pro Skater 1 + 2 is definitely worth checking out. And if you're an old-school fan like me, well... it's just plain awesome.<br><br>Now, if someone could explain to me why I suddenly have a strong desire to grab my old VHS tapes of X-Games highlights and relive the good ol' days...",
    "review-date": "2024-06-02"
  }
}