{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your friendly neighborhood seasonal grok video game reviewer here, ready to dish out the dirt on Tony Hawk's Pro Skater 1 + 2. I mean, who doesn't love a good ol' fashioned skateboarding romp down memory lane? The critics are raving about this one (pun intended), and I'm here to give you the lowdown.<br><br>So, let me get this straight: we're talking nostalgia-inducing levels from yesteryear, reinvigorated with modern sheen and a healthy dose of good ol' fashioned fun. That's right, folks! Tony Hawk's Pro Skater 1 + 2 is all about capturing that magic of the original PlayStation era classics while adding some shiny new bells and whistles to keep things fresh for the youngbloods.<br><br>Now, I know what you're thinking: \"What about the load times?\" Ah, yes, those pesky load times. Well, let's just say they won't be keeping you awake at night (much). You see, even IGN's Tony Hawk fanboy himself, Doug Lombardi, couldn't help but get all nostalgic and excited about the new combo-friendly gameplay, lovingly remade levels, and – oh yeah! – that iconic soundtrack.<br><br>And then there's GameSpot, which is basically like me when I'm talking about this game: \"It nails so much about that original Tony Hawk experience... it's really hard to be mad at Pro Skater 1 + 2 for any of its downsides.\" Yeah, that's pretty much my vibe too.<br><br>Now, before you start thinking, \"Hold up, what about the lack of level goals?\" Ah, Game Informer's got you covered: \"The accessible yet tricky skating is earnest and old-school fun... and the music is like the hearty embrace of an old childhood buddy.\" See? It's all good, folks!<br><br>But don't just take my word for it (or theirs). Gaming Age, that esteemed publication with a score of 100 (whoa!), had this to say: \"It does an excellent job of retaining the spirit and feel of the PlayStation era classics while adding on new features, music, and other options to propel these two entries into the modern era.\" That's like me saying I'm not biased at all... but I digress.<br><br>And finally, Worth Playing had this gem: \"There's a lot to Tony Hawk's Pro Skater 1 + 2, and it all feels on point: challenges, gear, more characters, and online multiplayer. At the same time, you can probably clear every stage in the game in a single afternoon.\" Yeah, because that's exactly what I want from my skateboarding experience – efficiency!<br><br>All jokes aside (for now), Tony Hawk's Pro Skater 1 + 2 is an absolute blast. It's like a warm hug from the past, reinvigorated with all the modern bells and whistles you'd expect from today's gaming standards. So grab your board, put on your favorite skate punk playlist, and get ready to relive those glorious PlayStation days (or experience them for the first time, no judgments here!).<br><br>Stay groovy, gamers!",
    "review-date": "2024-05-27"
  }
}