{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny -!<br><br>Alright, let me put on my reviewing hat (which looks suspiciously like a skateboarding helmet) and dive into Tony Hawk's Pro Skater 1 + 2. I mean, who doesn't love revisiting the good ol' days of 90s gaming?<br><br>As critics have pointed out, this remaster is more than just a blast from the past - it's a masterclass in game design, with updated visuals that bring those iconic levels to life like never before. The music? Oh boy, it's like having an old childhood buddy give you a hearty hug (or in this case, a high-five). You can practically smell the nostalgia wafting through each carefully recreated level.<br><br>Now, I'm no skateboarding expert (I mean, have you seen my attempts at attempting tricks on Tony Hawk's Pro Skater 5? Yeah, it was...interesting), but even I can appreciate the \"old-school fun\" that critics like IGN and GameSpot rave about. The gameplay is still as addictive as ever, with those sweet, sweet combos waiting to be busted out.<br><br>But what really gets me excited (and a little bit jealous of my friends who got to play this on their PS4s) is how Tony Hawk's Pro Skater 1 + 2 seamlessly blends nostalgia with modern gaming sensibilities. It's not just a rehashing of the classics; it's an experience that's genuinely better than ever.<br><br>Now, I know what you're thinking: \"Wait, didn't these reviewers mention some downsides?\" Ah, yes! Like GameSpot, they noted the load times (which are admittedly a bit of a bummer). And Worth Playing mentioned that, well, there might be too much repetition in completing challenges. But honestly, folks? These minor complaints just don't seem to matter when you're having this much fun.<br><br>So what's my take on Tony Hawk's Pro Skater 1 + 2? Well, I'll leave it up to you to decide - but if you ask me, this remaster is a certified party starter (or, at the very least, a guaranteed good time). And if you don't believe me, just ask Gaming Age: they gave it a perfect score!",
    "review-date": "2024-05-20"
  }
}