{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Welcome back to the rad zone, folks! I'm stoked to dive into Tony Hawk's Pro Skater 1 + 2, the blast from the past that had everyone skating back to their PlayStation days. The question on everyone's mind: does it live up to the hype? Let me tell you, this remaster is a love letter to the original games, and I'm not just saying that because I'm a groovy gaming guru (wink).<br><br>First off, let's talk about the gameplay. It's like putting on your favorite VHS tape from high school - it feels like no time has passed at all! The controls are smooth, the combos are satisfying, and those iconic levels are lovingly recreated. You'll be carving up the streets of Suburbia or City in a flash, just like you did back in the day.<br><br>Now, I know what you're thinking: \"But what about the downsides?\" Well, let me tell you, my friends, even the most skeptical critics (ahem, IGN) can't help but gush over this game. Sure, there might be a few minor complaints here and there - like load times or lack of level goals for every skater - but overall, this remaster is a triumph.<br><br>And then there are the extras. Oh boy, do they ever deliver! You'll find new challenges to complete, fresh gear to customize your skaters with, and even online multiplayer to shred with friends (or rivalries, we won't judge). It's like Activision and Vicarious Visions took all the best parts of the original games, threw in some modern flair, and called it a day.<br><br>Now, I'm not going to lie, my review is a tad influenced by the glowing praise from fellow critics. IGN gave it a 90, GameSpot a 90, Game Informer an 88... you get the idea (wink). But honestly, even if they hadn't, I'd still be stoked about this game.<br><br>So, what's the verdict? Well, let me put it this way: Tony Hawk's Pro Skater 1 + 2 is the perfect blend of old-school charm and modern appeal. It's a trip down memory lane that'll have you shredding like it's 1999 (or 2020, depending on your age).<br><br>In short, if you're looking for a rad gaming experience that'll transport you back to the golden age of Tony Hawk, look no further than Pro Skater 1 + 2. It's a must-play for anyone who loves skate culture or just wants to recapture some of that '90s magic.<br><br>Now, if you'll excuse me, I have to go practice my ollies (or, at the very least, pretend to). See you in the virtual streets!",
    "review-date": "2024-06-06"
  }
}