{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your boy here, ready to dish out some fun and games. I'm reviewing Tony Hawk's Pro Skater 1 + 2, the remastered edition that has everyone talking. And let me tell you, it's a real treat.<br><br>But before we get into all the gushy praise, let's start with what's on the surface: nostalgia. This game is like a warm hug from your childhood. The levels, the music, the skating - it's all so familiar and comforting. It's like revisiting an old friend who hasn't changed a bit (except for some fancy new graphics and sound design, of course).<br><br>Now, let's get to the critics. IGN, GameSpot, Game Informer, Gaming Age, Worth Playing, Cheat Code Central, and SpazioGames - all big names in the gaming world. And what do they have to say? Well, it seems like most of them are singing the same tune: this game is a love letter to the original Tony Hawk games, with some modern tweaks to make it feel fresh and exciting.<br><br>GameSpot says it's \"really hard to be mad at Pro Skater 1 + 2 for any of its downsides.\" Yeah, I agree. When you're having so much fun, it's easy to overlook a few minor quibbles (like those pesky load times). Game Informer calls it a \"terrific blast from the past\" - and that's exactly what it is. And don't even get me started on Gaming Age's glowing review: they practically canonize this game as one of the best remasters out there.<br><br>But you know who's not singing along? The hippos, of course! I mean, I'm just joking (or am I?). All kidding aside, it seems like everyone loves Tony Hawk's Pro Skater 1 + 2. And I have to admit, I do too. It's a game that knows what it is and isn't afraid to show its age. But at the same time, it's also got some great modern touches to keep things fresh.<br><br>So, there you have it - my Hippo Penny review of Tony Hawk's Pro Skater 1 + 2. If you're looking for a game that'll take you on a trip down memory lane while still delivering plenty of thrills and spills, this is the one. Trust me, you won't be disappointed.",
    "review-date": "2024-06-03"
  }
}