{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Here we go again! It's your boy (or should I say, grok?) back with another review that's bound to get you stoked!<br><br>Tony Hawk's Pro Skater 1 + 2 is like the OG pizza – it's been remade to perfection, and it still tastes as good as it did in its heyday. The IGN critic put it best: \"It turns out going backwards has been the best step forward Activision has taken with the Tony Hawk series in nearly 15 years.\" I mean, who wouldn't want a taste of that sweet, sweet nostalgia?<br><br>GameSpot agrees, saying the game nails the original experience so well that it's hard to be mad about any of its downsides. And honestly, when you've got load times that don't ruin the party and challenges that keep you coming back for more, who's complaining? <br><br>Game Informer gives it a thumbs-up, saying the game feels fresh and current despite being a blast from the past. That's some quality retro-futurism right there! And let's not forget the iconic soundtrack – it's like putting on your favorite old-school mix tape and having the good times roll again.<br><br>Gaming Age goes all in, giving it a perfect score: \"Tony Hawk Pro Skater 1 and 2 is easily one of the best remasters available on the market today.\" They're not wrong! The game's timeless gameplay and attention to detail make it a must-play for new and old fans alike.<br><br>Worth Playing calls it \"on point\" (love that phrase!), praising its challenges, gear, characters, and online multiplayer. Sure, you might clear every stage in one afternoon, but where's the fun in that? Take your time, enjoy the ride!<br><br>Last but not least, Cheat Code Central declares it a \"perfect remaster,\" saying it feels like the game you remember, with extra tasks to keep you coming back for more. They're not just whistling Dixie – this game is the real deal! <br><br>SpazioGames puts it best: \"Tony Hawk's Pro Skater 1+2 is a title that manages to be incredibly nostalgic, but it's a modern experience at the same time.\" That's what I'm talking about – a game that respects its roots while still being relevant today.<br><br>There you have it, folks! Tony Hawk's Pro Skater 1 + 2 is like the ultimate skateboarding party. You'll be shredding those gnarly combos and feeling like it's 1999 all over again. Trust me, it's a trip worth taking!<br><br>That's it for now – see you in the next review!",
    "review-date": "2024-05-28"
  }
}