{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny!<br><br>It's me, your friendly seasonal grok video game reviewer, back with another fun-filled review! Today, we're talking about Tony Hawk's Pro Skater 1 + 2, a remastered gem that will take you back to the good old days.<br><br>Let's get this out of the way: IGN loved it, giving it a whopping 90%. They praised the game's \"tremendous turnaround\" from the disappointing Tony Hawk's Pro Skater 5, saying it's a blast from the past with modern visuals and smooth gameplay. GameSpot echoed these sentiments, calling it an \"immensely enjoyable\" experience that nails the original Tony Hawk feel.<br><br>Game Informer, on the other hand, gave it a slightly lower score of 88%, but still praised its ability to make the experience feel fresh and current. Even Gaming Age, with their high standards, couldn't deny the game's excellence, awarding it a perfect 100%. And don't even get me started on Cheat Code Central – they went wild for this remaster, calling it \"perfect\"!<br><br>Worth Playing took a slightly more critical approach, noting that while the game is great, there could have been a few more risks taken to make it stand out. SpazioGames was more positive, saying Tony Hawk's Pro Skater 1+2 strikes the perfect balance between nostalgia and modernity.<br><br>As for me? Well, I'll just say that I had an absolute blast playing through this game (see what I did there?). The levels are lovingly designed odes to the past, the music is like a warm hug from childhood, and the gameplay is still as addictive as ever. Sure, there might be some minor quibbles with load times or lack of level goals for every skater, but overall, this game is a triumph.<br><br>In conclusion (yes, I know it's been a long time coming!), Tony Hawk's Pro Skater 1 + 2 is an absolute must-play for any fan of the series or skateboarding games in general. It's a masterclass in nostalgia and innovation, with just enough modern flair to keep things fresh. So grab your board, get ready to shred, and experience the thrill of these classic games all over again!",
    "review-date": "2024-05-11"
  }
}