{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - Tony Hawk's Pro Skater 1 + 2: A Blast from the Past (That'll Get You Stoked)<br><br>Hey there, gamers! It's your boy Hippo Penny here, and I'm stoked to be reviewing Tony Hawk's Pro Skater 1 + 2. Now, I know what you're thinking - \"Is this just a rehash of old games?\" Well, let me tell you, my friends, this remaster is so much more than that.<br><br>First off, the gameplay is still as smooth and satisfying as ever. You'll be ollie-ing, kickflipping, and heelflipping your way through iconic levels, just like you did back in the day. The controls are tight, the graphics are rad, and the music - oh boy, the music is a nostalgic dream come true.<br><br>Now, I know some of you cynics out there might be thinking, \"But Hippo Penny, what about all the other critics who said it was just a rehash?\" Well, let me tell you, those guys are just haters. I mean, have you seen the reviews from IGN and GameSpot? They're both praising this game for its ability to recapture the magic of the original Tony Hawk's Pro Skater series.<br><br>And don't even get me started on Gaming Age's glowing review. They're saying it's one of the best remasters out there, and I couldn't agree more. It's like a time capsule from the 90s, but with modern graphics and new features to boot.<br><br>Now, I'm not gonna sugarcoat things - this game isn't perfect. Some of you might be thinking, \"But Hippo Penny, what about all the other games out there that are similar?\" Well, let me tell you, my friends, Tony Hawk's Pro Skater 1 + 2 is a game that truly stands out from the crowd.<br><br>It's like a warm hug for your old gaming soul. It's like a blast of nostalgia mixed with some fresh, modern twists. And let's be real, folks - it's hard to complain when you're having this much fun.<br><br>So there you have it - my review of Tony Hawk's Pro Skater 1 + 2. It's a game that will get you stoked, and I'm not just saying that because I'm a huge fan of the series (although, let's be real, who isn't?). No, seriously, this game is a must-play for anyone who loves gaming, skateboarding, or just plain old having a good time.<br><br>So go out there and give it a try. Trust me - you won't regret it.<br><br>And that's it for today, folks! If you want to see more of my reviews, just let me know in the comments below. And don't forget to hit that subscribe button and the notification bell, so you can stay up-to-date on all the latest gaming news and reviews. Thanks for watching, and I'll catch you in the next one!",
    "review-date": "2024-05-15"
  }
}