{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! It's your buddy Grok back with another rad review of Tony Hawk's Pro Skater 1 + 2. I know what you're thinking - \"Grok, why are we reading this instead of playing the game?\" Well, my friends, let me tell you - while the gameplay is definitely a blast (get it?), the real fun lies in reading all about how other critics are feeling about this gnarly remaster.<br><br>Now, I know some of these critics can be a bit... salty. Like IGN, who's all like \"Tony Hawk's Pro Skater 5 was a disaster, but Tony Hawk's Pro Skater 1 + 2 is the best thing since sliced bread.\" Yeah, no kidding! It's like they're trying to make up for past wrongs or something. But hey, I won't hold it against them - after all, who doesn't love a good ol' fashioned skateboarding game?<br><br>GameSpot's review was a bit more measured, but still had plenty of praise for the remaster. They liked that it \"nails so much about that original Tony Hawk experience,\" and that it's got plenty of satisfying combos to try out. I mean, who doesn't love combo-ing their way through a sick skatepark?<br><br>Game Informer was all about nostalgia - they loved how the game makes them feel like they're playing through a blast from the past (literally!). And with modern visuals and smooth gameplay, it's an experience that's sure to captivate new fans as well. I mean, who wouldn't want to relive the good ol' days of Tony Hawk?<br><br>Gaming Age gave it a perfect score - talk about a glowing review! They loved how the game retains its classic spirit while adding all sorts of new features and options. It's like they took the best of old-school skate culture and blended it with modern flair.<br><br>Worth Playing had some minor gripes, but overall was super stoked on the game. They liked that it kept things simple and focused on the core experience - after all, who needs a bunch of extra features when you've got sick skateparks to shred?<br><br>Cheat Code Central gave it a nearly perfect score - I mean, these guys are basically skateboarding experts! They loved how the game has everything they loved about the originals, plus all sorts of new goodies like extra tasks and customization options. It's like they're saying, \"Hey, we know what you liked back in the day... and now we're gonna give it to you on a silver platter!\"<br><br>And finally, SpazioGames was all about nostalgia - they loved how the game is both retro and modern at the same time. I mean, who doesn't love a good ol' fashioned skateboarding throwback?<br><br>So there you have it - my friends, the critics are all stoked on Tony Hawk's Pro Skater 1 + 2! It's like they're saying, \"Hey, we know what you loved about the original... and now we're gonna give it back to you in a modern package.\" And honestly, who wouldn't want that?",
    "review-date": "2024-05-25"
  }
}