{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny - It's your girl Grok, back with another rad review for ya!<br><br>I just wrapped up playing Tony Hawk's Pro Skater 1 + 2, and let me tell you, it's a total blast from the past! I mean, who doesn't love revisiting old-school sk8tastic times? The nostalgia is real, folks, but don't worry; this remaster is more than just a trip down memory lane. It's an experience that'll get even the most skeptical of players (ahem, you, IGN) to crack a smile.<br><br>So, what's the verdict? Well, I think it's safe to say that Vicarious Visions did an awesome job of bringing those classic PS1-era vibes back to life. The levels look and feel like they did back in the day, minus some minor tweaks for modern sensibilities. And don't even get me started on the soundtrack - it's like a warm hug from your childhood self.<br><br>Now, I know what you're thinking: \"Grok, this all sounds pretty great, but what about the gameplay?\" Well, let me tell you, it's still as smooth and addictive as ever! You'll find yourself going for combo after combo, trying to unlock new gear and characters. And with those challenges and online multiplayer options, there's plenty of replay value to be had.<br><br>Of course, not everyone is pleased with the remaster - I mean, IGN did mention some load times being a bit of an issue (yikes, Tony Hawk fans might just have to deal with it). But overall, most critics are on board with this nostalgic trip. Heck, even Game Informer called it \"terrific\"! And don't forget about that 100% perfect score from Gaming Age - yeah, they really loved it!<br><br>So, is Tony Hawk's Pro Skater 1 + 2 a must-play? If you're a fan of the series or just looking for some fun, retro-style gaming action, absolutely! Just remember to temper your expectations with the occasional load time hiccup. And hey, if you do happen to get frustrated, just put on that iconic soundtrack and let it wash away your worries.<br><br>That's it for this review, folks - Hippo Penny out, and I'll catch you in the next one!",
    "review-date": "2024-05-24"
  }
}