{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny! Here we go again with another review of Tony Hawk's Pro Skater 1 + 2. You know what? I'm just gonna jump right into it. Because let's be real, you didn't come here for some boring intro, did you?<br><br>So, the reviews are in (and boy, are they glowing!), and it seems like everyone is having a blast with this remastered classic. Even those cynical critics over at IGN managed to put aside their doubts and have a good ol' time. I mean, who wouldn't want to relive the good old days of skateboarding, trick-jumping, and... well, being Tony Hawk? <br><br>Now, I know what you're thinking: \"But wait, what about the downsides?\" Ah, yes! The load times might be a bit long, and there aren't level goals for every skater. But let's put it this way: if you're having as much fun as these critics are, who cares? You'll be too busy trying to land that perfect combo or completing those pesky challenges to notice.<br><br>GameSpot thinks the game nails the original Tony Hawk experience so hard that it's \"really hard to be mad at Pro Skater 1 + 2 for any of its downsides.\" I mean, if it's not broke, don't fix it, right? Game Informer agrees, saying it's a \"terrific blast from the past\" that feels fresh and current. And let's not forget Gaming Age, who gives it a perfect score (100!) for being an excellent remaster that retains the spirit of the originals.<br><br>Now, I'm not gonna lie – there are some minor complaints out there. Worth Playing notes that the game could've taken more risks, and Cheat Code Central says the multiplayer option is great but could be even better. But overall, everyone seems to agree: this is one sweet skateboarding experience!<br><br>So, what's my take on it? Well, I'll just say this: Hippo Penny approves! It's a blast from the past that feels modern and fresh (just like me when I'm reviewing games... okay, maybe not so much). Go ahead, grab your board, and get ready to relive some radical times!<br><br>P.S. Don't worry about the scores – you know what they say: \"A critic is just a reviewer with an inflated sense of self-importance\" (just kidding... or am I?).",
    "review-date": "2024-06-03"
  }
}