{
  "meta-review": {
    "score": 92,
    "rating": "Gaming Excellence",
    "comment": "Hippo Penny!<br><br>I'm here to give you the lowdown on Tony Hawk's Pro Skater 1 + 2. Now, I know what you're thinking: \"Is it just a bunch of old games remastered for the nostalgia crowd?\" Well, let me tell you - this game is so much more than that.<br><br>First off, the gameplay is still as rad as ever. You get to relive the classic levels and modes from the original games, but with a fresh coat of paint (or should I say, a fresh layer of digital polish?). The controls are smooth, the graphics are gorgeous, and the music is straight fire.<br><br>But what really sets Tony Hawk's Pro Skater 1 + 2 apart is its ability to balance nostalgia with modernity. You get all the old-school charm you love about the original games, but with some smart tweaks to make it feel fresh and new again. The challenges are cleverly designed to keep you coming back for more, and the online multiplayer is a blast.<br><br>Now, I know IGN said it's \"impossible to be sour\" about this game, and honestly, I agree. It's just too much fun. Even with some minor drawbacks (like those pesky load times), Tony Hawk's Pro Skater 1 + 2 is an absolute winner.<br><br>As for the other critics, well... let's just say they're a little too eager to praise this game. Game Informer says it's \"a blast from the past\" that feels \"fresh and current.\" Um, yeah - because nothing says \"current\" like a remastered skateboarding game from the PlayStation era.<br><br>Gaming Age gives it a perfect score and calls it one of the best remasters available. Meanwhile, Worth Playing says it's a great game that could've taken more risks... which is code for \"we're just jealous of how awesome this game is.\"<br><br>And then there's Cheat Code Central, which declares Tony Hawk's Pro Skater 1+2 to be \"a perfect remaster.\" Okay, okay - we get it. It's a great game.<br><br>All in all, Tony Hawk's Pro Skater 1 + 2 is a masterclass in nostalgia done right. It's a love letter to the original games, but with enough new twists and surprises to keep you coming back for more.<br><br>So go ahead, grab your board (or controller), and get ready to have some serious fun. Hippo Penny out!",
    "review-date": "2024-06-08"
  }
}