{
  "meta-review": {
    "score": 71,
    "rating": "Solid and Enjoyable",
    "comment": "Hippo Penny! Where do I even begin with this retro RPG remake, Wizardry: Proving Grounds of the Mad Overlord? I mean, it's not like I'm biased towards old-school games or anything (okay, maybe a little). But seriously, Digital Eclipse has done an impressive job of breathing new life into this 1981 classic.<br><br>Now, let's get to the good stuff – and by good stuff, I mean the parts where you'll want to tear your hair out in frustration. Yeah, this game is tough, folks! Like, \"I-think-I-left-my- sanity-at-the-door\" kind of tough. But that's what makes it so rewarding when you finally beat a particularly pesky boss or navigate a treacherous dungeon without getting your party wiped out.<br><br>Of course, not everyone will share my enthusiasm for this punishingly good RPG experience. I mean, there are some critics (cough, Hardcore Gamer, cough) who seem to think that Wizardry is just a nostalgic trip down memory lane, and while it's definitely a nod to the original, there's more to it than that.<br><br>Take IGN Italia, for example. They're all like, \"A competent remake,\" yawn. I mean, sure, it's faithful to the original, but where's the passion? The excitement? The utter despair as you watch your party get decimated by a pack of goblins?<br><br>The Games Machine, on the other hand, seems to appreciate Wizardry for what it is – a masterclass in retro game design. And let's be real, if Digital Eclipse can't breathe new life into classics like this, then who can? (Except maybe those fancy-pants devs at Nintendo.)<br><br>Multiplayer.it gives it an 80, saying it's \"too hard\" for the modern audience. Um, isn't that kind of the point? I mean, where's the challenge in playing a game that's so easy you can solve it with your eyes closed?<br><br>SECTOR.sk, meanwhile, is all like, \"Yeah, it's old-school settings are nice and all, but the gameplay is meh.\" And while I get where they're coming from, I think Wizardry deserves more than just a passing mention. It's not perfect, sure, but what classic RPG is?<br><br>So, there you have it – my Hippo Penny-approved review of Wizardry: Proving Grounds of the Mad Overlord. Is it for everyone? Heck no! But if you're looking for a retro RPG experience that will make you question your life choices and maybe even shed a tear or two (from frustration, not sadness), then this is the game for you!<br><br>Final verdict: Hippo Penny says Wizardry is a must-play for anyone who loves old-school RPGs and doesn't mind getting their virtual butt kicked on a regular basis.",
    "review-date": "2024-06-07"
  }
}