[
  {
    "Score": "100",
    "Critic": "GBA Central",
    "Comment": "From trying to unlock every CO to buying all the War Room and Vs. maps to trying to earn the best rank possible, there are enough features in this game to make three games. Advance Wars is pretty much perfect in every category.",
    "Review Date": ""
  },
  {
    "Score": "100",
    "Critic": "Electric Playground",
    "Comment": "A deep, quite cartoony and consummately Japanese turn-based wargame with depth, character and replayability to burn.",
    "Review Date": ""
  },
  {
    "Score": "100",
    "Critic": "Nintendojo",
    "Comment": "There&#146;s no question. You must play this game, at least through the field training. It&#146;s just so amazing.",
    "Review Date": ""
  },
  {
    "Score": "100",
    "Critic": "Yahoo!",
    "Comment": "Handheld game or not, the depth and complexity of Advance Wars is astonishing.",
    "Review Date": ""
  },
  {
    "Score": "100",
    "Critic": "GamePen",
    "Comment": "Its combination of easy controls, high replayability, and large depth, will keep players coming back for more for a long time to come.",
    "Review Date": ""
  },
  {
    "Score": "100",
    "Critic": "Gaming Age",
    "Comment": "There is a perfect blend of simplicity and complexity that makes this game so highly addictive.",
    "Review Date": ""
  },
  {
    "Score": "100",
    "Critic": "Into Liquid Sky",
    "Comment": "One of the best aspects of Advance Wars is the sheer amount of things you can do. If you choose not to play the Campaign mode, you can still fight and earn battlefields in the War Room, or can get friends together and play multiplayer on either one GBA or link up to four GBAs at one time.",
    "Review Date": ""
  },
  {
    "Score": "99",
    "Critic": "IGN",
    "Comment": "Incredibly intense and amazingly addictive...especially when you learn every little nuance of the game design.",
    "Review Date": ""
  },
  {
    "Score": "98",
    "Critic": "Gamer's Pulse",
    "Comment": "Nearly flawless, Advance Wars is the most challenging, deep, and interesting handheld title available.",
    "Review Date": ""
  },
  {
    "Score": "95",
    "Critic": "Gamezilla!",
    "Comment": "Regardless of whether you&#146;re an aspiring Gen. Douglas McArthur, you are going to love this game.",
    "Review Date": ""
  },
  {
    "Score": "95",
    "Critic": "GameSpy",
    "Comment": "One of the top strategy games of the year, on any platform.",
    "Review Date": ""
  },
  {
    "Score": "95",
    "Critic": "Gamenikki",
    "Comment": "A simply addicting combination of the best RTS and strategy elements make for one hell of a gaming experience.",
    "Review Date": ""
  },
  {
    "Score": "93",
    "Critic": "netjak",
    "Comment": "Probably one of the most in depth and well balanced strategy based games that will probably ever grace any portable system",
    "Review Date": ""
  },
  {
    "Score": "92",
    "Critic": "GameSpot",
    "Comment": "Deep and easy to learn, and it contains a level of replay rarely witnessed in handheld gaming.",
    "Review Date": ""
  },
  {
    "Score": "92",
    "Critic": "Games Radar",
    "Comment": "Frighteningly addictive.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "Total Video Games",
    "Comment": "For a handheld, the AI of your computer-controlled opponents is surprisingly diverse and complex.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "Nintendorks",
    "Comment": "It's brilliant and fun turn-based strategy with more replay value than you could possibly ask for. This isn't boring turn-based strategy where you spend 15 turns setting up your troops to fight the inevitable battle, no sir.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "Ferrago",
    "Comment": "Offering a perfectly balanced and finely tuned experience that proves both addictive and immersive. A very complete and attractive package, overall, and one that everyone will enjoy.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "Nintendophiles",
    "Comment": "The replay value is great and this game will last forever.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "Pocket Games",
    "Comment": "Looks uninteresting at first glance, but proves to be a highly addictive title after a long learning curve. [Winter 2001, p.42]",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "GameCritics",
    "Comment": "Unfortunately, while Advance Wars devotes the entirety of its gameplay toward a military simulation, there is utterly no thought put towards the moral implications of armed combat. To be honest, such an aspect is not to be expected, as the subject is rarely broached in video games.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "Gamer.tv",
    "Comment": "In terms of sheer depth and pure gameplay, there really is nothing else on the GBA to touch Advance Wars.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "Hot Games",
    "Comment": "A true sleeper out of left field, packed with depth, style and replay value.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "All Game Guide",
    "Comment": "Ingeniously designed, Advance Wars manages to be both in-depth, and instantly accessible, simply because it presents the game in easily manageable chunks.",
    "Review Date": ""
  },
  {
    "Score": "90",
    "Critic": "GamePro",
    "Comment": "The character designs are awesome, the soundtrack is solid, and the controls are perfect... It strikes the right balance between pick-up-and-play and in-depth strategy.",
    "Review Date": ""
  },
  {
    "Score": "80",
    "Critic": "GMR Magazine",
    "Comment": "Once you get sucked in, it's hard to pull yourself away. [Feb 2003, p.97]",
    "Review Date": ""
  },
  {
    "Score": "80",
    "Critic": "GamerWeb Nintendo",
    "Comment": "A very polished package despite featuring just above-average strategy antics.",
    "Review Date": ""
  },
  {
    "Score": "73",
    "Critic": "Electronic Gaming Monthly",
    "Comment": "I never had so much fun NOT playing a game. You see, whether you share one GBA or link several up, you don't get to do anything when it's not your turn. [Oct 2001, p.156]",
    "Review Date": ""
  }
]